[
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/pm-no-one-is-above-the-law/article_7b548146-bb0d-11e9-bd37-6b3070eef214.html\", \"TITLE\": \" PM: No one is above the law \", \"DATE\": \"10 hrs ago \", \"CONTENT\": \"AWAITING OUTCOME: Keith Rowley {{description}} Email notifications are only sent once a day, and only if there are new matching items. AWAITING OUTCOME: Keith Rowley THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. The Prime Minister admitted he was saddened by what had happened to McDonald, but reiterated that no one was above the law. And Government Minister Fitzgerald Hinds said he and other colleagues were surprised when they heard the news of McDonald\\u2019s arrest on Thursday. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. TWO videos which show minors engaged in sexual acts with adults are now engaging the attention of police. This was confirmed by Children\\u2019s Authority chairman Hanif Benjamin yesterday. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. A PIPE FITTER who told the court he found and kept five protected turtles, has been arrested\\u2026 Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/met-office-predicts-mix-of-rain-and-sun-for-mas/article_2c52468e-1d8c-11e8-8b34-5bac57a756e8.html\", \"TITLE\": \" Met Office predicts mix of rain and sun for mas days \", \"DATE\": \"Feb 10, 2018 \", \"CONTENT\": \"{{description}} Email notifications are only sent once a day, and only if there are new matching items. REVELLERS can expect a mix of rain and sunshine for this Carnival period, according to the Met Office. Meteorologist Stefan Dickson gave a four-day weather forecast from today until Carnival Tuesday. Dickson said there will be brief showers over the next four days, with sunny conditions in-between. Here's what he had to say: 'Tonight (yesterday) we are expecting conditions to be pretty light, clear but we are expecting one or two brief showers. 'Tomorrow (today) the showers will start again during the afternoon period, for the morning should be good. This will not be in any in particular area, so scattered conditions across Trinidad and Tobago. 'For Sunday, showers are expected throughout the day. There will be sunshine during the day so it won't be totally a rainy day, some periods can be heavy. 'Monday, things will get clearer, sunny. On Tuesday... looks like more showers but not the entire day, we will have sunshine in between.' TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/marlene-grilled-for-eight-hours/article_f805a324-bb0c-11e9-8663-5fcd22e380e6.html\", \"TITLE\": \" ...Marlene grilled for eight hours \", \"DATE\": \"7 hrs ago \", \"CONTENT\": \"VISITORS: Arima Mayor Lisa Morris-Julian and Laventille East/Morvant MP Adrian Leonce on Thursday night at the St Joseph Police Station, where they visited Minister of Public Administration Marlene McDonald, who was being held for questioning. \\u2014Photo: JERMAINE CRUICKSHANK {{description}} Email notifications are only sent once a day, and only if there are new matching items. VISITORS: Arima Mayor Lisa Morris-Julian and Laventille East/Morvant MP Adrian Leonce on Thursday night at the St Joseph Police Station, where they visited Minister of Public Administration Marlene McDonald, who was being held for questioning. \\u2014Photo: JERMAINE CRUICKSHANK MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. McDonald and her husband were brought to the Professional Standards Bureau office at Henry Street, Port of Spain, at about 8 a.m. yesterday. Shortly after, Pamela Elder SC and attorney Owen Hinds Jr arrived at the PSB office and went inside. Elder, who is representing McDonald and her husband Michael Carew, remained inside the building until about 2.15 p.m. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. TWO videos which show minors engaged in sexual acts with adults are now engaging the attention of police. This was confirmed by Children\\u2019s Authority chairman Hanif Benjamin yesterday. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. A PIPE FITTER who told the court he found and kept five protected turtles, has been arrested\\u2026 Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/relief-as-rain-pours-down/article_cdb48fde-6c0c-5fe1-a4e8-5684950a827c.html\", \"TITLE\": \" Relief as rain pours down \", \"DATE\": \"Apr 21, 2016 \", \"CONTENT\": \"Trinidad and Tobago got a reprieve from the hot, dry conditions yesterday, when a weather system swept in from South America and drenched the islands. The deluge began before daybreak and lasted until noon. The previous day, the Trinidad and Tobago Meteorological Service had warned citizens to take precautions due to extremely high temperatures, which were forecast into the weekend. The islands have been under a prolonged dry spell, with the Water and Sewerage Authority imposing water use restrictions and farmers complaining of withered crops and low yields. Showers were reported across Trinidad and in San Fernando there were thunder-showers and street flooding. The temperature at around 10 a.m. yesterday was at 28 degrees Celsius in Trinidad and 25 degrees Celsius in Tobago. The day before, temperatures reached as high as 38 degrees in some urban areas. Chief medical officer Dr Akenath Misir had advised the public to heed the warning by the Met Office since an increases in temperature increases health risks. Acting Deputy Chief Fire Officer Kenny Gopaul advised citizens not to light outdoor fires as during the dry season it was extremely easy for a fire to spread. Yesterday, meteorologist Albert Alexander told the Express: \\u201cWe have been monitoring a low level thrust that has been approaching the continent, meaning South America, and moving up the coast over the last couple of days. However, the extent of the weather was not assessed enough when the 'hot spell' bulletin went out.\\u201d \\u201cSubsequent to the bulletin going out, we realised the intensity of the thrust and it did produce a lot of showers and thunder-showers over Trinidad and Tobago overnight into today,\\u201d he said. The meteorologist added that the \\u201chot spell\\u201d warning should not be completely disregarded. \\u201cAlthough today (Friday) with the moisture extending deep into the atmosphere, what that would do is cool the atmosphere so we would have like a temporary reprieve. \\u201cWhen the dry, hot spell comes again, it would take a while to build up to this warmth that we have been experiencing over the last couple days. But, it should get back dry and warm, but not as warm as we had over the last couple days. \\u201cWith the increase of frequency of showers, that should keep the temperature moderate as we move into the rainy season,\\u201d said Alexander. Expect more showers \\u201cThe conditions we expect to improve by evening going into afternoon and by tonight into tomorrow (today) we should get back to fair conditions. Now we should note that we are transitioning into the rainy season so we still expect dry, hot, sunny days. \\u201cHowever, the frequency of precipitation should increase so we should not be seeing weeks or like a whole week passing without a day or two with showers until we approach the rainy season, which begins June 1,\\u201d said Alexander. \\u201cWe need the rain, so no matter what we have to rejoice.\\u201d Grateful for the rain Sangre Grande Regional Corporation chairman Martin Rondon said: \\u201cThank God we get some rain here...these farmers get their land wet.\\u201d He said he contracted a truck to deliver water to farmers and is asking that the farmers have barrels placed closer to the roadside for the trucks. \\u201cI realised that they have families too to take care of and we need to help them,\\u201c Rondon said. He said the corporation could have done little to help the farmers who relied on water from the Matura River since residents received first preference in its water distribution. And Angie Samaroo, a farmer in Gasparillo, said she was very pleased about the rainfall. \\u201cThe rain now start but I feel very excited. We don't know how long it will continue for. Usually we would have to pull water from a ravine to our pond and water the plants from that. \\u201cWhen you are doing that, you don't have time for anything else. So with the rain coming, that will ease up that task,\\u201d she said. \\u2014with reporting by Sandhya Santoo TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/met-office-walk-with-your-umbrellas-today/article_b8215add-ce8c-5b00-8cc5-920855b13e49.html\", \"TITLE\": \" Met Office: Walk with your umbrellas today \", \"DATE\": \"Sep 19, 2015 \", \"CONTENT\": \"{{description}} Email notifications are only sent once a day, and only if there are new matching items. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/woman-and-lover-beaten-by-husband/article_95c84b6a-bab9-11e9-bf59-e3ee9ed2ca65.html\", \"TITLE\": \" Woman and lover beaten by husband \", \"DATE\": \"2 hrs ago \", \"CONTENT\": \"{{description}} Email notifications are only sent once a day, and only if there are new matching items. A woman and her lesbian lover were allegedly beaten by the woman\\u2019s husband after she confessed to an extramarital affair last Saturday. The suspect, a 48 year old fisherman, flew into a rage after the confession and allegedly beat his wife at their home in Charlieville. Police said when the wife called her lover and told her of the attack, the lover went to the house and was allegedly battered by the suspect and his 19 year old son. The suspect and his son allegedly ganged up and beat the lover with their fists and a cutlass, police said. The two women \\u2013the 43 year old Charlieville wife and her 47 year old lesbian lover - went to the Chaguanas police station that night and reported the incident to police. Officers took both women to the Chaguanas District Health Facility and they were transferred to the Eric Williams Medical Sciences Complex. The suspect\\u2019s wife was treated for minor injuries and discharged. Police said that the lover was severely beaten on the head and face, and was warded at hospital. She is being treated at hospital for a fractured jaw, perforated eye ball, sliced tongue and dislodged teeth, police said. Police said the husband also went to the Chaguanas District Health Facility on the night of the incident. He allegedly told officers that his wife\\u2019s lover chopped him with a cutlass on the arm and finger. He received three stitches to the finger and five stitches to the arm. Officers took the husband into custody after he was treated and discharged. The 19 year old son left the home after the incident. Police officers are looking for him. Police said the husband faces charges of assault occasioning bodily harm and assault by beating. Police said the lesbian lover could also be charged with assault occasioning bodily harm. PC Backan of Chaguanas CID is investigating. A PIPE FITTER who told the court he found and kept five protected tortoises, has been arrest\\u2026 Public Administration Minister Marlene McDonald and her husband Michael Carew are still bein\\u2026 Police need help in locating 16-year-old Shakira Moore. A woman and her lesbian lover were allegedly beaten by the woman\\u2019s husband after she confess\\u2026 FOURTEEN-year-old Nicholai Hodge died as a result of two stab wounds to the chest, an autops\\u2026 PRIME Minister Dr Keith Rowley, who spoke yesterdat to CNC3 News following the detention of \\u2026 Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/it-s-part-of-a-diabolical-plan/article_a8d6c10c-bb0c-11e9-b669-5bce36994535.html\", \"TITLE\": \" It\\u2019s part of a diabolical plan \", \"DATE\": \"4 hrs ago \", \"CONTENT\": \"\\u2018PM get like a mouse\\u2019: Dr Roodal Moonilal {{description}} Email notifications are only sent once a day, and only if there are new matching items. \\u2018PM get like a mouse\\u2019: Dr Roodal Moonilal Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. There may be a more diabolical plan afoot, of which today is one small piece, and they may be up to no good and up to a \\u00addiabolical plan that may or may not involve us,\\u201d said Moonilal. He was speaking at the United \\u00adNational Congress (UNC) \\u201cpavement meeting\\u201d in the Barataria/San Juan constituency on Thursday\\u2014\\u00adthe same day McDonald and her husband were detained by police for questioning on corruption-related matters. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. TWO videos which show minors engaged in sexual acts with adults are now engaging the attention of police. This was confirmed by Children\\u2019s Authority chairman Hanif Benjamin yesterday. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. A PIPE FITTER who told the court he found and kept five protected turtles, has been arrested\\u2026 Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/more-windies-mysteries/article_5fa7ed0d-962e-5696-a72c-73e1a1d69fa0.html\", \"TITLE\": \" More Windies mysteries \", \"DATE\": \"May 21, 2009 \", \"CONTENT\": \"WHEN the West Indies were last in England in 2007, they enjoyed the consolation of a 2-1 triumph in the three ODIs that followed their 3-0 defeat in the four Tests. Three years before that, the effect of England's 4-0 clean sweep of the Tests was assuaged by an unlikely and wildly celebrated victory over England in the ICC Champions Trophy at the end of the season. The West Indies now find themselves in a similar position for another bilateral ODI series, seeking compensation for a similar thrashing in the Tests, only two on this occasion, but both lost by embarrassing margins. The second ICC World Twenty20 Championship follows immediately, offering further opportunity to at least take something from a tour for which the players, more especially captain Chris Gayle, were obviously not mentally prepared. After the euphoria of the hard-fought victory in the preceding contest in the Caribbean that reclaimed the Wisden Trophy after nine years in England's hands, the outcome of the belatedly-arranged, if lucrative, mini-series here haS undermined growing confidence. Success now, even at a different level, will be a pick-me-up. The frigid, damp English weather that has darkened the West Indies' mood even further throughout the tour followed them from miserable Chester-le-Street to Leeds, denying them even a chance of kick-starting a revival in the first ODI at Headingley yesterday. Not a ball was bowled after the kind of downpours overnight and in the morning well known to Trinidadians in rainy season. They left the outfield, recently relaid for just such an eventuality at a cost of 600,000 pounds six months ago, so sodden the match was abandoned after a 3 p.m. inspection by the umpires, even after the sky had cleared and bright sunshine bathed the ground. It was a disappointment to the players, as much as the few thousand who had braved the elements in the hope of at least some cricket. There were enthusiastic West Indians even keener than others to get going. Ravi Rampaul, Kieron Pollard and Dwayne Bravo arrived on Monday specially for the ODIs and the 20/20s. Darren Sammy had waited in the wings through the Tests, knowing his role is as short-game specialist. Bravo is back following the operation on his increasingly painful left ankle eight months ago. His all-round ability and his uninhibited fervour make him as essential to the team, whatever the format, even as Gayle, Shivnarine Chanderpaul, Fidel Edwards and Ramnaresh Sarwan. He has been sorely missed in nine Tests, 11 ODIs and a couple of 20/20s. Why he was not in England for the two Tests but could be simultaneously doing his thing for the Mumbai Indians in the Indian Premier League (IPL) in South Africa remains the kind of mystery now commonplace in West Indies cricket. Why Runako Morton is here is another. His long record of indiscipline stretches back to his expulsion from the now defunct academy eight years ago through myths about deceased grandmothers to his most recent episode of violence that led to his suspension by the Leewards for fighting with a teammate last season. His days as an international cricketer were at an end in any case. To recall him now, as a late replacement for the injured Dale Richards, perpetuates the modern impression in West Indies cricket that discipline doesn't matter. The remaining two ODIs are scheduled for Bristol on Sunday and Edgbaston on Monday in what forecasters promise will be sunny, warmer weather. That, and a couple of corresponding victories, would cheer everyone up. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/government-cops-respond-to-marlene-mcdonald-s-arrest/article_b8221798-b9e4-11e9-8bc6-afafcc864fa6.html\", \"TITLE\": \" Government, cops respond to Marlene McDonald's arrest \", \"DATE\": \"21 hrs ago \", \"CONTENT\": \"Port of Spain South MP Marlene McDonald FLASHBACK: Newly appointed Minister of Public Utilities Marlene McDonald is congratulated by, from left, close friend Michael Carew, Jean Elder, chairman of the Port of Spain South Constituency, Port of Spain \\u201ccommunity leader\\u201d Cedric (Burkie) Burke, Kenroy Dopwell and Sharon Felix at President's House, St Ann's, after she was sworn in. \\u2013Photo: CURTIS CHASE Minister of Public Administration, Marlene McDonald MP Marelene McDonald's constituency office. {{description}} Email notifications are only sent once a day, and only if there are new matching items. Port of Spain South MP Marlene McDonald Government this afternoon acknowledged for the first time the police investigation involving Public Administration Minister Marlene McDonald. In a brief statement issued at 2:39p.m. newly appointed Communications Minister Donna Cox said: \\\"The Government of the Republic of Trinidad and Tobago (GoRTT) wishes to confirm that a search warrant was executed at the home of Minister of Public Administration the Honourable Marlene McDonald this morning (8 August 2019). However, this is an ongoing police investigation and further information will be provided as it is made available by the Trinidad and Tobago Police Service.\\\" Shortly after the Government's statement, the TTPS issued an statement of its own. The TTPS stated: \\\"Police officers investigating alleged corruption offences have arrested and taken into custody, Government Minister Marlene McDonald and her husband for questioning. They were detained earlier today, Thursday 8th August 2019. Enquiries are ongoing at this time and more information will be provided when it becomes available.\\\" At around dawn today, McDonald and her husband were detained. McDonald, the Member of Parliament for Port of Spain South was taken into police custody. The arrests were made at the couple's home at around 4a.m. by police executing a search warrant. The detention came after police went to the Director of Public Prosecutions Roger Gaspard with an investigation file on Tuesday. McDonald, a Cabinet minister, is being investigated on the allegation of misappropriation of public funds. MP Marelene McDonald's constituency office. The Express was told that McDonald, complained of feeling unwell and was treated at hospital. On June 1, 2017, Prime Minister Dr Keith Rowley advised then President Anthony Carmona to revoke the appointment of McDonald who was then Minister in the Ministry of Public Utilities. Minister of Public Administration, Marlene McDonald McDonald had only recently been sworn in as Minister in the Ministry of Public Utilities after a sixteen month period of absence from the Cabinet. Why was MacDonald fired then? McDonald met with Prime Minister Dr Keith Rowley the morning of her firing, as a result of the controversy caused by her choice of guests attending her swearing-in ceremony at the President's House in St Ann's days before. The commotion surrounds the presence of reputed \\\"community leader\\\" Cedric \\\"Burkie\\\" Burke, who accompanied contractor Kenroy Dopwell to the event. Senior elements of the national security community had expressed alarm at the presence of Burke, who has been engaging their attention. FLASHBACK: Newly appointed Minister of Public Utilities Marlene McDonald is congratulated by, from left, close friend Michael Carew, Jean Elder, chairman of the Port of Spain South Constituency, Port of Spain \\u201ccommunity leader\\u201d Cedric (Burkie) Burke, Kenroy Dopwell and Sharon Felix at President's House, St Ann's, after she was sworn in. \\u2013Photo: CURTIS CHASE Not only was he present, but Burke was introduced by her to the President and posed for pictures with Carmona Carmona. On August 2, Rowley reappointed McDonald, to the post of Minister of Public Administration. Burke was detained on Monday by police who seized his electronic devices including cell phones and laptops. He was questioned and released on Wednesday morning. Reporting by Alexander Bruzual Police need help in locating 16-year-old Shakira Moore. A woman and her lesbian lover were allegedly beaten by the woman\\u2019s husband after she confess\\u2026 FOURTEEN-year-old Nicholai Hodge died as a result of two stab wounds to the chest, an autops\\u2026 PRIME Minister Dr Keith Rowley, who spoke yesterdat to CNC3 News following the detention of \\u2026 Minister in the Ministry of Public Administration and Communications, Marlene Mc Donald spen\\u2026 Government Minister Marlene McDonald was dealt a third strike to her political career yesterday with her arrest by police on corruption allegations. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/rainy-season-has-started/article_af6832cb-8ee9-579e-b8dd-03d47a2d6416.html\", \"TITLE\": \" Rainy season has started \", \"DATE\": \"May 19, 2013 \", \"CONTENT\": \" WHETHER or not you're ready, the 2013 rainy season is here. Though two weeks early by calendar time, Trinidad and Tobago Meteorological Services at Piarco said yesterday the wet season is not unusually early, according to the approximated time of June to December. The rainy season was declared following the passage Sunday night of the first rain-producing tropical wave. \\\"In essence, expect to see more episodes of rain in the coming months than the daily bouts of sunshine we have been experiencing,\\\" the Met Office stated in a news release. \\\"Preliminary analysis indicates this year's rainy season should be very productive, more so than is usual.\\\" This has also led the Office of Disaster Preparedness and Management (ODPM) to issue a public caution to those living and working in flood-prone areas to be on the alert and to begin to prepare in earnest. The announcement of the wet season is also causing concern among those who experienced severe flooding last year, including residents of the Maraval area, who said they expect to be hit hard again. At the most, the weather may permit a few days of full sun this week before the rainy season is established, the Met Office said. With the quick succession of tropical waves typical of a productive rainy season still setting up its tempo, citizens can expect a brief reprieve over the next few days until the rain returns at the weekend. \\\"Sunny skies are expected back by tomorrow afternoon and at least until the following day,\\\" yesterday's duty forecaster at the Met Office told the Express. The Tropical Atlantic Hurricane Season is also expected to start on June 1. \\\"This year the season is forecast to be a very active one with the formation of 18 named storms, nine hurricanes and four major hurricanes (Categories 3 and above),\\\" the Met Office said. \\\"Historically, the averages for named storms, hurricanes and major hurricanes are 12, seven and two, respectively. Therefore, the overall picture weather-wise calls for a prepared public.\\\" Citizens have also been advised to make regular checks on the Met Office website, www.metoffice.gov.tt, and to pay attention to daily forecasts, which are released at 6 a.m., 10 a.m., 3 p.m. and 6 p.m., for early warnings on hurricanes and updates on existing systems. Tropical storm and hurricane watch/warnings will be issued whenever the effects of those systems are expected to be felt in Trinidad and Tobago in 36/48 hours, the Met Office advised. The ODPM has also placed all first-responder agencies\\u2014disaster management units of municipal corporations, Trinidad and Tobago Fire Service, T&T Defence Force, Ministry of Works and Infrastructure, Ministry of Transport and the Community Environmental Protection Enhancement Programme (CEPEP)\\u2014on alert. In Maraval, where clean-up operations after last year's flooding had actually seeped into this year, some residents said they are concerned over a hillside construction project currently underway. \\\"We would like to know whether this developer in the La Seiva area has permission to go that high up the mountain,\\\" one fearful resident said. \\\"From all appearances, we are afraid that we may be seeing a repeat of 2011, when boulders weighing hundreds of pounds came down from the hills. This in addition to the fact that there is at least one major drain that is still clogged with debris from last year.\\\" TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}"
]