[
    "{\"SOURCE\": \"https://www.trinidadexpress.com/opinion/columnists/us-china-conflict-touches-caribbean/article_0c174db2-e229-11e8-8c26-ab7fa212434f.html\", \"TITLE\": \" US-China conflict touches Caribbean \", \"DATE\": \"Nov 6, 2018 \", \"CONTENT\": \"The peaceful coexistence of the existing superpower, the United States and the recently risen superpower, the People\\u2019s Republic of China, has been disrupted by a tit-for-tat tariff war started by the US. The global rivalry for resources, markets and political influence has until recently not involved the Caribbean Basin. IN yet another incident which has had the effect of piling \\u00adembarrassment upon embarrassment for the authorities, a convict walked out of the Golden Grove facility in Arouca on Thursday, and was on the run up to last night. THE West Indies has had a phenomenal number of exceptional cricketers in its history. The captains have been mostly \\u00admiddling. I restricted the playbooks to those of Frank Worrell, Richie Benaud and Mike Brearley simply because they were known as thinking men; able in both the technical and \\u201cman-management\\u201d aspects of the game. International Youth Day is approaching. It is time for the youth of this country to stand up and make their voices heard. It is time to become more \\u00adinvolved in the political process to put an end to the corruption and mismanagement taking place far too often and for too long. Recently, the press \\u00adreported that a mother was in tears after her victim impact statement was read out in court during the trial of the accused for her son\\u2019s murder. She cried out for answers as to the reason the accused, having robbed her son of his \\u00adcellphone, had killed him. While the horizon must seem unrelievedly grim to many citizens, once in a while a few specks of bright light appear to \\u00adrelieve the gloom. And so it was \\u00adrecently when it was announced that the country\\u2019s first drug treatment court was to be established within three months. Regarding the arrest of Minister Marlene McDonald in the ongoing investigation of corruption charges levelled against her, Dr Rowley bought that wholesale. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/everywhere-is-war/article_f5921cc4-6c21-5cd3-be19-fbd550f3dfff.html\", \"TITLE\": \" Everywhere is war \", \"DATE\": \"Apr 8, 2011 \", \"CONTENT\": \"MY Trinidadian friend rang me and said, War going on. Normally this does not have anything to do with an openly declared state of organised violent conflict typified by extreme aggression, societal disruption and high mortality. Most of the time War is an abbreviation of the word what so when you hear a Trini say, War happening or War you think you doing or War kind of nonsense you talking you interpret the war as what and answer accordingly. Not much, I replied. American Airlines cancelled my flights last week and did not want to reimburse my hotel costs so they said that a fire in their fuel dump was an act of God but apart from that nothing of consequence. War about you Listen, he said. What I am trying to tell you is that war going on, real war. Of course, I responded cynically, I watch BBC too and apart from Iraq and Afghanistan, they have war in Libya and they have civil war in a bunch of other places. I am not talking about them, he expostulated. I interrupted him, You hear Jay Leno last week He said America is now fighting three wars and ask people to imagine how many it would be if Obama hadnt won the Nobel Peace Prize. Yeah, my friend said, and Jimmy Kimmel took on Sarah Palin. Kimmel said, Sarah Palin continues to make significant contributions to the English language. She asked, Is Libya a war, an intervention, a squirmish, what is it Squirmish is how I feel every time I hear Sarah Palin talk. I was feeling squirmish myself and asked, Well what war is this you talking about The one between Jamaica and Barbados, he replied, satisfied that he had now got my attention. You crazy, I retorted. There is no war like that. There is now, he said and proceeded to tell me what he knew of the story. It seems that a Jamaican woman travelling to Barbados on March 14, 2011, was subjected to a search by a female immigration officer, who (it was claimed) placed her finger in the private parts of the woman while ostensibly searching for drugs. The Jamaican woman, Shanique Myrie, who took her plight to the Jamaica Observer, alleges that she was subjected to two demeaning cavity searches by a female immigration officer who continuously spewed venom about Jamaicans. Although no contraband was found on Ms Myrie, she claims she was refused entry into Barbados and detained by officers before being sent back to Jamaica on the following day. Ms Myrie gave an extremely graphic account of her experience to the media: The lady took me into a bathroom and told me to take off my clothes. I did as requested. After searching me and my clothes she found no contraband or narcotics. She then asked me to bend over, open my legs and spread (my private parts). She said that if I did not comply then she would see that I end up in prison in Barbados. When I bent over and spread my (private parts) I felt something enter my (private parts) and when I looked between my legs I saw her gloved hand in my (private parts). I screamed and stood up. She then told me if I obstructed her doing a cavity search she would have me locked up. I bent over again and spread. She again inserted her fingers and poked around. I felt like I was being raped. I was so hurt and ashamed. I felt dirty and defiled. I asked her who she was and she said I am your worst nightmare. She then said All you (expletive) Jamaicans come here to do is either steal peoples man or bring drugs here, Ms. Myrie recounted. Ms Myrie also claimed that the immigration officer removed her identification tag before humiliating her and that she complied because she was alone with the woman and feared what she would do to her. The first thing that the Barbadians supposedly did after sending Ms Myrie back to Jamaica was insist that she was lying. At a press conference a few days later, Minister of Foreign Affairs and Foreign Trade, Senator Maxine McClean, told reporters: There is absolutely no truth to a story carried in a Jamaican newspaper on Thursday, March 24, that a female citizen of that country was body-searched by Immigration officers on arrival at the Grantley Adams International Airport. Despite this, the governments of both countries were holding high-level meetings to seek to resolve the issue peacefully. When I heard my friends summary, I was, of course, aghast, appalled and alarmed but not at the incident so much as the possibility that war would break out. The last war that started in the region was precipitated by an anatomical issue. In 1731, just off Havana, Captain Robert Jenkins supposedly insulted the Spanish captain, Juan de Leon Fandino. For this insult, Fandino used his sword to cut off one of Jenkins ears. In 1738, before a committee of the House of Commons, Jenkins reported the incident and exhibited his severed ear. In this report, he said that his ear was \\\"cut off in April 1731 in the West Indies by Spanish coast guards who had boarded his ship, pillaged it and then set it adrift.\\\" Thus began the War of Jenkins Ear. If a war starts between Barbados and Jamaica about Ms Myries experience, I wonder what they would call it. Tony Deyal was last seen saying that he passed through the Barbados Airport last week but sadly nobody fingered him for any offence. He did tell a Customs Officer, when asked, that he had no food with him because he did not want her pawing through his buns TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/no-peace-and-goodwill-here/article_79b7fad3-e6e1-549e-bbd8-4b0a3a5df083.html\", \"TITLE\": \" No peace and goodwill here \", \"DATE\": \"Dec 14, 2012 \", \"CONTENT\": \"\\u0091Test project\\u0092: St Joseph MP Terrence Deyalsingh, right, speaks to a group of youths during the launch of the St Joseph Youth Capital Development Forum at the Mt Hope/ Mt Lambert basketball court, Eastern Main Road, last Thursday. \\u0097Photo: CURTIS CHASE \\u0091Test project\\u0092: St Joseph MP Terrence Deyalsingh, right, speaks to a group of youths during the launch of the St Joseph Youth Capital Development Forum at the Mt Hope/ Mt Lambert basketball court, Eastern Main Road, last Thursday. \\u0097Photo: CURTIS CHASE THERE was a time, maybe I should write \\\"once upon a time\\\" since this may sound so much like a fairy-tale, when nations at war suspended hostilities on Christmas Day, such was the pervasiveness of peace and goodwill associated with the birth of the Christ child. The most memorable such occasion was on the night of Christmas Eve 1914, during the First World War, along the Western Front. German and British forces faced each other in the fields of Flanders, entrenched, quite literally, a few hundred metres apart. Up until that magical moment, for three months the enemies had savaged each other with machine guns, mortars, rifles, even bayonets. Thousands had died and many more wounded, some scarred or disabled for life. Mortal enemies they were, without doubt. Yet, in that still of that cold night, German soldiers, moved by some unseen spirit, shouted from their trenches to their British foes, \\\"Merry Christmas!\\\" With commanders on both sides in shock, not to add suspicious, the Germans then belted out \\\"Silent Night\\\". British soldiers responded with a lusty \\\"First Noel\\\". Before either side understood what was happening, soldiers laid down their weapons, jumped out of their trenches and rushed to embrace each other. They exchanged greetings, shared food and drinks and even posed for pictures. Not a shot was fired that night in that sector of the Front. I recall this story that I first heard during a military history lecture at Sandhurst as I note with sadness the bitter political warfare raging in Trinidad and Tobago, non-stop, without regard for season or reason. I should add that in many other armed conflicts across the world, even the interminable Arab-Israeli war, Christmas and other sacred days have seen short truces observed by the combatants. Even Zionists and Jihadists take time out from the savagery of war. Which leaves me wondering what political war is being waged in this country, so bitter that warrants a savagery of words spewed from platforms and online continuously In all my years, I do not recall another period during which one party or other, and certainly not the ruling party, found it necessary to fulminate against enemies, more imagined than real, every day. The UNC fundamentalists in the People's Partnership Government seem not to understand that the coalition won elections more than thirty months ago, and that the people expect them to govern the country, not cuss and carry on with rum shop-like behaviour. You would think that having captured government, the coalition would seek to strengthen its internal bonds and broaden its external appeal. In other words, it would consolidate its grip on power and reach out to win the hearts, minds and votes of those who may not have supported it in the last elections. After war, sometimes during war (as I noted earlier), comes peace. That has not happened with this lot, and here I underscore that I refer to the dominant and vociferous UNC elements, not the COP members. For them, there can be no peace on earth, far less goodwill to man. It's war-never-ending conflict in which you must have identifiable enemies even if you have to manufacture them. A few weeks ago, when I referred to the rabble-rousing nature of the UNC's Monday night forums and likened them to the modus operandi of the Nazi party in Germany in the early 1930s, many readers felt I was unduly harsh. I insist I was not. Adollf Hitler and his aides always needed enemies for their zealots to savage: the Jews, the communists, trade unionists, the Social Democrats, and eventually, when they started running out of foes, they turned on their own. Look at the trend here. First, they targeted the PNM, specifically Keith Rowley. When he took leadership of a battered PNM, Rowley and his party looked very unattractive. But because the UNC fingered him at every turn, blamed him for everything that went wrong under their watch, Rowley started to look good. Today he is a leader with some stature-thanks to the UNC. Next, they went after PNMites: everyone who stood in their way, who stood up for what they believed was right, was deemed \\\"ah PNM\\\". Many of those who were crushed in that frontal assault on perceived enemies had been People's Partnership's supporters until they were fired from positions they held based on service or merit, or had some contractual or other arrangements unjustly terminated. The tears of many families who are victims of this ongoing witch-hunt are falling on the UNC. Trade unionists who, before 2010, stood up staunchly against the excesses of Patrick Manning, and who were embraced by the People's Partnership in the euphoria of elections, found themselves branded \\\"enemies\\\" and \\\"PNM\\\" the moment they disagreed with the People's Partnership in government. Friend Wayne Kublalsingh is now foe number one. As the fundamentalists run out of \\\"enemies\\\", they are turning inward, devouring their own. Why else would the Prime Minister say publicly that some of her ministers wanted her to capitulate in the Kublalsingh affair I thought what transpired at Cabinet level, especially differences of opinion, stayed within its confines. Look, we all know (or ought to know) the biblical dictum about there being a time and season for everything, a time for war and a time for peace. In this season of peace, the fundamentalists, worse than the Jihadists, promote war, divisiveness, hatred. Only sick minds could continue with such boorish behaviour as the world around them smile, extend hands of friendship, pray for peace. Behind the war paint and blood-curdling cries of battle lies a cult under siege. Their cacophony signals the spasms of death, not the signs of life. Soon they will depart, taking their area of darkness with them. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/kofi-annan-s-interventions/article_867ea7c0-e368-5bd5-be71-bda91b0b98af.html\", \"TITLE\": \" Kofi Annan's 'interventions' \", \"DATE\": \"Jan 7, 2013 \", \"CONTENT\": \" IN a must-read book that belongs in every serious library, Kofi Annan eloquently articulates the strengths and weaknesses of the United Nations, painfully reminds us of the threats to humanity across continents and points to the double-speak and contradictions of some of the world's most powerful nations. The internationally hailed diplomat, who served two terms (January 1997 to December 2006) as Secretary General of the UN, shares in Interventions(A Life in War and Peace)very revealing, at times even personally hurtful moments, in his distinguished career to avoid conflicts and promote peaceful, people-focused development. Former world leaders like America's George W Bush and Britain's Tony Blair may not be amused by some of the observations during anguished moments Annan shares, for instance, over the US-led military invasion of Iraq. However, all governments committed to peace; the reforming of global governance; restoring the rule of law; ending the recurring wars in Africa and conflicts in the Middle East; redefining \\\"human security\\\" and combating poverty would be interested in Kofi Annan's assessments of the world he served as UN Secretary General and his hopes, as \\\"a realist\\\", for the future. The first Secretary General to emerge from the ranks of world body's staff, the Ghana-born Annan leaves no doubts in his 381-page book, co-edited with Nader Mousavizadeh, one of his much- respected UN colleagues, of a deep commitment to people-centred development and without indulging in any self-promotion. He reminds us that throughout his time with the UNspanning some four decades, with the last nine as Secretary Generalhow he sought to match the \\\"unique authority of the United Nations as the sole, truly universal organisation of states with the credibility of seeing that rights were defended; suffering alleviated and lives saved\\\" Annan, who offers some very candid comments on the role of the US in world affairs and, more specifically, its initiatives and sustainability of military warfare, particularly in regions such as the Middle East, argues in his book: If the infamous 9/11 terror strikes against the US \\\"changed the world, the consequences of the Iraq War (led by the US) were of a similarly dramatic magnitude \\\"From the Arab nations, appalled by the mayhem unleashed following the fall of Saddam,\\\" he stressed, \\\"to the deep distrust among (UN) Security Council members bruised by the tortuous negotiations in the run-up to the war to the growing isolation of a United States no longer feared or respected. What the United States had lost, as a consequence of the invasion, was the benefit of the doubt.\\\" This development, he said, \\\"pained me deeply\\\", since \\\"throughout my years as Secretary General, I had often found myself in the role of global interpreter, explaining the United States to the world, and the world to the United States \\\"Despite the singular contribution of the United States to the UN's founding and its mission in the decades that followed,\\\" Annan sadly noted, \\\"after Iraq, America was too often unwilling to listen, and the world unable to speak its true mind\\\" As he now reflects, Annan thinks that a United Nations for the 21st century \\\"would have to create new partnerships; respond to the needs of individuals, and stand for the principle that national sovereignty could never (my emphasis) be used as a shield for genocide or gross violations of human rights. \\\"It would have to advance a much broader view of security that integrated peace, development, women's empowerment and human rights if it were to address successfully the challenges of a global age..\\\" The UN would simply have to make \\\"a difference\\\", emphasised the recipient of the 2001 Nobel Peace Prize, \\\"in four key challenges of the 21st centurypeace and security; growth with development; respect for human rights and the rule of law\\\". Not surprisingly, in a blurb on Annan's book, (a copy of which I was fortunate to receive as a Christmas gift from our eldest daughter, Wendy, herself a human rights worker), the former two-term president of the US, Bill Clinton, noted: \\\"In this thought-provoking memoir, Kofi Annan describes the peaceful and more equitable world that is within our grasp and offers his perspective on the challenges we must overcome to get thereInterventions is a powerful reminder that the United Nations still matters and must continue to matter if we want our new century to be more free, peaceful, and prosperous than the last.\\\" A Penguin Press publication, Interventions (A Life in War and Peace) was released in New York and London in the final quarter of 2012. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/women-key-to-peace-security/article_7dbe0345-3c73-54ba-87df-1a0f2934bc3e.html\", \"TITLE\": \" Women key to peace, security \", \"DATE\": \"Mar 6, 2014 \", \"CONTENT\": \"International Women's Day is more than a moment marked on a calendar. It is a day not just to renew our determination to make the world a more peaceful and prosperous place \\u2014 but to recognise that a world where opportunities for women grow, is a world where the possibilities for peace, prosperity, and stability grow even more. I see it every single day as secretary of state. Even as the Assad regime's barrel-bombing of Aleppo continues, showing the world a brutal regime's true colours, with every act of courage and perseverance, Syria's women show the world their true colours, as well. We heard from some of these remarkable women in Montreux just last month. Their stories spoke to the bravery of countless other Syrian women. One woman from Idlib worked with the Free Syrian Army to ensure that the people of her village could remain in their homes and till their own land. Another woman from Aleppo got restrictions on humanitarian access lifted by offering food to regime soldiers at the checkpoints. If that isn't courage under fire, I don't know what is. It's not just in Syria that women offer us hope for resolution to conflict. Women are vital to our shared goals of prosperity, stability and peace. That's as true when it comes to ending our battles as it is jumpstarting our economies. The fact is that women bear the greatest burden in war. But their voices are too rarely heard in negotiating peace. That has to change. Countries that value and empower women to participate fully in decision-making are more stable, prosperous, and secure. The opposite is also true. When women are excluded from negotiations, the peace that follows is more tenuous. Trust is eroded, and human rights and accountability are often ignored. In too many countries, treaties are designed by combatants for combatants. It should come as no surprise, then, that more than half of all peace agreements fail within the first ten years of signature. The inclusion of women in peace building and conflict prevention can reverse that trend. So how do we get there Evidence from around the world has shown that deadly conflicts are more likely to be prevented, and peace best forged and protected, when women are included as equal partners. That's why we are working to support women in conflict and post-conflict areas around the world. In Afghanistan, we are advocating for the inclusion and election of women at all levels of governance. Afghan women today are marching forward in ways unimaginable just ten years ago. They're starting companies. They're serving as members of parliament. They're teaching in schools and working as doctors and nurses. They are the foundation upon which Afghanistan's future is being built. As the people of Burma work to resolve the conflict that has plagued their nation for decades, the United States is supporting the meaningful participation of women in the peace process and inter-communal peace initiatives. We know that the security of women is essential to their participation in peace building. That's why we are working to ensure women get equal access to humanitarian assistance and relief, wherever we work. The United States is also leading by example. My sister has worked for many years at the United Nations, following in the State Department footsteps of our father many years before I did myself. She's a trailblazer. But she's not alone. It's no coincidence that some of our top diplomats and peace negotiators are women \\u2014 from National Security Advisor Susan Rice, to US Ambassador to the United Nations Samantha Power, to Deputy Secretary of State Heather Higginbottom, to Undersecretary of State for Political Affairs Wendy Sherman. Today, all but one of the State Department's regional assistant secretaries are women. We celebrate their accomplishments not just because they are women, but because their work around the world will make all people \\u2014 men and women, boys and girls \\u2014 more secure. Peace is not the absence of conflict. It is the presence of every member of society working together to promote stability and prosperity. No country can succeed unless every citizen is empowered to contribute to its future. And no peace can endure if women are not afforded a central role. So today, we mark the miles women have travelled around the world \\u2014but more importantly we commit to the next miles of the journey. \\u2022 John Kerry is the United States Secretary of State TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/it-s-part-of-a-diabolical-plan/article_a8d6c10c-bb0c-11e9-b669-5bce36994535.html\", \"TITLE\": \" It\\u2019s part of a diabolical plan \", \"DATE\": \"4 hrs ago \", \"CONTENT\": \"\\u2018PM get like a mouse\\u2019: Dr Roodal Moonilal {{description}} Email notifications are only sent once a day, and only if there are new matching items. \\u2018PM get like a mouse\\u2019: Dr Roodal Moonilal Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. There may be a more diabolical plan afoot, of which today is one small piece, and they may be up to no good and up to a \\u00addiabolical plan that may or may not involve us,\\u201d said Moonilal. He was speaking at the United \\u00adNational Congress (UNC) \\u201cpavement meeting\\u201d in the Barataria/San Juan constituency on Thursday\\u2014\\u00adthe same day McDonald and her husband were detained by police for questioning on corruption-related matters. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. TWO videos which show minors engaged in sexual acts with adults are now engaging the attention of police. This was confirmed by Children\\u2019s Authority chairman Hanif Benjamin yesterday. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. A PIPE FITTER who told the court he found and kept five protected turtles, has been arrested\\u2026 Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/t-t-supports-peaceful-solution-to-korean-situation/article_eb294cf5-6106-591d-8d94-aae2b201a1eb.html\", \"TITLE\": \" T&T supports peaceful solution to Korean situation \", \"DATE\": \"Apr 17, 2013 \", \"CONTENT\": \" ACTING Prime Minister Winston Dookeran on Wednesday added his voice to the chorus of world leaders denouncing a possible nuclear attack arising out of the current tensions between North and South Korea. Dookeran, the Foreign Affairs Minister, expressed \\\"deep concern\\\" at the conflict currently taking place in the Korean peninsula as he delivered the keynote address at a function attended by the South Korea's permanent representative to the United Nations in New York, USA, Kim Sook. The event was the opening ceremony for the workshop on implementing United Nations Security Council Resolution 1540 (2004) which took place at the Ballroom of the Hilton Trinidad and Conference Centre in St Ann's on Wednesday. Kim Sook is the chairman of the United Nations Security Council 1540 committee. Dookeran said, \\\"I therefore join the international community in its call for restraint and resolve from all parties and take no action that can lead to the outbreak of nuclear war on the Korean peninsula and encourage all parties to show good faith by returning to the path of dialogue based on mutual respect. \\\"It is a small voice but it is a small voice with a large purpose. It is a small voice that joins with the international community in what we believe will be a retrograde process if we are to allow these threats to develop and become actual events,\\\" he said. Dookeran said this country supported all efforts to bring a \\\"peaceful solution\\\" to the Korean situation. Speaking to members of the media following the ceremony, Kim Sook said the entire international community was trying to diffuse the conflict but North Korea's supreme leader, Kim Jong-un, had proven to be \\\"young, inexperienced and very unpredictable\\\". Kim Jong-un was officially declared supreme leader on December 28, 2011 following the State funeral of his father Kim Jong-il. \\\"North Korea using the technology that was prohibited by the international obligations and the resolution of the security council they still have some possibility that they will go ahead with the launch of the mid-range or long-range missiles. It has not happened yet but we still are trying to persuade North Korea not to launch this missile which is a clear defiance to the international obligations,\\\" Kim Sook said. \\\"Regarding the tension the international community as a whole is trying to diffuse it with one voice but North Korean leader who is young and known to be inexperienced is known to be very unpredictable. We only wish that North Korean leader should abide by the international laws and obligations including that of the security council,\\\" Kim Sook said. Delivering a statement at yesterday's ceremony O'Neil Hamilton, the regional coordinator for the implementation of the security council's resolution 1540 in the Caribbean Community, said during the first year after the September 11, 2001 terrorists attacks in New York, the region lost US$900 million in revenue. \\\"The economic impact on the region and the reverberation felt in the regional markets resulted in the loss of $900 million in revenue, thousands of jobs particularly in tourism and hospitality sectors within the first year after the (September 11, 2001) attacks,\\\" Hamilton said. Kim Sook said terrorists were no respecters of boundaries and the international stance against nuclear proliferation was \\\"only as strong as the weakest link\\\". \\\"As terrorists and proliferators do not respect borders, the global nuclear proliferation system is only as strong as the weakest link in the chain. It would use such weak links as their outposts and even as their launch pads,\\\" he said. Dookeran pledged this country's commitment to national security. \\\"National security is our major priority. Many steps have been taken and will continue to be taken in order to deal with the issues of national security,\\\" Dookeran said. He said this country has placed great emphasis in adhering to cooperation with all international agencies. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/opinion/letters/a-nation-at-war-with-itself/article_e47a037e-25b9-11e9-838e-7b2ea31d1a49.html\", \"TITLE\": \" A nation at war with itself \", \"DATE\": \"Jan 31, 2019 \", \"CONTENT\": \"For a small nation with a small population we are infested with turmoil and constant daily conflict. Just have a look at the reports that appear in our newspapers and this is only the thin edge of the wedge of our woes that have been reported. The question is, why are we as a \\u201cpeaceful\\u201d nation, at war with ourselves. There is constant infighting, be it on racial issues or personal confrontations. It would appear that there is really no relief from this pattern of behaviour. This scenario has been nurtured and developed during the years of our independence, and like corruption has been allowed to become part and parcel of our culture. IN yet another incident which has had the effect of piling \\u00adembarrassment upon embarrassment for the authorities, a convict walked out of the Golden Grove facility in Arouca on Thursday, and was on the run up to last night. THE West Indies has had a phenomenal number of exceptional cricketers in its history. The captains have been mostly \\u00admiddling. I restricted the playbooks to those of Frank Worrell, Richie Benaud and Mike Brearley simply because they were known as thinking men; able in both the technical and \\u201cman-management\\u201d aspects of the game. International Youth Day is approaching. It is time for the youth of this country to stand up and make their voices heard. It is time to become more \\u00adinvolved in the political process to put an end to the corruption and mismanagement taking place far too often and for too long. Recently, the press \\u00adreported that a mother was in tears after her victim impact statement was read out in court during the trial of the accused for her son\\u2019s murder. She cried out for answers as to the reason the accused, having robbed her son of his \\u00adcellphone, had killed him. While the horizon must seem unrelievedly grim to many citizens, once in a while a few specks of bright light appear to \\u00adrelieve the gloom. And so it was \\u00adrecently when it was announced that the country\\u2019s first drug treatment court was to be established within three months. Regarding the arrest of Minister Marlene McDonald in the ongoing investigation of corruption charges levelled against her, Dr Rowley bought that wholesale. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/marlene-grilled-for-eight-hours/article_f805a324-bb0c-11e9-8663-5fcd22e380e6.html\", \"TITLE\": \" ...Marlene grilled for eight hours \", \"DATE\": \"7 hrs ago \", \"CONTENT\": \"VISITORS: Arima Mayor Lisa Morris-Julian and Laventille East/Morvant MP Adrian Leonce on Thursday night at the St Joseph Police Station, where they visited Minister of Public Administration Marlene McDonald, who was being held for questioning. \\u2014Photo: JERMAINE CRUICKSHANK {{description}} Email notifications are only sent once a day, and only if there are new matching items. VISITORS: Arima Mayor Lisa Morris-Julian and Laventille East/Morvant MP Adrian Leonce on Thursday night at the St Joseph Police Station, where they visited Minister of Public Administration Marlene McDonald, who was being held for questioning. \\u2014Photo: JERMAINE CRUICKSHANK MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. McDonald and her husband were brought to the Professional Standards Bureau office at Henry Street, Port of Spain, at about 8 a.m. yesterday. Shortly after, Pamela Elder SC and attorney Owen Hinds Jr arrived at the PSB office and went inside. Elder, who is representing McDonald and her husband Michael Carew, remained inside the building until about 2.15 p.m. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. TWO videos which show minors engaged in sexual acts with adults are now engaging the attention of police. This was confirmed by Children\\u2019s Authority chairman Hanif Benjamin yesterday. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. A PIPE FITTER who told the court he found and kept five protected turtles, has been arrested\\u2026 Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/woman-and-lover-beaten-by-husband/article_95c84b6a-bab9-11e9-bf59-e3ee9ed2ca65.html\", \"TITLE\": \" Woman and lover beaten by husband \", \"DATE\": \"2 hrs ago \", \"CONTENT\": \"{{description}} Email notifications are only sent once a day, and only if there are new matching items. A woman and her lesbian lover were allegedly beaten by the woman\\u2019s husband after she confessed to an extramarital affair last Saturday. The suspect, a 48 year old fisherman, flew into a rage after the confession and allegedly beat his wife at their home in Charlieville. Police said when the wife called her lover and told her of the attack, the lover went to the house and was allegedly battered by the suspect and his 19 year old son. The suspect and his son allegedly ganged up and beat the lover with their fists and a cutlass, police said. The two women \\u2013the 43 year old Charlieville wife and her 47 year old lesbian lover - went to the Chaguanas police station that night and reported the incident to police. Officers took both women to the Chaguanas District Health Facility and they were transferred to the Eric Williams Medical Sciences Complex. The suspect\\u2019s wife was treated for minor injuries and discharged. Police said that the lover was severely beaten on the head and face, and was warded at hospital. She is being treated at hospital for a fractured jaw, perforated eye ball, sliced tongue and dislodged teeth, police said. Police said the husband also went to the Chaguanas District Health Facility on the night of the incident. He allegedly told officers that his wife\\u2019s lover chopped him with a cutlass on the arm and finger. He received three stitches to the finger and five stitches to the arm. Officers took the husband into custody after he was treated and discharged. The 19 year old son left the home after the incident. Police officers are looking for him. Police said the husband faces charges of assault occasioning bodily harm and assault by beating. Police said the lesbian lover could also be charged with assault occasioning bodily harm. PC Backan of Chaguanas CID is investigating. A PIPE FITTER who told the court he found and kept five protected tortoises, has been arrest\\u2026 Public Administration Minister Marlene McDonald and her husband Michael Carew are still bein\\u2026 Police need help in locating 16-year-old Shakira Moore. A woman and her lesbian lover were allegedly beaten by the woman\\u2019s husband after she confess\\u2026 FOURTEEN-year-old Nicholai Hodge died as a result of two stab wounds to the chest, an autops\\u2026 PRIME Minister Dr Keith Rowley, who spoke yesterdat to CNC3 News following the detention of \\u2026 Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/opinion/letters/ease-this-tension-between-sea-lots-and-orange-valley/article_1824160a-b4c2-11e9-9540-0f6798963fae.html\", \"TITLE\": \" Ease this tension between Sea Lots and Orange Valley \", \"DATE\": \"Aug 1, 2019 \", \"CONTENT\": \"This issue between Sea Lots and Orange Valley can escalate into serious conflict with intense racial overtones. We do not want this in Trinidad and Tobago. We have prided ourselves on our racial harmony and if this \\u201ctribal war\\u201d is allowed to continue it would have alarming consequences and do irreparable damage to our social fabric. It is time for mediation. The Ministry of National Security needs to immediately call in leaders and elders from both communities to a peace conclave to ventilate the issue and thrash out a lasting resolution. These are challenging and troubling times for members of the Trinidad and Tobago Police Serv\\u2026 For more than a generation now, Jamaica has endured a period of low economic growth and a ve\\u2026 \\u201cIt is no secret that I have not been your favourite person or the person you would prefer t\\u2026 I belong to a wonderful book club, and while we usually choose a novel, at our last meeting \\u2026 The latest wave of disconnections launched by the Water and Sewerage Authority (WASA) for no\\u2026 The attorney \\u00adgeneral has been on the \\u00adhustings, making much of what he perceives as the int\\u2026 Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/pm-no-one-is-above-the-law/article_7b548146-bb0d-11e9-bd37-6b3070eef214.html\", \"TITLE\": \" PM: No one is above the law \", \"DATE\": \"10 hrs ago \", \"CONTENT\": \"AWAITING OUTCOME: Keith Rowley {{description}} Email notifications are only sent once a day, and only if there are new matching items. AWAITING OUTCOME: Keith Rowley THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. The Prime Minister admitted he was saddened by what had happened to McDonald, but reiterated that no one was above the law. And Government Minister Fitzgerald Hinds said he and other colleagues were surprised when they heard the news of McDonald\\u2019s arrest on Thursday. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. TWO videos which show minors engaged in sexual acts with adults are now engaging the attention of police. This was confirmed by Children\\u2019s Authority chairman Hanif Benjamin yesterday. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. A PIPE FITTER who told the court he found and kept five protected turtles, has been arrested\\u2026 Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/peace-pax-la-paix-la-paz/article_19310dba-56cb-5aa6-9717-89f731df7e8b.html\", \"TITLE\": \" Peace, pax, la paix, la paz \", \"DATE\": \"Oct 2, 2013 \", \"CONTENT\": \"On September 21, the United Nations celebrated the International Day of Peace. UN Secretary General Ban Ki-moon sent a message to mark the occasion. Appropriately juxtaposed in the newspapers next to that of the Secretary General's was the message of our Community Development Minister, Winston Peters. The theme of this year's message is Education for Peace. Ban's message targeted the international community, reiterated its belief in non-violence, and called for a global ceasefire. As expected, the minister's message focused on the national community and the government's programme to curtail violence. Though the UN chief and the minister are working under different rubrics\\u2014international and domestic affairs\\u2014their goals are similar: world peace. Nations at peace are less likely to cause turbulence in the international environment. The line between domestic and international affairs is so thin that it is virtually nonexistent. This wafer-thin line between national and international affairs is exhibited in Christian and non-Christian houses of worship. During the service there is usually a call for prayers for our leaders and also a call for peace in hotspots. Today those spots are in Afghanistan, Egypt, Iraq, Pakistan and Syria. Everyone wants peace because the consequences of war are deleterious. Not only do young soldiers pay with their lives on the front lines, but the nature of war is such that civilians are in jeopardy. They are among the casualties stemming from the scourge of war\\u2014disease, starvation, massacres, bombings, terrorism, and genocide. Our young scholar, Ravindra Ramrattan, was a victim to the long tentacles of war. Wars and violence are financial burden to nations: homes, hospitals, universities, and other infrastructure are destroyed, while refugees abound. The social and political outcome is enormous as civil liberties are eroded, and the growth of corporate power and profiteering increase. Despite the horrible aftermath, wars and violence continue unabated. There were 15 million to 65 million casualties in World War I. In World War II, casualties numbered between 40 million and 72 million; in the Vietnam war, the casualties were 800,000 to three million; and in the Korean War, 400,000 to four and a half million. The death toll continues to mount in conflicts throughout the world. The UN divides them into two categories\\u2014those numbering above 1,000 deaths a year, and those below 1,000. Organisations have been created to assist nations from going into combat and to resolve their conflicts through diplomacy. The latest, the United Nations, was born in 1945 \\\"to save succeeding generations from the scourge of war\\\". However, wars have been waged during its existence. The protracted nature of the Vietnam, Korean and the Iran-Iraq wars are evidence. But the United Nations' 193 members do not always see eye to eye on their national interests and that organisation's structure may have outlived the immediate post-World War II era. However, the United Nations cannot be saddled with the blame. In fact, if there were no United Nations, it would have to be created. The current president of the General Assembly, who happens to be from Antigua and Barbuda, has just laid out the daunting agenda that confronts the world body: reports of wars, grinding poverty and malnutrition, gender violence, the adverse effects of climate change and loss of valuable biodiversity. Incidentally, much of the violence stems from ethnic and religious conflicts. Like international organisations, religious leaders lend their weight and influence against the use of force and violence. Just like well-meaning international bodies armed with their diplomatic skills, prayers seem to be ineffectual. Ironically, many wars, for example, the Crusades and the Thirty Years War, have had their genesis in religious conflict. Unfortunately, religious extremists are at the centre of many conflicts today. The theme for this year's International Day of Peace is Education for Peace. Fifty-seven million children are still denied an education and they have to be educated beyond the three Rs. Issues such as mutual respect and the peaceful resolution of conflicts should be an integral part of their academic curriculum. International organisations, religious institutions and education are all in the quiver to attack war and violence. But those who support the aggression theory state that man's pugnacity has survived from his animal's roots and there will always be wars. Despite the barriers obstructing the path to peace, men and women from all geographic areas will continue to struggle for that nirvana: peace, pax, la paix and la paz regardless of language. No wonder there are peace symbols in several cultures. \\u2022 Basil Ince is a retired professor of political science. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/world/teenage-climate-activist-nominated-for-nobel-peace-prize/article_00d8a828-45a8-11e9-8e9e-3bd714d72571.html\", \"TITLE\": \" Teenage climate activist nominated for Nobel Peace Prize \", \"DATE\": \"Mar 13, 2019 \", \"CONTENT\": \"Swedish climate activist Greta Thunberg gestures as she attends a protest rally in Hamburg, Germany, Friday, March 1, 2019. (Daniel Reinhardt/dpa via AP) Swedish climate activist Greta Thunberg gestures as she attends a protest rally in Hamburg, Germany, Friday, March 1, 2019. (Daniel Reinhardt/dpa via AP) Three Norwegian lawmakers have nominated Swedish teen activist Greta Thunberg, who has become a prominent voice in campaigns against climate change, for the Nobel Peace Prize. Freddy Andre Oevstegaard and two other members of the Socialist Left Party said they believe \\\"the massive movement Greta has set in motion is a very important peace contribution.\\\" Thunberg, 16, has encouraged students to skip school to join protests demanding faster action on climate change, a movement that has spread beyond Sweden to other European nations. Oevstegaard told the VG newspaper Wednesday that \\\"climate threats are perhaps one of the most important contributions to war and conflict.\\\" Any national lawmaker can nominate somebody for the Nobel Peace Prize. The Norwegian Nobel Committee doesn't publicly comment on nominations, which for 2019 had to be submitted by Feb. 1. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. TWO videos which show minors engaged in sexual acts with adults are now engaging the attention of police. This was confirmed by Children\\u2019s Authority chairman Hanif Benjamin yesterday. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. A PIPE FITTER who told the court he found and kept five protected turtles, has been arrested\\u2026 Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/everywhere-is-war/article_94f55e56-f1ac-5428-94d5-5a3adf2683ca.html\", \"TITLE\": \" Everywhere is war \", \"DATE\": \"Apr 8, 2011 \", \"CONTENT\": \"LEADING THE WAY: Catholics came out in their numbers in Tobago for the re-enactment of the stations of the cross, led by Monsignor Kenneth Spence, at right, on Good Friday. \\u0097Photo: ELIZABETH WILLIAMS LEADING THE WAY: Catholics came out in their numbers in Tobago for the re-enactment of the stations of the cross, led by Monsignor Kenneth Spence, at right, on Good Friday. \\u0097Photo: ELIZABETH WILLIAMS MY Trinidadian friend rang me and said, \\\"War going on.\\\" Normally this does not have anything to do with an openly declared state of organised violent conflict typified by extreme aggression, societal disruption and high mortality. Most of the time \\\"War\\\" is an abbreviation of the word \\\"what\\\" so when you hear a Trini say, \\\"War happening\\\" or \\\"War you think you doing\\\" or \\\"War kind of nonsense you talking\\\" you interpret the \\\"war\\\" as \\\"what\\\" and answer accordingly. \\\"Not much,\\\" I replied. \\\"American Airlines cancelled my flights last week and did not want to reimburse my hotel costs so they said that a fire in their fuel dump was an act of God but apart from that nothing of consequence. War about you\\\" \\\"Listen,\\\" he said. \\\"What I am trying to tell you is that war going on, real war.\\\" \\\"Of course,\\\" I responded cynically, \\\"I watch BBC too and apart from Iraq and Afghanistan, they have war in Libya and they have civil war in a bunch of other places.\\\" \\\"I am not talking about them,\\\" he expostulated. I interrupted him, \\\"You hear Jay Leno last week He said America is now fighting three wars and ask people to imagine how many it would be if Obama hadn't won the Nobel Peace Prize. \\\"Yeah,\\\" my friend said, \\\"and Jimmy Kimmel took on Sarah Palin.\\\" Kimmel said, \\\"Sarah Palin continues to make significant contributions to the English language. She asked, 'Is Libya a war, an intervention, a squirmish, what is it' Squirmish is how I feel every time I hear Sarah Palin talk.\\\" I was feeling squirmish myself and asked, \\\"Well what war is this you talking about\\\" \\\"The one between Jamaica and Barbados,\\\" he replied, satisfied that he had now got my attention. \\\"You crazy,\\\" I retorted. \\\"There is no war like that.\\\" \\\"There is now,\\\" he said and proceeded to tell me what he knew of the story. It seems that a Jamaican woman travelling to Barbados on March 14, 2011, was subjected to a search by a female immigration officer, who (it was claimed) placed her finger in the private parts of the woman while ostensibly searching for drugs. The Jamaican woman, Shanique Myrie, who took her plight to the Jamaica Observer, alleges that she was subjected to two demeaning cavity searches by a female immigration officer who continuously spewed venom about Jamaicans. Although no contraband was found on Ms Myrie, she claims she was refused entry into Barbados and detained by officers before being sent back to Jamaica on the following day. Ms Myrie gave an extremely graphic account of her experience to the media: \\\"The lady took me into a bathroom and told me to take off my clothes. I did as requested. After searching me and my clothes she found no contraband or narcotics. She then asked me to bend over, open my legs and spread (my private parts). She said that if I did not comply then she would see that I end up in prison in Barbados. When I bent over and spread my (private parts) I felt something enter my (private parts) and when I looked between my legs I saw her gloved hand in my (private parts). I screamed and stood up. She then told me if I obstructed her doing a cavity search she would have me locked up. I bent over again and spread. She again inserted her fingers and poked around. I felt like I was being raped. I was so hurt and ashamed. I felt dirty and defiled. I asked her who she was and she said 'I am your worst nightmare'. She then said 'All you (expletive) Jamaicans come here to do is either steal people's man or bring drugs here,\\\" Ms. Myrie recounted. Ms Myrie also claimed that the immigration officer removed her identification tag before humiliating her and that she complied because she was alone with the woman and feared what she would do to her.\\\" The first thing that the Barbadians supposedly did after sending Ms Myrie back to Jamaica was insist that she was lying. At a press conference a few days later, Minister of Foreign Affairs and Foreign Trade, Senator Maxine McClean, told reporters: \\\"There is absolutely no truth to a story carried in a Jamaican newspaper on Thursday, March 24, that a female citizen of that country was body-searched by Immigration officers on arrival at the Grantley Adams International Airport.\\\" Despite this, the governments of both countries were holding high-level meetings to seek to resolve the issue peacefully. When I heard my friend's summary, I was, of course, aghast, appalled and alarmed but not at the incident so much as the possibility that war would break out. The last war that started in the region was precipitated by an anatomical issue. In 1731, just off Havana, Captain Robert Jenkins supposedly insulted the Spanish captain, Juan de Leon Fandino. For this insult, Fandino used his sword to cut off one of Jenkins' ears. In 1738, before a committee of the House of Commons, Jenkins reported the incident and exhibited his severed ear. In this report, he said that his ear was \\\"cut off in April 1731 in the West Indies by Spanish coast guards who had boarded his ship, pillaged it and then set it adrift.\\\" Thus began the \\\"War of Jenkins' Ear.\\\" If a war starts between Barbados and Jamaica about Ms Myrie's experience, I wonder what they would call it. Tony Deyal was last seen saying that he passed through the Barbados Airport last week but sadly nobody fingered him for any offence. He did tell a Customs Officer, when asked, that he had no food with him because he did not want her pawing through his buns TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/when-time-is-no-healer/article_6ea0d7cb-f111-511a-8cf6-e7d7544b1ca1.html\", \"TITLE\": \" when time is no healer \", \"DATE\": \"Jan 6, 2009 \", \"CONTENT\": \"AT the start of every new year it is certain that many people will see it as an opportunity to deal with certain matters in a more positive manner, especially if it is felt that earlier vacillation had gotten them nowhere. Experience has shown that while time might be regarded as a healer, it is not always helpful in improving bad situations. One reason for this is that the problem being faced might not be one that will change with the passage of time, but can only improve with a change of attitude, sometimes on all sides. Until those involved come to this understanding all that time does is add to their frustrations. It is always important that where a change in approach or attitude is being adopted by even one party, or one of the protagonists involved, it must be obvious to many others involved that this is the case. This is so even in war. For example, the conflict between the Israelis and the Palestinians has been going on for decades with the Israelis claiming that all they want is to live in peace with the Palestinians; while the Palestinians cannot forget that they were displaced from land they once occupied and the Israelis restored to what was theirs earlier. They would want to have Israel wiped out. These children of Abraham have found it impossible to live in peace. And when they explain why they have been doing what they do to one another for generations, on each side there is some sense. The Israelis would say they were occupiers of the land the Palestinians say was theirs long before the Palestinians occupied it. The Palestinians would counter that they were rudely and deliberately displaced or removed from the same land, so it could be reoccupied by the Israelis. Therein lies an old grudge. And so the beat goes on. What certainly adds to the frustration of the Palestinians is that the Israelis definitely have more clout and garner more support from the nations of the world, for one reason or another. So they do not see the rest of the world really taking their cause seriously. So while they would in their frustration launch hundreds of rockets into Israel and kill a few Jews, when the better armed Israelis hit back, the Palestinians are killed in their hundreds, with the Israelis taking care to point out that ethnic cleansing is not their desire. They only want to protect themselves and live in peace. So this conflict drags on with no sign of ending. What results is that now and then these two nations take a break between the hostilities and then return to their deadly business. It does not make sense. But then how many wars ever do. For certain, neither side can jump off the planet, and so, however long the conflict lasts they will still have to live as neighbours, though not loving each other as themselves. Whenever they flare up the rest of the world stands by to call for restraint or a truce. After hundreds of lives have been lost, they find it possible to restrain themselves. It is a conflict that does not make sense. The Palestinians do not have the military hardware to wipe out the Israelis. They must know this. The Israelis know they have the military means to wipe out the Palestinians, but they know the rest of the world, especially the Arabs, will not just stand by and let this happen. The implications, to say the least, would be far-reaching, dragging many others into the conflict, who at the moment are just looking on, giving moral support, or stoking the fire with arms supplies. Furthermore, it is not uncommon for all sides to offer up their prayers before setting out to kill \\\"the enemy\\\" . . . all God's children. Courtesy barbados Nation TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/government-cops-respond-to-marlene-mcdonald-s-arrest/article_b8221798-b9e4-11e9-8bc6-afafcc864fa6.html\", \"TITLE\": \" Government, cops respond to Marlene McDonald's arrest \", \"DATE\": \"21 hrs ago \", \"CONTENT\": \"Port of Spain South MP Marlene McDonald FLASHBACK: Newly appointed Minister of Public Utilities Marlene McDonald is congratulated by, from left, close friend Michael Carew, Jean Elder, chairman of the Port of Spain South Constituency, Port of Spain \\u201ccommunity leader\\u201d Cedric (Burkie) Burke, Kenroy Dopwell and Sharon Felix at President's House, St Ann's, after she was sworn in. \\u2013Photo: CURTIS CHASE Minister of Public Administration, Marlene McDonald MP Marelene McDonald's constituency office. {{description}} Email notifications are only sent once a day, and only if there are new matching items. Port of Spain South MP Marlene McDonald Government this afternoon acknowledged for the first time the police investigation involving Public Administration Minister Marlene McDonald. In a brief statement issued at 2:39p.m. newly appointed Communications Minister Donna Cox said: \\\"The Government of the Republic of Trinidad and Tobago (GoRTT) wishes to confirm that a search warrant was executed at the home of Minister of Public Administration the Honourable Marlene McDonald this morning (8 August 2019). However, this is an ongoing police investigation and further information will be provided as it is made available by the Trinidad and Tobago Police Service.\\\" Shortly after the Government's statement, the TTPS issued an statement of its own. The TTPS stated: \\\"Police officers investigating alleged corruption offences have arrested and taken into custody, Government Minister Marlene McDonald and her husband for questioning. They were detained earlier today, Thursday 8th August 2019. Enquiries are ongoing at this time and more information will be provided when it becomes available.\\\" At around dawn today, McDonald and her husband were detained. McDonald, the Member of Parliament for Port of Spain South was taken into police custody. The arrests were made at the couple's home at around 4a.m. by police executing a search warrant. The detention came after police went to the Director of Public Prosecutions Roger Gaspard with an investigation file on Tuesday. McDonald, a Cabinet minister, is being investigated on the allegation of misappropriation of public funds. MP Marelene McDonald's constituency office. The Express was told that McDonald, complained of feeling unwell and was treated at hospital. On June 1, 2017, Prime Minister Dr Keith Rowley advised then President Anthony Carmona to revoke the appointment of McDonald who was then Minister in the Ministry of Public Utilities. Minister of Public Administration, Marlene McDonald McDonald had only recently been sworn in as Minister in the Ministry of Public Utilities after a sixteen month period of absence from the Cabinet. Why was MacDonald fired then? McDonald met with Prime Minister Dr Keith Rowley the morning of her firing, as a result of the controversy caused by her choice of guests attending her swearing-in ceremony at the President's House in St Ann's days before. The commotion surrounds the presence of reputed \\\"community leader\\\" Cedric \\\"Burkie\\\" Burke, who accompanied contractor Kenroy Dopwell to the event. Senior elements of the national security community had expressed alarm at the presence of Burke, who has been engaging their attention. FLASHBACK: Newly appointed Minister of Public Utilities Marlene McDonald is congratulated by, from left, close friend Michael Carew, Jean Elder, chairman of the Port of Spain South Constituency, Port of Spain \\u201ccommunity leader\\u201d Cedric (Burkie) Burke, Kenroy Dopwell and Sharon Felix at President's House, St Ann's, after she was sworn in. \\u2013Photo: CURTIS CHASE Not only was he present, but Burke was introduced by her to the President and posed for pictures with Carmona Carmona. On August 2, Rowley reappointed McDonald, to the post of Minister of Public Administration. Burke was detained on Monday by police who seized his electronic devices including cell phones and laptops. He was questioned and released on Wednesday morning. Reporting by Alexander Bruzual Police need help in locating 16-year-old Shakira Moore. A woman and her lesbian lover were allegedly beaten by the woman\\u2019s husband after she confess\\u2026 FOURTEEN-year-old Nicholai Hodge died as a result of two stab wounds to the chest, an autops\\u2026 PRIME Minister Dr Keith Rowley, who spoke yesterdat to CNC3 News following the detention of \\u2026 Minister in the Ministry of Public Administration and Communications, Marlene Mc Donald spen\\u2026 Government Minister Marlene McDonald was dealt a third strike to her political career yesterday with her arrest by police on corruption allegations. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/cops-not-soldiers/article_a4ca375e-78f3-5402-bb50-8c443a82f03b.html\", \"TITLE\": \" Cops, not soldiers \", \"DATE\": \"Jan 12, 2013 \", \"CONTENT\": \"Soldiers are not meant to police citizens unless under temporary emergency powers to maintain or enforce peace in wartime. Give the police more teeth. Enforce existing laws. Increase manpower. Give them a salary they deserve, provide training and better equipment to detect and suppress crime, and get rid of the rot tainting them. Soldiers with powers of arrest will create a war zone. Soldiers are trained to kill or be killed. Citizens will become that enemy. This is the case worldwide. They are not instructed in the intricacies of discussion, chain of evidence or conflict resolution without a gun. While I genuinely admire the soldiers who put their lives on the line every day in the defence of country, I have witnessed the unintentional damage soldiers inflict. They do not read you your rights. You do as you are told. If you do not stay down when told, they will put you down hard. This is what citizens can expect if soldiers patrol the streets unaccompanied by police officers. However, unleashing them upon the warring factions in Mango Rose and similar areas will probably accomplish what the police cannot: an end to the murders over turf and \\\"disrespect\\\". Catherine Hidalgo Port of Spain TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/opinion/columnists/japan-s-new-world-order/article_1d1e6b4c-cc24-11e8-af7d-6f075e0bd9a4.html\", \"TITLE\": \" Japan\\u2019s new world order \", \"DATE\": \"Oct 9, 2018 \", \"CONTENT\": \"{{description}} Email notifications are only sent once a day, and only if there are new matching items. It was as a means of demonstrating, fostering and promoting international understanding through non-violent means, through art and culture. More than a dozen journalists from different countries, including Australia, the US and South Korea, travelled across a number of cities over a five-day period in August 2013. The idea was built on the model of the Japanese national creed, that the country will never again go to war. And it will strive to find solutions to conflict through peaceful means. IN yet another incident which has had the effect of piling \\u00adembarrassment upon embarrassment for the authorities, a convict walked out of the Golden Grove facility in Arouca on Thursday, and was on the run up to last night. THE West Indies has had a phenomenal number of exceptional cricketers in its history. The captains have been mostly \\u00admiddling. I restricted the playbooks to those of Frank Worrell, Richie Benaud and Mike Brearley simply because they were known as thinking men; able in both the technical and \\u201cman-management\\u201d aspects of the game. International Youth Day is approaching. It is time for the youth of this country to stand up and make their voices heard. It is time to become more \\u00adinvolved in the political process to put an end to the corruption and mismanagement taking place far too often and for too long. Recently, the press \\u00adreported that a mother was in tears after her victim impact statement was read out in court during the trial of the accused for her son\\u2019s murder. She cried out for answers as to the reason the accused, having robbed her son of his \\u00adcellphone, had killed him. While the horizon must seem unrelievedly grim to many citizens, once in a while a few specks of bright light appear to \\u00adrelieve the gloom. And so it was \\u00adrecently when it was announced that the country\\u2019s first drug treatment court was to be established within three months. Regarding the arrest of Minister Marlene McDonald in the ongoing investigation of corruption charges levelled against her, Dr Rowley bought that wholesale. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/african-union-gets-full-support-from-govt/article_12bc8d14-7ef9-5f13-9354-4131c780cff1.html\", \"TITLE\": \" African Union gets full support from Govt \", \"DATE\": \"Mar 24, 2014 \", \"CONTENT\": \"The Government of Trinidad and Tobago has expressed approval of the African Union's (AU) mediation efforts for peaceful resolution of armed conflicts in South Sudan and Central African Republic. A release from the Ministry of Foreign Affairs on Monday stated: \\\"The Government and people of Trinidad and Tobago applaud the efforts of the African Union to continue to press for a cessation of armed conflict in Africa and in particular in war-torn regions such as South Sudan and Central African Republic.\\\" The release added that Permanent Representative of Trinidad and Tobago to the African Union and High Commissioner of this country to Uganda, Patrick Edwards, attended the 22nd Ordinary Session of Heads of State and Government of the African Union, held in Addis Ababa, Ethiopia from January 27-31. \\\"Outgoing chairperson of the AU, Ms Nkosazana Dlamini Zuma, in presenting the AU Agenda to 2063, called on all Africans and people of African descent in the diaspora 'to continue contributing to defining the Africa they want in the 21st century'. \\\"On the issue of peace and security in Africa, Madam Zuma called for \\\"the guns to fall silent by 2020\\\" since the costs of conflicts and internal strife are too huge. She further stated that \\\"efforts must be made to create a climate for peace and stability, including effective democratic and accountable governance, by ensuring development and shared prosperity\\\". the release stated. The focus of the 22nd Summit of African Leaders was the conflicts in South Sudan and Central African Republic, which were declared by the chairman as \\\"having serious implications for the peace and security, not only of the region, but for Africa as a whole\\\". \\\"All sides of the conflict were urged to fully implement the recently signed ceasefire and to cooperate without pre-condition with the mediators from the Inter-governmental Authority on Development (IGAD) to address the causes of the problem,\\\" the statement added. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/m-spent-to-fix-east-pos/article_4378cb4b-994c-5846-b1f7-6aae9bf55d97.html\", \"TITLE\": \" $2.3m spent to fix East PoS \", \"DATE\": \"Dec 15, 2012 \", \"CONTENT\": \"Some $2.3 million was spent on upgrade works in various areas of East Port of Spain, where Planning Minister Dr Bhoe Tewarie yesterday urged residents to promote peace and take pride in their communities. Tewarie and members of the East Port of Spain Development Company visited four areas to formally open the upgraded sites. A new road at Layan Hill cost some $484,000; re-paving of Fatima Trace as well as drainage works $870,000; an access road at Thompson Trace $450,000; and a multi-purpose court at Jacobin Street $550,000. Port of Spain North/St Ann's West MP Patricia McIntosh was present at the opening of the road at Layman Hill and Laventille West MP Nyleung Hypolite was also in attendance at the opening of the road at Fatima Trace. Tewarie noted that the projects were completed within budget and labour was provided by the people in the areas. \\\"The community has to take responsibility, if you have a place that is a war zone you can't have development, you need peace, you need a certain amount of development happen,\\\" said Tewarie. \\\"While we have had 50 years of significant development in the country...we've also had 50 years of what you might call neglect and to some extent underdevelopment and we need to bridge that gap now for all the people in the communities in which they live.\\\" Tewarie urged the people to move from a situation of conflict to a climate of peace to achieve development. \\\"Let us create a zone of peace on Leyan Hill, let us create a wider zone of peace throughout the East Port of Spain area, let us create a zone of peace throughout Trinidad and Tobago and let us work together to make development happen,\\\" he said. McIntosh said she heard the cries of the people and has been liaising with Government ministers to get various projects done, as well as to address other problems plaguing the area. She requested that Minister Tewarie use his influence to deal with the overgrown bushes in the area which she said was posing health and security risks to the people. Hypolite suggested that the East Port of Spain Development Company be given increased funding and more projects to complete, as he expressed confidence in the company in getting things done. Hypolite said he submitted a list of 120 roads in his constituency that need upgrade works and some 58 drains that also need attention. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/this-quintessence-of-dust/article_7992b135-260f-5fef-9262-54e20e9c35b6.html\", \"TITLE\": \" This quintessence of dust \", \"DATE\": \"Jul 8, 2014 \", \"CONTENT\": \"T his year marks one hundred years since the outbreak of World War 1. It is an opportunity for reflection as Trinidad and Tobago promises soldiers on every street corner, joining many other countries who find it necessary to be prepared for war against forces internal or external in a world becoming increasingly destabilised. War is the hell that mankind seems doomed to keep repeating, begging the question: is there a fundamental absurdity to human existence Is armageddon the inevitable outcome of civilisation Carnage and anarchy characterised life on earth until about 5,000 years ago when civilisation started emerging from the agricultural settlements that had started some 5,000 years earlier. At least six ancient civilisations emerged bringing some order. Later, the emergence of nation states helped enforce peace within borders and reduce civilian exposure to war, moving some to say the world gradually became more peaceful. Some even claim the last century was the most peaceful in human history. This is hard to accept. World War 1 started in 1914, involved 65 million soldiers from 30 countries and introduced machine guns, tanks, planes and chemical weapons into warfare, bringing horrific death and destruction. Fought mainly in the trenches, it killed an average 6,000 soldiers every day, ended up killing over nine million and wounding 21 million more and was directly responsible for the death of 16 million people, including poet Wilfred Owen at age 25. It was supposed to be the war to end all wars but is at the root of the horror that continued in the 20th century. The war had drained the entire world economy and would contribute significantly to the Great Depression. The Treaty of Versailles imposed on Germany, sole responsibility for the war and reparations which economist John Maynard Keynes found harsh excessive and counterproductive. Additionally, as one consequence of the war, Europe experienced a general inflationary period in the 1920s, causing hyperinflation in Germany that destroyed personal savings, produced massive unemployment and increased social unrest. Besides in seeking to marginalise Germany, Western European powers weakened its democratic leaders, rekindled nationalism and the desire to restore German prestige. This was the facilitative environment into which Adolf Hitler emerged with the Nazis to become Chancellor and establish the Third Reich to replace the fragile Weimar Republic. Twenty years after World War 1, Hitler invaded Poland and started World War 11 which inflicted almost 85 million fatalities, including six million Jews in the Holocaust and introduced nuclear weapons when America bombed Hiroshima and Nagasaki. This has been the deadliest conflict in human history. Are we getting more peaceful or better at destroying ourselves You would have thought that after 1945 there would at least be a pause. There was some hope in the establishment of the United Nations, especially with permanent members of the Security Council being victors of the war: the US, Soviet Union, UK, China and France. But then came wars of national liberation and proxy wars from decolonisation and the Cold War respectively, producing bloody conflict in Latin America, Africa, Asia and Indo China. The peace dividend after the Berlin Wall was also an illusion. War returned to Europe with the break-up of the former Yugoslavia. Not long after, Al Qaedea attacked America on 9/11, the US invaded Afghanistan and Iraq, and the Arab Spring toppled or challengeddictatorships in North Africa and the Middle East opening the way for the present widening sectarian conflict between Sunnis and Shias in the Islamic world, driven by the emergence of ISIS which some say is a terrifying challenge to civilisation from a growing body of fanatics as keen as Hitler on controlling the world. Will civilisation survive the 21st century World War I saw the entry for the first time of American forces in Europe. It marked the turning point in the war and the arrival of America as a global military force on which western civilisation has relied to this day for security and the protection of democratic values. But the US is today in retreat, creating a vacuum for the most frightening chaos yet and which threatens every nation on earth. So from homo erectus, two million years ago, to the present, we must prepare for war. It does make you wonder, like Hamlet, about man: how noble in reason, how infinite in faculty!...in apprehension how like a god!...The paragon of animals! And yet to me, what is this quintessence of dust TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/gaza-worse-than-a-crime/article_46b8036a-4196-518d-bcc7-bfc5ad44d766.html\", \"TITLE\": \" Gaza worse than a crime \", \"DATE\": \"Jan 13, 2009 \", \"CONTENT\": \" \\\"Israel is not going to show restraint,'' Foreign Minister Tzipi Livni told the Washington Post on Saturday, after the United States abstained on Friday's UN Security Council resolution calling for a ceasefire in Gaza. All last week the speculation grew that Washington was going to defy its Israeli ally for once and vote for the resolution, but literally as the delegates sat down in the Council chamber the phone call came from President Bush ordering Secretary of State Condoleezza Rice to abstain. So nothing will stop Israel from hammering the Gaza Strip as hard as it likes and the situation is unlikely to change with the inauguration of Barack Obama later this month, because he has no intention of squandering his abundant but finite political capital on a quixotic attempt to bring peace to the Middle East. He will spend it instead on goals that have some chance of being achieved, and he will be right to do so. Yet the Israeli offensive in the Gaza Strip will almost certainly end within the next two weeks. International revulsion at the carnage among Palestinian civilians will play a certain role. Any big loss of life among Israeli soldiers, or the capture of even one or two soldiers, would turn Israeli public opinion against the war overnight. And the clincher is that the Israeli election is on February 10. The war is being fought now largely to shift the opinion polls in favour of the ruling parties before the election. However, it must be over, and somehow look like a success, before Israelis actually vote. Good luck. The war against Hamas in Gaza looks more and more like the three-week Israeli war against Hizbollah in Lebanon in 2006, which could hardly be called a success. It will last about as long. It will kill about as many Arabs, probably a thousand or so. And it will end with Hamas, like Hizbollah, still able to fire rockets at Israel. This means that Binyamin Netanyahu, the Likud Party leader who was already leading in the opinion polls, is almost certain to form the next Israeli government. He is the ultimate rejectionist, the man who successfully sabotaged the Oslo Accords and effectively killed the \\\"peace process'' during his last term as prime minister in 1996-99. He rejects the very idea of a \\\"two-state solution'' to the Israeli-Palestinian conflict. Netanyahu is a glib ideologue who does not understand strategy and sees no reason for Israel to seek peace with its neighbours if the price is giving the Palestinians back their pre-1967 borders. In the long run, therefore, the war is more of a disaster for the Israelis than it is for the Palestinians. Israel currently enjoys three huge strategic advantages. It has the strongest army in the region by far, backed by the only modern economy and the only technologically competent population. It has an absolute monopoly on nuclear weapons within the region. And it has the unstinting, unquestioning support of the world's only superpower. But none of these advantages is forever, and Israel needs to make peace with its neighbours while it still possesses them. The existing Arab regimes are willing to make peace with Israel on the basis of the 1967 borders, mainly because they fear the further radicalisation of their own populations, and perhaps even violent revolution, if the Israeli-Palestinian conflict continues to fester. But the Arabs as a whole have all the time in the world: sooner or later the wheel will turn and Israel will become vulnerable. If it has not integrated into the region by then, it will be in mortal peril. It is pointless to make moral judgements about this war, and foolish to use the body count as an indicator of virtue or blame. That is quite true: Hamas would do exactly the same to Israelis if it could. The prospect of a 70-to-one kill ratio makes Israel much readier to use military force than if it had to sacrifice one Israeli life for every Palestinian it killed, but the kill ratio tells us nothing about either the morality or the utility of the war. It is the usefulness of this war, not its morality, that Israel should be questioning. Unless Israel re-occupies the Gaza Strip permanently which nobody wants to do, because it would mean a constant stream of Israeli military casualties then once the army pulls back Hamas will re-emerge, stronger than ever. The Arab regimes that might make peace with Israel will be further undermined, and Israel gets Binyamin Netanyahu as prime minister. As was said after the execution of the Duc d'Enghien on Napoleon's orders, the Gaza operation \\\"is worse than a crime. It is a mistake.'' Gwynne Dyer is a London-based independent journalist whose articles are published in 45 countries. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/for-ukraine-gaza-only-gloomy-peace-prospects/article_9d76ba89-e263-5546-82dd-068ba8d90c36.html\", \"TITLE\": \" For Ukraine, Gaza, only gloomy peace prospects \", \"DATE\": \"Jul 20, 2014 \", \"CONTENT\": \" World attention remains riveted on developments in eastern Europe and in the Middle East, that have stirred more despair than hope in the prospects for peaceable international relations. Five days since a missile fired from Ukraine destroyed a civilian airliner, killing nearly 300, quarrelsome finger-pointing continues over both responsibility for the massacre and investigations into the incident. Airline passengers have, in earlier occurrences, been victims of horrific collateral damage resulting from assorted conflicts. Last week's aircraft downing, however, especially touched people everywhere if only for being the second major disaster in four months suffered by Malaysia Airlines. Wrenching stories keep being told about the innocent lives lost, including of world-leading HIV/Aids researchers, who were headed to a conference in Kuala Lumpur. Until then, for those flying for business or pleasure to various parts of the globe, Ukraine had likely been a remote theatre of war. Trinbagonians and other Caribbean people, among whom count some frequent flyers here and there, have been inevitably touched by the wholly unexpected end of Malaysia Airlines Flight 17. It is further distressing that the carnage figures in bitter disputes within a Ukraine torn by hostilities pitting those favouring ties with the European Union and the US against others preferring alliances with the Russian Federation. Neither side of course claims to have fired the missile. Though both sides voice support for an independent international inquiry, not only is a blame game in full swing but the investigation is also not being immediately facilitated by the pro-Russian forces in control of the crash site. Meanwhile, as the Obama administration all but accuses its opposite number in Moscow of complicity, fear arises that the truth about Flight 17 could be a casualty of some latter-day cold war. In its capacity as a stalwart supporter of Israel, Washington is also, at least morally, a party to the bloody confrontation now engulfing the notorious Gaza Strip. By yesterday, some 500 Gaza inhabitants, maybe half of them women and children, had been killed by Israeli aerial and naval strikes and by ground troops. Consistent with the normal pattern, just 25 Israeli soldiers have died and maybe two civilians. Once again, Israeli bombs and artillery have been directly targeting civilian-inhabited Gaza areas. This is justified on the ground that Palestinian Hamas fighters, themselves firing rockets into Israeli territory, operate from within such communities. While the US upholds Israel's right to defend itself, by any means necessary, there have been no meaningful UN moves toward ending the conflict. This time, even with casualties rising on both sides, a lasting peace, starting with a ceasefire, appears hopelessly beyond reach. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/bas-gypsy-in-war-of-words/article_057ce932-2d82-5b0d-b4e5-c63eabbcaf01.html\", \"TITLE\": \" Bas, Gypsy in war of words \", \"DATE\": \"Apr 6, 2009 \", \"CONTENT\": \"A war of words broke out between Opposition Leader Basdeo Panday and Mayaro MP Winston \\\"Gypsy\\\" Peters yesterday, during a special UNC meeting at the Rienzi Complex in Couva. The meeting was convened to discuss the party's strategy for the upcoming Local Government elections. Present were the party's Parliamentary arm and various local bodies from the different corporations. As the meeting drew to a close, Peters took the opportunity to clear the air on statements made by Panday that the dissidents of the partyPeters, Jack Warner and Ramesh Lawrence Maharajmust have made a deal with the PNM because of their actions over the past few months, which has brought the UNC into disrepute. The trio have been demanding internal party elections and holding meetings throughout the country to convince the population to support their calls. \\\"I have no deal with the PNM. I want to make it absolutely clear I have no deal with the PNM and have no intention of doing that, \\\" Peters said. The media was not invited to the meeting, which was a closed-door session, but the Express was able to hear the proceedings, carried on a public address system, from outside. Maharaj and Warner were not present at the meeting. Peters said there was need for conflict resolution in the party and this must be checked soon. Panday replied that there were organs and structures within the party to deal with such issues, and rather than airing the party's business outside, they should come to the party's meetings and do so. But Peters said the executive cannot deal with conflict resolution and there must be other people in place for this. Panday noted that there was a disciplinary committee of the party and questioned whether Peters wanted a pre-disciplinary committee put in place. Panday stressed that there were many organs within the UNC to deal with whatever problems may arise. Panday asked Peters why he did not attend the UNC Parliamentary meetings to raise his concerns. \\\"You know you have the say inside here,\\\" Peters shot back. Panday responded, \\\"Say that on Wednesday night, not tonight.\\\" Panday reiterated that these issues had a place to be aired. \\\"You are not bringing your complaints here, you are taking it on the road!\\\" Panday said to Peters. \\\"Right now we are creating another conflict,\\\" said Peters, as the two men continued their exchange. \\\"You are running a parallel organisation,\\\" said Panday, adding that Warner, Peters and Maharaj were playing into the hands of the PNM. Peters told Panday that there were a lot of people who are afraid to tell him (Panday) the truth. Panday also asked Peters why he moved to the back bench of the Parliament last Friday. \\\"I did it to register my own displeasure,\\\" said Peters, telling Panday that he was sure if he, Warner and Maharaj were on good terms, there would have been no repositioning in the Parliament. He said the decision to move Warner, Maharaj and himself to the end of the Opposition front bench was an act of vindictiveness. On Friday, the name cards of the three men were moved lower on the Opposition front bench. However, Peters and Maharaj removed these cards from their slots and went to the Opposition backbench. \\\"You are the most indisciplined person I know,\\\" Panday shot at Peters, as he (Peters) countered, \\\"My belief is my belief.\\\" Peters said until Panday's vindictiveness subsides, there would be no calm in the party. He asked Panday why he had not made a move to call the men and make peace. Panday said he was ready and willing to meet at any time to discuss these issues, but claimed Warner did not want to meet. Members at the meeting expressed their views following the heated exchange between Peters and Panday. One person said that Local Government elections were fast approaching and this behaviour could not be tolerated. He said what Maharaj, Peters and Warner were doing was hurting the party. The man made a plea to Peters to look at what they were doing. He also told Panday that the trio must be given an opportunity to be heard. Panday responded that they would do so on April 15 at a special meeting scheduled for this sole purpose. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/govt-stop-loss-of-life-in-syria/article_30fa6d98-a240-59d9-9b55-65c597c49c3e.html\", \"TITLE\": \" Govt: Stop loss of life in Syria \", \"DATE\": \"Sep 15, 2013 \", \"CONTENT\": \"\\u0091Save Syrians\\u0092: Minister of Foreign Affairs Winston Dookeran, left, during yesterday\\u0092s national budget debate in the Lower House at Tower D, International Waterfront Centre, Port of Spain. From right are Dr Roodal Moonilal and Finance Minister Larry Howai. \\u0097Photo: ISHMAEL SALANDY \\u0091Save Syrians\\u0092: Minister of Foreign Affairs Winston Dookeran, left, during yesterday\\u0092s national budget debate in the Lower House at Tower D, International Waterfront Centre, Port of Spain. From right are Dr Roodal Moonilal and Finance Minister Larry Howai. \\u0097Photo: ISHMAEL SALANDY Trinidad and Tobago has called on all parties in the conflict in Syria to allow international mediation, with a view to reducing the loss of life and suffering of the Syrian people. The following is T&T's statement on Syria which was read out by Foreign Affairs Minister Winston Dookeran in the House of Representatives yesterday: \\\"Trinidad and Tobago welcomes with relief, satisfaction and cautious optimism, news that the United States and Russia have on Saturday reached a sweeping agreement conceived by the Russians for Syria to surrender its stockpile of chemical weapons to international control to facilitate its destruction by mid-2014. \\\"This agreement significantly reduces the possibility of US-led militiary action against the Syrian regime as punishment for its alleged use of chemical weapons against the Syrian people on August 21. \\\"Trinidad and Tobago and its Prime Minister (Kamla Persad-Bissessar) has noted that the alleged agreement explicitly includes the United Nations Security Council in determining possible international action in Syria and is encouraged by the fact that Russia has maintained its opposition to military action while the Americans have said very firmly that once the Assad regime honours its obligations under the agreement, there will be no military action. \\\"The Government of Trinidad and Tobago congratulates the governments of both the United States and the Russian Federation for the commitment to peace and security in a region ravaged by war, political instability and intolerable human suffering. \\\"At the same time, it (the Government of Trinidad and Tobago) calls on the Syrian Government to honour its obligations under the agreement which requires it to submit, within one week, a comprehensive listing, including names, types and quantity and locations of its chemical weapons stockpile. \\\"Trinidad and Tobago also calls for all parties to the conflict to use the agreement as a platform for solving the civil war through international mediation and other means that do not result in the continuing loss of life, destruction of property and intolerable levels of suffering of the Syrian people.\\\" Dookeran concluded by saying that Trinidad and Tobago was \\\"actively engaged with our Caribbean neighbours in forging a voice on these matters\\\". TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/giving-peace-a-chance-in-syria/article_61bc9c09-4664-5151-a97d-bd032b4b495a.html\", \"TITLE\": \" Giving peace a chance in Syria \", \"DATE\": \"Aug 31, 2012 \", \"CONTENT\": \" The most chilling appraisal of present life and future prospects in civil war-torn Syria came last week when President Bashar al-Assad was heard to say: \\\"The situation is practically better.\\\" The president's upbeat assessment must be taken to reflect his satisfaction over his armed forces' escalating aerial and other bombardment of residential areas, causing high casualties, uncounted fatalities resulting from search-and-seize assaults on civilian homes, and the expanding exodus of refugees over borders into Turkey and Jordan. For President Assad, \\\"better\\\" must mean the intensification of slaughter, devastation, and ruin of normal life expectations as experienced over the 18 months when neither the government nor the armed opposition have been able to defeat the other, nor even to make decisive advances. If that is now changing in favour of the Assad regime's firepower and on account of its support by Russia and China, the evolving situation amounts to a distressing advance for a bloodthirsty impulse, by any means necessary, to kill off opposition forces and to scorch the earth presumed to be inhabited by civil-war enemy supporters, many of them identified on a religious basis. In its own ways, the divided opposition forces, including former Syrian military officers and political figures, have been hardly less bloody-minded. Bereftof international support, however, the anti-Assad movement has not shown the capacity to project lethal force in any manner comparable to the Libyans rebelling last year against the late dictator Muammar Gadaffi. Initiatives by the UN, headed by the celebrated Kofi Annan, and by the Arab League, have failed to deliver peace, or any basis for talking in those terms. Against this background, Egypt, with its newly elected government, has launched a new peace initiative. This one gains curious international attention, if only for the fact that it proposes the eyebrow-raising involvement of Iran. Embattled against the international community because of its own nuclear ambitions, Iran appears an unlikely partner in any quest for Mideast peace and stability. As further evidence of the failure of multilateral initiatives, 120 Non-aligned Movement nations, meeting in Teheran last week, upheld Iran's case for becoming a nuclear power. Its final communiqu, however, avoided any mention of the burning issue of Syrian internal conflict. The non-aligned outcome opened the way for other efforts aimed at making a difference in Syria, a country with which T&T has some historic ties. French President Francois Hollande has been advocating for an internationally protected safety zone for refugees and civilian victims of the fighting. France, which is also calling on the divided Syrian rebels to form an interim government, can hardly be regarded a peace broker. Its proposal, however, aimed at safeguarding a Syrian civilian population caught in the crossfire, appears worth at least a try. Everything else, by everybody else, has failed. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/a-peaceful-world-not-phantom-fears/article_91b91c48-7530-5d9c-a740-eda6cf8b53e0.html\", \"TITLE\": \" A peaceful world, not phantom fears \", \"DATE\": \"May 27, 2013 \", \"CONTENT\": \"WEEKEND SAILINGS: Water taxi WEEKEND SAILINGS: Water taxi Imagine for a moment that all the wars of the world have come to a peaceful conclusion. Most violent crime against people and property has also been eradicated. The worst outbreak of violence in the world in the past 24 hours has been a fight in a bar in Irkutsk, Russia. What item do you think will lead the international news for the next 12 hours, or however long it takes until something fresher come along The bar fight in Irkutsk, of course. \\\"If it bleeds, it leads,\\\" says the axiom, and the world's media follow it slavishly, so they will always give you the impression that the world is drowning in violence. It is not \\u2013 but people think it is. Stop people at random and ask them how many wars they think are going on in the world right now. Most people would guess around a dozen, although they wouldn't be able to name them. The right answer is two, and one of them, Afghanistan, is probably approaching its end. There are close to 200 independent countries in the world, and only one in a hundred is currently at war. They are both primarily civil wars, although there is some foreign involvement in each case. The Syrian civil war is extremely destructive of lives and property, the war in Afghanistan less so, and in both cases the fighting occasionally slops over their borders, but that's it. There are a number of other countries where there is a lower level of civil conflict: the Democratic Republic of Congo, for example, or Colombia (although the latter is now engaged in peace talks to end the fifty-year conflict between the state and the FARC guerillas). But the Sri Lankan civil war is over, the Iraqi civil war is at least over for the moment, and the many little wars of West Africa are all over. Then there is Somalia, the world's only failed state, where twenty years of violent anarchy may finally be drawing to an end. But the actual scale of the fighting has rarely risen to a level that would qualify what has been happening there as a full-scale war. Not, at least, what would have qualified as a full-scale war back in the days when that sort of thing was still common. Most of the time Somalia's conflict has been more like gangland wars on steroids. There is terrorism in various places, like Boko Haram's bizarre campaign to impose Islamic law on Nigeria (where only half the population is Muslim), the Pakistani Taliban's campaign of murder against their Shia fellow-citizens, and the Naxalites' long and forlorn struggle to make a Communist revolution in India. All nasty, but none of them real wars. And there is, finally, the famous \\\"war\\\" on terror, which these days amounts to little more than over-zealous law enforcement at home and selective assassination by drones abroad. Like the \\\"war\\\" on drugs in Mexico, it is only a metaphor for an activity that is not really a war at all. So that's it: two real wars, and a clutter of lesser conflicts that really do not merit the term. In a world of seven billion people, only a few hundred million have even the slightest experience of organised violence for political ends. Why, then, do so many people think that the world is still overrun by war The media are partly to blame, but they are also manipulated by various governments that raise the spectre of war for their own ends. Wars that have not happened and are never likely to fill the imaginations of the public: a war in Korea, a US and/or Israeli attack on Iran, Western or Israeli intervention in Syria, a war between China and South-East Asian countries over islands in the South China Sea, a US-Chinese conflict in the Pacific, and on and on. A lot of people, some in uniform and some not, make a living off these mostly phantom fears, and they contribute to the general impression that the world is still a place where war, however deplorable, is the normal state of affairs. It is not. We live in an era where, for the first time in history, no great power genuinely fears attack by any other, and where the number of actual wars can be counted on the fingers of one badly mutilated hand. Almost 90 million people died in the world wars and other big wars (including the Russian, Chinese and Spanish civil wars) of the first half of the 20th century, out of a world population that was one-third of what it is now. In the second half of the century the death toll dropped steeply to 25 million or so, most of whom died in colonial independence wars and civil wars. And so far, in the 21st century, the total is less than one million people killed in war. What we have on our hands here is a miraculous and mostly unsung success story. There will doubtless be more wars, but they may be small and infrequent. We are obviously doing something right. We should figure out what it is, and do more of it. * Gwynne Dyer is an independent journalist whose articles are published in 45 countries. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/that-obama-peace-prize/article_4f4a8b8a-695a-5e76-88ed-b9844699c37d.html\", \"TITLE\": \" That Obama peace prize \", \"DATE\": \"Oct 13, 2009 \", \"CONTENT\": \"OFFICE CLOSED: A member of the Communication Workers Union (CWU) opens a door at the entrance of the Henry Street, Port of Spain office, on Thursday following the robbery. \\u2013Photo: AKILE SIMON OFFICE CLOSED: A member of the Communication Workers Union (CWU) opens a door at the entrance of the Henry Street, Port of Spain office, on Thursday following the robbery. \\u2013Photo: AKILE SIMON AT the time of writing this column yesterday no Caricom government had responded (not publicly anyway) to the very surprising award to President Barack Obama of the 2009 Nobel Peace Prize. It is not a case of any of the 15 governments disagreeing (they were certainly not opposed) to the hotly debated decision that is currently being projected internationally as \\\"an honour and burden'' for Obama. Rather, this public silence seems to reflect a preference among the President's worldwide admirers to suppress enthusiasm and for cautious optimism about his capacity to deliver on the enormous expectations he has aroused. The familiar refrain among admirers and cynics is that the award is \\\"premature'' and followed by the question, \\\"the Nobel Prizefor what''. A short answer could befor those in our region of the world and elsewhere not too critical to appreciateis the inspiring promise Obama boldly and sincerely holds out for that elusive world peace that's desperately needed to transfer resources from wars and conflicts to combat poverty, illiteracy and promote ethnic and religious harmony. The \\\"burden'' his presidency bears along with the \\\"honour'' bestowed by the Nobel Prize is to make a reality of the complex peace initiatives he is vigorously pursuing on various fronts at presentthe Israel/Palestine conflict; Iran, North Korea, and Syria (all involving the dangers of nuclear warfare); all this while seeking to win co-operation, if not friendship, in our own Greater Caribbean region (Cuba and Venezuela). His detractors want to know how a President, currently locked into an escalating war in Afghanistan and still doing the merry-go-round in Iraq qualifies for the Nobel Peace Prize. They also point to his stated policies to shut down Guantanamo Bay as a torture centre and for the prisoners to face court trials in the USA; ending the practice of torture as a weapon by the US intelligence and military forces; as well as his commitment to reverse the \\\"don't ask, don't tell'' policy involving gay Americans serving in the US military. Like the much bigger and challenging issues such as working for a nuclear-free world and achieving peace in the Middle East, all of the above remain works in progress. They are signposts of very good intentions for achievements to come. So what's so wrong with good intentions supported, in Obama's case, with more-than-sketched policy outlines and personal initiatives to achieve his objectiveseven as he remains steadfastly engaged in a herculean battle at home for healthcare reform It would appear that the Nobel committee figured that although nominations had closed just 12 days after Obama's inauguration, sufficient had been known of his intentions and initiatives as a president of merely nine months, to justify awarding him the prize. Fidel Castro may well have captured a wider sentiment when he carefully wrote in support of the peace prize award: \\\"I don't always share the positions of that institution (Norwegian Nobel Peace Prize Committee) but I am obligated to recognise that in this instance, it was, in my judgement, a positive measure.... \\\"Many will say,'' Castro added, \\\"that he still hasn't earned the right to receive such a distinction. We (Cuba) prefer to see in this decision, more than a prize for the President of the United States, a criticism of the genocidal policies that not a few presidents of that country have followed..'' In London, Secretary General of the Commonwealth of Nations, Kamalesh Sharma (of India), currently finalising arrangements for Trinidad and Tobago's hosting next month of the Commonwealth Summit, congratulated Obama. He declared that the award \\\"strikes a tremendous chord'' in recognition of his \\\"extraordinary efforts to strengthen international diplomacy and co-operation between peoples...'' Here's Obama's on the award: \\\"I do not view it as a recognition of my own accomplishments, but rather an affirmation of American leadership on behalf of aspirations held by people of all nations...To be honest I do not feel that I deserve to be in the company of so many of the transformative figures who have been honoured by this prize...'' Normally awarded for a lifetime of achievements since its creation in 1901, the Nobel Peace Prize is currently worth US$1.4 million. President Obama will travel to Oslo in December to receive the prize. He has already decided to donate the money to charity and made it clear that he \\\"remains a long way\\\" from achieving his list of goals. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/colombia-rebels-relax-play-soccer-as-peace-nears/article_03c7454b-ee5d-5504-87f3-2c1c1a8e305d.html\", \"TITLE\": \" Colombia rebels relax, play soccer as peace nears \", \"DATE\": \"Aug 23, 2016 \", \"CONTENT\": \"IN THE JUNGLE OF PUTUMAYO, Colombia (AP) \\u2014 It could be a sandlot soccer field almost anywhere in rural Colombia: flattened earth carved from the jungle with lopsided goalposts made of tree trunks painted the colors of the country's flag. But this is no ordinary pick-up game. The players are Revolutionary Armed Forces of Colombia guerrillas, and in behaving like laid-back, sport-loving youths, they're taking security risks that would've been unthinkable just months ago. In this Aug. 11, 2016 photo, rebels of the 32nd Front of the Revolutionary Armed Forces of Colombia pose for a team photo before the start of a soccer match in the southern jungles of Putumayo, Colombia. For the matches each front has two five-person teams, one male, one female. (AP Photo/Fernando Vergara) A team of Associated Press journalists recently spent a week with members of the FARC's southern bloc, one of the rebel army's oldest and most belligerent fighting units. As Colombia's half-century conflict winds down, with the signing of a peace deal close, thousands of FARC rebels are emerging from their hideouts and preparing for a life without arms. Gone are the days when they had to change camp every few days for fear of being stunned in their sleep by bombs falling from the sky. With a cease-fire largely in place, the hundreds of guerrillas belonging to the FARC's southern bloc have spent much of the past year in semi-permanent camps complete with refrigerators, satellite TV and even regular access to the internet for commanders. In this Aug. 11, 2016 photo, Manuel, a mid-level commander for the 48th Front of the Revolutionary Armed Forces of Colombia, or FARC, learns to play his guitar via the internet at a FARC encampment in the southern jungles of Putumayo, Colombia. The camp provides regular access to the internet for commanders. (AP Photo/Fernando Vergara) \\\"Before, the military situation would have never allowed this,\\\" said Pedro Gutierrez, one of the leaders of the FARC's 32nd Front. The \\\"FARC Olympics,\\\" which coincided with the Rio Games, began early in the morning as dozens of guerrillas made their way by motorized longboat through the waterways of southern Colombia to the camp of the 49th Front. The atmosphere was festive, reminiscent of a 19th century county fair. Female guerrillas, many who entered the ranks as teenagers and know almost nothing about the fast-paced urban culture that awaits them in Colombia's cities, braided their hair and applied lipstick for the occasion. In this Aug. 11, 2016 photo, rebels of the 49th Front of the Revolutionary Armed Forces of Colombia have makeup applied by fellow rebels as they prepare to perform in a dance at their encampment in the southern jungles of Putumayo, Colombia. The women danced a Cumbia, a popular dance that was started by the African population on the Caribbean coast of Colombia. (AP Photo/Fernando Vergara) From the riverside, a small path festooned with pink and white balloons led to a communal dining area where a hot broth soup awaited. Then the guerrillas swapped their knee-high rubber boots, mandatory in the jungle, for new soccer cleats that many had never worn before. Each front had two five-person teams \\u2014 one male, one female \\u2014 and the players took the field wearing bright jerseys in the colors of popular European clubs like Inter Milan and Barcelona as well as the German national squad and local club Atletico Nacional from Medellin. The play was competitive as a referee kept a close eye on the game clock. The tournament's winners got a soccer ball. Except for the revolutionary anthems blasting though the loud speakers and the stack of assault rifles behind each bench there was little to remind spectators of the horrors of a war that has left 220,000 Colombians dead and more than 5 million displaced. In this Aug. 11, 2016 photo, rebels of the 48th Front of the Revolutionary Armed Forces of Colombia watch a nightly newscast on a television at their encampment in the southern jungles of Putumayo, Colombia. The semi-permanent camp is equipped with with refrigerators, satellite TV and even regular access to the internet for commanders.(AP Photo/Fernando Vergara) TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}"
]