[
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/woman-and-lover-beaten-by-husband/article_95c84b6a-bab9-11e9-bf59-e3ee9ed2ca65.html\", \"TITLE\": \" Woman and lover beaten by husband \", \"DATE\": \"2 hrs ago \", \"CONTENT\": \"{{description}} Email notifications are only sent once a day, and only if there are new matching items. A woman and her lesbian lover were allegedly beaten by the woman\\u2019s husband after she confessed to an extramarital affair last Saturday. The suspect, a 48 year old fisherman, flew into a rage after the confession and allegedly beat his wife at their home in Charlieville. Police said when the wife called her lover and told her of the attack, the lover went to the house and was allegedly battered by the suspect and his 19 year old son. The suspect and his son allegedly ganged up and beat the lover with their fists and a cutlass, police said. The two women \\u2013the 43 year old Charlieville wife and her 47 year old lesbian lover - went to the Chaguanas police station that night and reported the incident to police. Officers took both women to the Chaguanas District Health Facility and they were transferred to the Eric Williams Medical Sciences Complex. The suspect\\u2019s wife was treated for minor injuries and discharged. Police said that the lover was severely beaten on the head and face, and was warded at hospital. She is being treated at hospital for a fractured jaw, perforated eye ball, sliced tongue and dislodged teeth, police said. Police said the husband also went to the Chaguanas District Health Facility on the night of the incident. He allegedly told officers that his wife\\u2019s lover chopped him with a cutlass on the arm and finger. He received three stitches to the finger and five stitches to the arm. Officers took the husband into custody after he was treated and discharged. The 19 year old son left the home after the incident. Police officers are looking for him. Police said the husband faces charges of assault occasioning bodily harm and assault by beating. Police said the lesbian lover could also be charged with assault occasioning bodily harm. PC Backan of Chaguanas CID is investigating. A PIPE FITTER who told the court he found and kept five protected tortoises, has been arrest\\u2026 Public Administration Minister Marlene McDonald and her husband Michael Carew are still bein\\u2026 Police need help in locating 16-year-old Shakira Moore. A woman and her lesbian lover were allegedly beaten by the woman\\u2019s husband after she confess\\u2026 FOURTEEN-year-old Nicholai Hodge died as a result of two stab wounds to the chest, an autops\\u2026 PRIME Minister Dr Keith Rowley, who spoke yesterdat to CNC3 News following the detention of \\u2026 Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/opinion/editorials/we-just-can-t-go-on-this-way/article_403704e0-9790-11e8-81e1-f39e2a79e5af.html\", \"TITLE\": \" We just can\\u2019t go on this way \", \"DATE\": \"Aug 3, 2018 \", \"CONTENT\": \"PHENOMENAL floods and fires in various parts of the world have been attributed to climate change which has also been blamed for record-breaking heatwaves. How climate change may have adversely affected T&T\\u2019s environmental conditions is yet to become part of mainstream national conversation here. This is an area of vital national safety and security about which we have been blatantly delinquent as a nation, both at the level of the authorities nationally and at the local government level. As a people we have severely neglected our responsibility to address what for us ought to have been a priority. Seasons come and seasons go, we suffer the same fate each time a severe weather system strikes, with flooding and the costly aftermath of having to clean up, of the authorities having to find alternative housing for those residents who continue to be badly affected. We lose untold man-hours in lost productivity as families and, in too many cases, entire communities spend days, often weeks, having to dig out from under mud and debris, and then to get their homes and other critical aspects of their physical environment back in working order. In Port of Spain, as an example, dislocation and the inconvenience caused after each heavy downpour are all too common. Just a few weeks ago, after a relatively short and heavy downpour, authorities in the capital city were stumped for an effective response. The perennial lament about the need to fix the drainage problems in the city was repeated, with little or no discernible effort to begin the work necessary to make the desired difference. The mayor trotted out the well-worn declaration that there has to be a programme for the clearing of drains. He reminded us about the other measures that must form part of the larger agenda for making the city less vulnerable in the face of what we have come to accept as bad weather days. The city continues to come up short in terms of even the most basic arrangements to minimise weather-related dislocations and disruptions. And this is only in the capital. In the low-lying areas in South and Central Trinidad, where communities continue to spring up in highly unplanned fashion, with less and less evidence of any attempt at regulation, these problems and challenges are magnified since they affect many thousands of people where they live. We in T&T are facing our share of weather-related challenges, exacerbated by the effects of climate change. We accept, also, that such natural phenomena are forcing adjustments in attempts at effective management of the problem in countries more adept at addressing them than we have shown ourselves to be. We cannot continue to go on this way, lurching from year to year, season to season, generally picking up the pieces after each episode, with no evidence of making real progress. But equally important, householders and the general population should heed the obvious signs of worsening threats from natural conditions, and respond accordingly by avoiding heedless dumping of garbage in drainage systems, among other abuses. IN yet another incident which has had the effect of piling \\u00adembarrassment upon embarrassment for the authorities, a convict walked out of the Golden Grove facility in Arouca on Thursday, and was on the run up to last night. THE West Indies has had a phenomenal number of exceptional cricketers in its history. The captains have been mostly \\u00admiddling. I restricted the playbooks to those of Frank Worrell, Richie Benaud and Mike Brearley simply because they were known as thinking men; able in both the technical and \\u201cman-management\\u201d aspects of the game. International Youth Day is approaching. It is time for the youth of this country to stand up and make their voices heard. It is time to become more \\u00adinvolved in the political process to put an end to the corruption and mismanagement taking place far too often and for too long. Recently, the press \\u00adreported that a mother was in tears after her victim impact statement was read out in court during the trial of the accused for her son\\u2019s murder. She cried out for answers as to the reason the accused, having robbed her son of his \\u00adcellphone, had killed him. While the horizon must seem unrelievedly grim to many citizens, once in a while a few specks of bright light appear to \\u00adrelieve the gloom. And so it was \\u00adrecently when it was announced that the country\\u2019s first drug treatment court was to be established within three months. Regarding the arrest of Minister Marlene McDonald in the ongoing investigation of corruption charges levelled against her, Dr Rowley bought that wholesale. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/launch-of-the-fire-patrols/article_c56f9bcb-5468-5b51-aeaf-06741e947cc2.html\", \"TITLE\": \" Launch of the fire patrols \", \"DATE\": \"Mar 25, 2009 \", \"CONTENT\": \"MAKING WAY: Members of Protectors of the Environment cutting fire traces. MAKING WAY: Members of Protectors of the Environment cutting fire traces. In the year 2007, our forested mountain ranges were smothered in smoke. Dozens of flames licked and climbed 200-year-old trees, walls of fire spread across the underbrush and fire fighters were hard pressed to contain this massacre. April saw the only spell of dry time for that year. Rains had continued into the official dry season of this part of the world and maintained a blanket of moisture in our forests. That was...until a late dry spell enforced itself and wreaked havoc throughout the country. These conditions seem to be duplicating themselves as we have had continuous rain for the year so far. Last weekend saw the Forestry Division launching a late start to their fire patrol season. This season normally begins on the first of March of each year, but based on current weather patterns our dry time is only just beginning. Protectors of the Environment (POE) is a voluntary environmental group consisting of a wide cross section of people from the Lopinot Valley, a valley that is one of the last remaining \\\"green\\\" valleys of the western northern range. POE has battled through years such as this. Members fought long and hard to save the forest cover of their valley as well as that of Caura, Maracas St Joseph and other valleys of the North-West conservancy during crucial years. According to president of POE Peter Barry Rampersad, conditions this year are exactly like those of the year 2007. \\\"After a prolonged period of rain from 2006 into 2007, we saw the most fires this country ever had for one week straight. The dry season lasted for about one month and the valley of Lopinot lost some 375 hectares approximately 926 acres of forest cover. As part of the Forestry Division's team, we fought to control these fires day and night. We recorded 42 fires for that period.\\\" Protectors of the Environment launched its own fire patrol programme this week cutting fire traces in the Ocolo Valley. \\\"We chose to focus on this valley first because it is a water catchment area and the stream here is one of the main tributaries to the Arouca River. We usually have lots of fires in this area and we need to concentrate on saving what's left of our forest cover.\\\" Last year, because of loss of forest and unregulated construction in the hills, we saw repeated flash flooding of low-lying areas. Places that never suffered flooding before were inundated and experienced much damage and loss. According to Rampersad, it is important to prepare for what the dry season brings with it. \\\"The damage wrought during the dry season will affect us in the rainy season.\\\" Since its formation in 1990, POE has been the recipient of three Green Leaf Awards in 2002, 2004 and 2006 for their continuing work in saving the natural environment. A drive up the Lopinot valley showcases several of the group's \\\"Save our Environment\\\" posters, positioned at strategic locations along the route. POE is involved in several ongoing activities such as clearing water sources and is a major resource group to the Forestry Division during the fire season in cutting fire traces, extinguishing fires and all related activities. \\\"We focus on water management. This is important to maintain water quality as well as quantity. Protection of our forest cover is critical to the safety and survival of all habitats and dependent life. We cannot take things for granted and it is important that all active groups get involved in safeguarding our country. \\\"The Agricultural Fires Act is outdated and should be amended from a minor to a major offence. Arising out of a general understanding and concern for the long term effects of damage initiated by forest fires, there should be stiffer penalties to apprehend culprits caught in the act of lighting a fire. We must all work together to save the very precious lungs of the earth that we are blessed with.\\\" TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/pm-no-one-is-above-the-law/article_7b548146-bb0d-11e9-bd37-6b3070eef214.html\", \"TITLE\": \" PM: No one is above the law \", \"DATE\": \"10 hrs ago \", \"CONTENT\": \"AWAITING OUTCOME: Keith Rowley {{description}} Email notifications are only sent once a day, and only if there are new matching items. AWAITING OUTCOME: Keith Rowley THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. The Prime Minister admitted he was saddened by what had happened to McDonald, but reiterated that no one was above the law. And Government Minister Fitzgerald Hinds said he and other colleagues were surprised when they heard the news of McDonald\\u2019s arrest on Thursday. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. TWO videos which show minors engaged in sexual acts with adults are now engaging the attention of police. This was confirmed by Children\\u2019s Authority chairman Hanif Benjamin yesterday. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. A PIPE FITTER who told the court he found and kept five protected turtles, has been arrested\\u2026 Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/t-t-red-cross-appeals-for-donations/article_a37c8d90-15b9-5a62-8ebe-c950245814a9.html\", \"TITLE\": \" T&T Red Cross appeals for donations \", \"DATE\": \"Dec 29, 2013 \", \"CONTENT\": \"THE Trinidad and Tobago Red Cross Society (TTRCS) is making an appeal for donations of nonperishable food items and water, for Caribbean islands who were affected by extreme weather over the Christmas week. On Christmas Eve the islands of St Lucia, St Vincent & the Grenadines and Dominica were battered by heavy rainfall which resulted in widespread devastation. The heavy rains caused widespread flooding and infrastructural damage, leaving many homeless and without a food supply. The TTRCS yesterday issued a release calling for assistance. \\\"In addition, the people of St Lucia were doubly affected when a fire broke out in a warehouse belonging to the St Lucia Red Cross, destroying relief items, including mattresses, intended for distribution to the affected residents,\\\" the release stated. \\\"All donations can be brought to the headquarters of the TTRCS at 7a Fitzblackman Drive, Wrightson Road Extension, Port of Spain. Persons living in San Fernando and environs can take their items to our South Branch located at #2 Ruth Avenue, San Fernando. If you live in Tobago and would like to donate, the Tobago Branch is located at Signal Hill,\\\" the release stated. The TTRCS stated this drive is geared toward the collection of nonperishable items and would not be collecting clothing at this time. \\\"For more information please call the TTRCS at 627-8215, 8128 (PoS) or 652-2024 San Fernando or 639-2781 Tobago,\\\" the release stated.And in Tobago, the Tobago House of Assembly (THA) also issued a call to Help St Vincent Christmas Day flood victims by donating today at the Tobago Emergency Management Agency (TEMA), Fairfield Complex, Scarborough. A press release said those interested should call 660-7489 or 211 or 511 to find out what items are needed, including clearing, cleaning and building supplies; mattresses; toiletries; diapers (adults and babies); cots; water purification tablets; autoclaves; CT machine technician; industrial washing machines; industrial dryers and delivery beds. Clothes or medication should not be donated. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/mopping-up-continues-after-diego-flooding/article_5137bea0-3016-57fd-8ebf-aaf0873a8c18.html\", \"TITLE\": \" Mopping up continues after Diego flooding \", \"DATE\": \"Sep 12, 2013 \", \"CONTENT\": \" Residents of Diego Martin are slowly beginning the arduous task of cleaning up after heavy rains early this morning caused massive flooding through the region. From as early as 2 a.m. the Diego Martin River broke its banks, spewing silt and other debris onto the Diego Martin Highway. Residents living along the river were trapped by the ravaging floodwaters that rose rapidly, ranging from several inches to almost five feet in some areas. Some of the hardest hit places included Simon Street, Hillaire Street, Jean Avenue, Chumamonka Avenue, Savannah, Green Hill Village, Tomato Trace North, Vanderpool Lane and St Lucien Road. The reaction from first responders and emergency crews, including the Office of Disaster Preparedness and Management, the Diego Martin Regional Corporation (DMRC), the Fire Services and the Army, was swift. Member of Parliament for Diego Martin Central Dr Amery Browne and members of his constituency office were out as soon as the rains began, Browne told the Express. DMRC chairman Anthony Sammy, who arrived with Blue Range, Diego Martin resident Justice Minister Emmanuel George, also said he and his crews were out as soon as the rains began, in anticipation of flooding. The men spoke to the Express around 4 a.m., arriving with an emergency crew that had been called to assist the evacuation of a home for the elderly\\u2014GH and DD's Sanctuary\\u2014 in Chumamonka Avenue that had become flooded. The residents were safely moved to higher ground within the compound. Despite first responders' best efforts, the damage to property by floodwaters was severe. The frustration of the Jemmot family\\u2014who live across the road from Sanctuary\\u2014was palpable. The family said it was the third time this year that they had to face floods, but nothing tangible was being done, just politicians talking. The Jemmots did not sleep that night. Having learnt from experience, they began moving valuables to higher ground, from the moment the rain started. Food waters crested at about 2 a.m. to almost a foot above ground. At Sanctuary, manageress Gail Trancoso said she received a phone call from the night nurse at around 1 a.m. in distress about the rising waters. By the time she arrived from her home in Valsayn, she said, the water had already seeped into the building. She and her staff had already begun evacuating some of the 12 affected residents at the home by the time the first arrived, but she was promised assistance to sanitise the area as soon as possible. That was imperative, she said, because there were some residents who have health concerns and require a disinfected environment. \\\"Right now our priority to make sure life and limb are safe, and it is very positive that there have been no reports to the contrary,\\\" Browne said. Sammy said the army had been called in to help clear the highways in time for people to make it to work. George, using his connections from his previous incarnation as Minister of Works and Infrastructure said he had already contacted the Director of Highways to assist with clean-up operations. After leaving Sanctuary, the Express travelled with two emergency volunteers from the area to some of the more distressed areas like Simon Street and Hillaire Street. By then, the floodwaters had mostly subsided from its peak of almost four feet, as evidenced by water marks on walls and fences. In homes however, the water damage was evident, with men bailing out their living spaces with buckets. The flood waters had appeared so quickly, some of the residents were still in various stages of undress as befitting a night of rest, instead having to deal with personal disaster. Driving through the different areas, media crews eventually caught up with Sammy and George again. Sammy said the highway for the most part clear, with some residual silt that was being washed away by Water and Sewerage Authority (WASA) crews. \\\"With this type of rain there is bound to flooding. The river courses are clear. We have a three-month cycle for cleaning the drains under our purview, and I would say about 95 per cent are cleared. The courses are clear, it's the volume (that's the issue),\\\" he said. Sammy added that he had invited three Venezuelan engineers to come to Diego Martin to plan a comprehensive programme to deal with the flooding problem in the area. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/government-cops-respond-to-marlene-mcdonald-s-arrest/article_b8221798-b9e4-11e9-8bc6-afafcc864fa6.html\", \"TITLE\": \" Government, cops respond to Marlene McDonald's arrest \", \"DATE\": \"21 hrs ago \", \"CONTENT\": \"Port of Spain South MP Marlene McDonald FLASHBACK: Newly appointed Minister of Public Utilities Marlene McDonald is congratulated by, from left, close friend Michael Carew, Jean Elder, chairman of the Port of Spain South Constituency, Port of Spain \\u201ccommunity leader\\u201d Cedric (Burkie) Burke, Kenroy Dopwell and Sharon Felix at President's House, St Ann's, after she was sworn in. \\u2013Photo: CURTIS CHASE Minister of Public Administration, Marlene McDonald MP Marelene McDonald's constituency office. {{description}} Email notifications are only sent once a day, and only if there are new matching items. Port of Spain South MP Marlene McDonald Government this afternoon acknowledged for the first time the police investigation involving Public Administration Minister Marlene McDonald. In a brief statement issued at 2:39p.m. newly appointed Communications Minister Donna Cox said: \\\"The Government of the Republic of Trinidad and Tobago (GoRTT) wishes to confirm that a search warrant was executed at the home of Minister of Public Administration the Honourable Marlene McDonald this morning (8 August 2019). However, this is an ongoing police investigation and further information will be provided as it is made available by the Trinidad and Tobago Police Service.\\\" Shortly after the Government's statement, the TTPS issued an statement of its own. The TTPS stated: \\\"Police officers investigating alleged corruption offences have arrested and taken into custody, Government Minister Marlene McDonald and her husband for questioning. They were detained earlier today, Thursday 8th August 2019. Enquiries are ongoing at this time and more information will be provided when it becomes available.\\\" At around dawn today, McDonald and her husband were detained. McDonald, the Member of Parliament for Port of Spain South was taken into police custody. The arrests were made at the couple's home at around 4a.m. by police executing a search warrant. The detention came after police went to the Director of Public Prosecutions Roger Gaspard with an investigation file on Tuesday. McDonald, a Cabinet minister, is being investigated on the allegation of misappropriation of public funds. MP Marelene McDonald's constituency office. The Express was told that McDonald, complained of feeling unwell and was treated at hospital. On June 1, 2017, Prime Minister Dr Keith Rowley advised then President Anthony Carmona to revoke the appointment of McDonald who was then Minister in the Ministry of Public Utilities. Minister of Public Administration, Marlene McDonald McDonald had only recently been sworn in as Minister in the Ministry of Public Utilities after a sixteen month period of absence from the Cabinet. Why was MacDonald fired then? McDonald met with Prime Minister Dr Keith Rowley the morning of her firing, as a result of the controversy caused by her choice of guests attending her swearing-in ceremony at the President's House in St Ann's days before. The commotion surrounds the presence of reputed \\\"community leader\\\" Cedric \\\"Burkie\\\" Burke, who accompanied contractor Kenroy Dopwell to the event. Senior elements of the national security community had expressed alarm at the presence of Burke, who has been engaging their attention. FLASHBACK: Newly appointed Minister of Public Utilities Marlene McDonald is congratulated by, from left, close friend Michael Carew, Jean Elder, chairman of the Port of Spain South Constituency, Port of Spain \\u201ccommunity leader\\u201d Cedric (Burkie) Burke, Kenroy Dopwell and Sharon Felix at President's House, St Ann's, after she was sworn in. \\u2013Photo: CURTIS CHASE Not only was he present, but Burke was introduced by her to the President and posed for pictures with Carmona Carmona. On August 2, Rowley reappointed McDonald, to the post of Minister of Public Administration. Burke was detained on Monday by police who seized his electronic devices including cell phones and laptops. He was questioned and released on Wednesday morning. Reporting by Alexander Bruzual Police need help in locating 16-year-old Shakira Moore. A woman and her lesbian lover were allegedly beaten by the woman\\u2019s husband after she confess\\u2026 FOURTEEN-year-old Nicholai Hodge died as a result of two stab wounds to the chest, an autops\\u2026 PRIME Minister Dr Keith Rowley, who spoke yesterdat to CNC3 News following the detention of \\u2026 Minister in the Ministry of Public Administration and Communications, Marlene Mc Donald spen\\u2026 Government Minister Marlene McDonald was dealt a third strike to her political career yesterday with her arrest by police on corruption allegations. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/election-day-drenching/article_c04fe35f-576e-5106-b544-72be784bf849.html\", \"TITLE\": \" Election Day drenching \", \"DATE\": \"Sep 6, 2015 \", \"CONTENT\": \"Late voters are getting a drenching, as rain showers sweep across the island.At South Quay this afternoon, fire fighters had to help people left stranded by rising waters.The Trinidad and Tobago Meteorological Service has issued a bulletin that inclement weather conditions.Meteorologist Bryan Thomas in a statement said, Over the past few hours, southern parts of Trinidad and to a lesser extent Tobago, have been experiencing cloudy to overcast conditions with periods of rain and showers, some of which have been moderate to heavy in intensity. This rainfall activity is due to a moist and unstable environment associated with the Inter-Tropical Convergence Zone (ITCZ), and an approaching Tropical Wave.Cloudy to overcast conditions with periods of rain and/or showers some of which may be heavy and thundery are forecast for at least the next 8 hours for both Trinidad and Tobago. Rainfall accumulations of 15 to 30 millimetres or greater in some locations, can be expected from this rainfall event. The showery activity can yield moderate to severe street or flash flooding along with strong bursts of gusty winds. Given the current and expected conditions, citizens are advised to be vigilant and cautious as they conduct their activities particularly as they observe the electoral process and to pay attention to the media or visit our website at www.metoffice.gov.tt/forecast for weather forecast updates.Thomas also said that Trinidad and Tobago is not under any Tropical Storm Watch or Warning.And the MET Office will continue to closely monitor this weather event and will issue another bulletin as warranted. The weather forecast by the MET Offices website issued at 10:16 a.m. for the period of this afternoon and this evening for Trinidad and Tobago and the Windward Island was, Intermittent cloudy periods accompanied by light to moderate showers will occur in varying localities for the period until tonight. Some of these showers may become heavy and thundery at times.Street or Flash Flooding is likely in heavy downpours and in the event of a thunder shower, gusty winds can be expected. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/it-s-part-of-a-diabolical-plan/article_a8d6c10c-bb0c-11e9-b669-5bce36994535.html\", \"TITLE\": \" It\\u2019s part of a diabolical plan \", \"DATE\": \"4 hrs ago \", \"CONTENT\": \"\\u2018PM get like a mouse\\u2019: Dr Roodal Moonilal {{description}} Email notifications are only sent once a day, and only if there are new matching items. \\u2018PM get like a mouse\\u2019: Dr Roodal Moonilal Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. There may be a more diabolical plan afoot, of which today is one small piece, and they may be up to no good and up to a \\u00addiabolical plan that may or may not involve us,\\u201d said Moonilal. He was speaking at the United \\u00adNational Congress (UNC) \\u201cpavement meeting\\u201d in the Barataria/San Juan constituency on Thursday\\u2014\\u00adthe same day McDonald and her husband were detained by police for questioning on corruption-related matters. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. TWO videos which show minors engaged in sexual acts with adults are now engaging the attention of police. This was confirmed by Children\\u2019s Authority chairman Hanif Benjamin yesterday. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. A PIPE FITTER who told the court he found and kept five protected turtles, has been arrested\\u2026 Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/normality-and-abnormality/article_134ddb81-09bb-5703-974e-e625eb0ce2f2.html\", \"TITLE\": \" Normality and abnormality \", \"DATE\": \"Dec 3, 2008 \", \"CONTENT\": \"In this publicity file image released by Roadside Attractions, Zachary Quinto, left, and Penn Badgley are shown in a scene from Margin Call. \\u0097Photo: AP In this publicity file image released by Roadside Attractions, Zachary Quinto, left, and Penn Badgley are shown in a scene from Margin Call. \\u0097Photo: AP The words in the headline have many meanings and I can only conclude that when politicians use them in reference to recent weather conditions and their effects they are using them to mean falling within or without some statistical pattern. The normal distribution of the value of any variable parameter is in the form of a bell curve with the top of the bell being a measure of the greatest frequency of a particular value and the ends of the curve the extremes of infrequency. In a normal distribution the value at the highest point of the curve is the mean or average for the particular plot. But there are phenomena that do not conform to a normal distribution and may be skewed to one side or the other, being perfectly normal abnormalities, only in the sense they deviate from a normal distribution in the statistical sense. Exactly what is normality in rainfall in Trinidad and Tobago The meteorologists, being scientists and not politicians, use rainfall figures over time and can give you mean rainfall for a year or a month or a week for that matter, for the entire country or parts of it. They can tell you that on average the wettest months of the year are July and November, demonstrating the patterns from year to year, and will only say that particular weather events in any one year are within the long term averages. What they tell us essentially is that there is no constancy to weather for any day, week, month, year or even part of the country. Reading the account of rainfall in Bush Bush from 1962 to 1969 in Dr Elisha Tikasingh's A History of the Trinidad Regional Virus Laboratory is a good illustration of rainfall variability. Over an eight-year period they recorded an average of 94.48 inches per year with a low of 65.53 in 1962 and a high of 112.57 in 1966, almost a doubling of the low. Perfectly normal. Meteorologists would certainly not claim that a hurricane hitting Trinidad or Tobago is abnormal. Unusual yes, but abnormal no. The unnamed hurricane that swept from Guayaguayare to Cedros in 1933 and Flora which severely damaged Tobago in 1963 were realities, unusual but within the bell curve of hurricane frequency in the Caribbean. Any A-Level student of science will recognise that there are many phenomena in the country and the immediate region that are perfectly normal earthquakes, volcanoes, hurricanes, thunderstorms, lightning strikes, landslides, floods, droughts, bush fires even tsunamis, though fortunately not frequently. They will also know that the main difference between July and November is that in the latter month the water absorptive capacity of any catchment is extremely limited and dependent on vegetative cover. What would really be abnormal in Trinidad is for a glacier to form on the southwestern slope of El Tucuche and ski resort to be established, or for the Hollis Reservoir to dry out completely and become a desert, on which Government constructs a Dubai skyline, complete with casinos. That a landslide occurs, or boulder is dislodged and rolls down a hill in an untouched part of the environment is perfectly normal. If you look up at the north face of El Tucuche you will from time to time see a red gash in the primary forest. A tree dies or high winds tear it down and rain does the rest although in a few years the landslide is re-vegetated naturally. Or the gigantic quartz boulder lodged in the Guanapo Gorge in the 1950s, a gorge where one could in one year swim and wade through unimpeded but have to clamber over in the following year. All perfectly normal natural phenomena. And when politicians use their narrow personal experiences claiming weather \\\"abnormality\\\" it is understandable, given what politics is about. What would be abnormal is for the politician to present data. But surely some readers, and residents of St Ann's, will recall the storm of about 15 years ago and the flooding and the loss of five lives, including that of an infant, or the pictures of central Trinidad in past years. Do the politicians recall the inundation of the Butler Highway that stopped all traffic several years ago and resulted in one fatality (a woman asphyxiated by a defective car air conditioner) And I clearly remember the flooding of the Bamboo Grove Fish Farm in the mid-1950s. The St Joseph River actually crossed the CR Highway! But claiming abnormality becomes a means of shedding blame for failure in meeting responsibilities. It is all very well to chant about policies for hillside development, or, about the need to strengthen enforcement of policies or regulations, but the fact is that the country has an abysmal record in enforcing what existing planning legislation is available to it, and clearly has no serious intention of updating legislation to meet the needs of physical development. And it is not only the current administration. This is not abnormal, simply normal politics. John Spence returns next week TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/the-hills-are-burningdo-something/article_f9f1a432-42ba-51b7-a6d9-35aa136f5d57.html\", \"TITLE\": \" The hills are burningdo something \", \"DATE\": \"Apr 14, 2013 \", \"CONTENT\": \"The hills are burning for months and the Government, particularly the Minister of the Environment and Water Resources, has said or done nothing on this scourge. They will waste precious millions by attempting to appease flood victims when the impact of denuding the hills is felt. A recent weather reporter has warned people to desist from throwing cigarette butts in dry places where that may cause fires. Fact is, most of these fires are caused by people slashing and burning to cultivate crops. Is the deliberate practice of slashing and burning legal I am sure not! Are these persons cultivating legal crops I think not! Is the Government doing anything to stop the denudating I see they are not! The recent fire at Chancellor Hill has awakened some environmentalists from their slumber but eyes are shut again. Where is Dr Kublalsingh The smoke from these fires should be causing him some bother! This is worse than the Highway Re-route fiasco. The Northern Range and the Caroni Plains are on fire: From Blanchisseuse to Chaugaramas are scorched; from Wallerfield to Waterloo (this is only what I surveyed). The hills east of Mount St Benedict are bare; the hills north of the look-out at Lady Young Road are bare (other than the terraces). To make things worse, squatters are constructing structures in these locations. No one is making an impact to arrest the arsonists, squatters and so-called agriculturists. I believe the authority should, use out-of-action soldiers, to dump water (sea water) on the fires using helicopter. It takes 20 minutes to fill up and dump for a distance of 30 kilometres. This is successfully done in the US and Canada. B Kishan Valsayn TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/online_features/travel/top-wildfire-prevention-tips/article_9bff4d02-9b99-53e3-8e15-66beb0a85cfb.html\", \"TITLE\": \" Top wildfire prevention tips \", \"DATE\": \"12 hrs ago \", \"CONTENT\": \"(BPT) - Everyone who loves the outdoors knows the impact humans can have on their environment, and this is especially true when it comes to wildfires. According to researchers from Swansea University's College of Science, wildfires destroy 4% of the Earth\\u2019s surface each year. It has also been estimated that 84% of all wildfires are caused by humans, according to researchers from the University of Colorado. Rising worldwide temperatures and weather extremes have further increased the incidence of fires. From campers who get outside and explore our forests and parks, to backyard chefs tending the open flames of their grills, responsible use of fire is critical to preventing accidents like those seen around the world in recent years. This sense of responsibility and a growing global urgency to help combat the devastating effects of wildfires inspired Zippo to take action. As creator of one of the most famous flames of all time, the iconic American brand is intimately aware of the power of fire. Zippo has teamed up with WOODCHUCK USA, creators of sustainably sourced wood-based products, as part of the BUY ONE. PLANT ONE.\\u00ae program. The partnership means that one tree will be planted for every windproof lighter sold from the Zippo Fight Fire with Fire collection. The program is part of a long-term vision to support reforestation efforts in the aftermath of fires around the globe, beginning this year in Madagascar. As the fourth largest island in the world, Madagascar has had 90% of its original forests destroyed. Reforestation will create habitats for endangered species, help absorb carbon, halt erosion and flooding \\u2014 and bring back healthy farming and fisheries. Lucas Johnson, Senior Brand Manager, Global Marketing at Zippo, states, \\u201cTemperatures are at the highest level on record and wildfires are affecting almost every continent on Earth, but unlike most natural disasters, the majority of wildfires are caused by humans. According to National Geographic, in the U.S. alone there are around 100,000 forest fires each year, clearing up to 9 million acres of land. The Zippo windproof lighter gives people the power of portable fire, but with this comes responsibility.\\u201d For individuals using fire, especially in regions susceptible to wildfires, it\\u2019s vital to follow practical safety measures. Here are some tips to help prevent wildfires: Camping and the outdoors When creating a bonfire, use a pre-made fire pit if available, or make a fire pit cleared of all vegetation with a boundary such as a circle of stones. Remove excess dead leaves or other potentially flammable debris from the area before lighting the fire. Never leave a fire, lantern or cook stove unattended, especially overnight. If the weather is windy, don't start a fire \\u2014 the risk is too high, as the embers can be carried across great distances and risk setting vegetation alight elsewhere. When you're finished with the fire, grill or stove, be sure to douse it thoroughly with water. Stir the coals or ashes to be sure all heat has been extinguished, and smother the campfire with dirt. If you see fire that appears unattended or out of control, call 911 or the local park service right away. In the backyard Check and follow all local ordinances regarding fires, whether for recreation or burning yard waste. Make sure the grill or bonfire is not near or underneath branches or other vegetation, or too close to your home. For a fire pit, clear all grass, dead leaves or other possibly flammable material, and create a clear boundary for the fire using stones or bricks. Consider fire risk when landscaping and maintaining your lawn and garden. Especially if you live in a wildfire-prone region, consult the National Fire Protection Association's (NFPA) Firewise website for practical fire prevention tips such as using fire-resistant plants and creating a defensible zone around your home. Consistently remove dead and dry leaves, pine cones and other plant material that could fuel a fire as part of your regular lawn maintenance. Keep bushes and trees regularly pruned of dead branches. Don't use fire on a windy day, as the risk for fire spreading is too great. If celebrating with fireworks, keep water and/or a fire extinguisher handy and spray down nearby grass and other vegetation before lighting fireworks. Be sure to thoroughly douse used fireworks with water. Don't use fireworks at all if the weather is windy or if your area is under a Red Flag Warning. Making a difference Following these precautions to use fire responsibly is one way everyone can help prevent devastating wildfires. Every individual has the power to make a positive impact. To learn more about how Zippo is making a difference and to support Zippo\\u2019s efforts to help counter the effects of deforestation caused by wildfires, check out the Zippo Fight Fire with Fire collection. Take the time to learn how you can contribute to the fight against wildfires in your area and beyond, to help protect the planet for generations to come. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/marlene-grilled-for-eight-hours/article_f805a324-bb0c-11e9-8663-5fcd22e380e6.html\", \"TITLE\": \" ...Marlene grilled for eight hours \", \"DATE\": \"7 hrs ago \", \"CONTENT\": \"VISITORS: Arima Mayor Lisa Morris-Julian and Laventille East/Morvant MP Adrian Leonce on Thursday night at the St Joseph Police Station, where they visited Minister of Public Administration Marlene McDonald, who was being held for questioning. \\u2014Photo: JERMAINE CRUICKSHANK {{description}} Email notifications are only sent once a day, and only if there are new matching items. VISITORS: Arima Mayor Lisa Morris-Julian and Laventille East/Morvant MP Adrian Leonce on Thursday night at the St Joseph Police Station, where they visited Minister of Public Administration Marlene McDonald, who was being held for questioning. \\u2014Photo: JERMAINE CRUICKSHANK MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. McDonald and her husband were brought to the Professional Standards Bureau office at Henry Street, Port of Spain, at about 8 a.m. yesterday. Shortly after, Pamela Elder SC and attorney Owen Hinds Jr arrived at the PSB office and went inside. Elder, who is representing McDonald and her husband Michael Carew, remained inside the building until about 2.15 p.m. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. TWO videos which show minors engaged in sexual acts with adults are now engaging the attention of police. This was confirmed by Children\\u2019s Authority chairman Hanif Benjamin yesterday. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. A PIPE FITTER who told the court he found and kept five protected turtles, has been arrested\\u2026 Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/the-floods-are-here/article_f48d8c4e-0a78-5102-a435-b421c169e917.html\", \"TITLE\": \" The floods are here \", \"DATE\": \"Jun 1, 2016 \", \"CONTENT\": \"Heavy rainfall and strong winds swept across Trinidad on Wednesday night, causing flash flooding, landslides, damaging roofs, and taking down trees in north, west and east Trinidad.According to the Meteorological Office of Trinidad and Tobago (Met Office), the weather being experienced on Wednesday is typical of the rainy season and attributed to the Inter-Tropical Convergence Zone (ITCZ). Meteorologist III Saide Shakeer in an email said: the winds in the lower levels of the atmosphere are relatively strong and as such, the showers/thunder showers that developed today moved quickly across T&T and some were also accompanied by gusty winds. Areas with heavier rainfall experienced poor visibility and in other areas, street/flash flooding occurred but this was very isolated. With the improving weather conditions, such flooding has already begun to subside. Tonight (Wednesday night) will experience few periods of light rain or showers.Shakeer also said that June 1 was the start of the hurricane season which is from June to November. Roofs blown offChief executive officer of the Office Disaster Preparedness and Management (ODPM) Dr. Stephen Ramroop said there were several reports in Sangre Grande, Cocorite, Diego Martin and Port of Spain of roofs being blown off and landslides. Ramroop said the Couva/Tabaquite/Talparo Regional Corporation reported fallen trees along the southbound lane of the Solomon Hochoy Highway which was cleared by the police and regional corporation workers. He said: We have had reports. We have had reports in Port of Spain, in Cocorite, houses roofs were blown off in Sangre Grand and Cocorite. There were landslides along the north coast roads, a landslide on the Lady Young, fallen trees on the southbound land of the highway just about Freeport which was cleared by the fire services and the Couva/Tabaquite/Talparo Regional Corporation. We had in Tabaquite some flooding and fallen trees. We didnt have too much in the south so much as we had in the East-West corridor. We had some in Diego Martin of street flooding and tress being blown off. So yesterday we had heavy winds and heavy rains in certain areas and we had landslides which is the start of the rainy season. Ramroop said that with the declaration of the rainy season last month by the Met Office, all the Municipal Corporations Disaster Management Units were ready to deal with any disaster occurrences.However, he asked that citizens to become responsible for their own environment.He said: We want appeal to the public, dont depend on the agencies so much. People have to understand they are living in a country that is prone to rains and flooding and they should take the necessary precautions and the agencies cant do everything for them. An official at the San Fernando Disaster Management Unit said that the team stands ready to deal with any occurrences of natural disasters and that there are things in place for it.Officials at the Penal/Debe Regional Corporation expressed similar views on their readiness for the rainy season.Last week Friday the ODPM conducted a PrepareAthon Booth & Walkabout in Port of Spain.According to the ODPM the Prepare-A-thon forms an integral part of the ODPMs Communities Organised and Ready for Emergencies (C.O.R.E.) Programme the theme of which for this year is Community Resilience.The ODPM believes that awareness and education is a key component. During the event members of the public were given hurricane safety information and were encouraged to prepare themselves and their families by making a Family Emergency Plan and packing an Emergency Preparedness Kit.Ramroop said the awareness programme will continued through the country in the coming weeks. Debe Residents complainAs a result of the heavy rains experienced yesterday, eight Debe residents homes were flooded.Pundit Balmesh Sieunarine said around 11:30 p.m. more than two feet of waters came inside his home and that of his neighbours. He said flooding has been a recurring problem for the residents at Chester Street, Debe due to blocked drains.Sieunarine said, we have been trying to get these drainage problems solved for the longest while and it is not being looked into. Two and a half feet water inside my house by the way from 11:30pm till present. And its not going anywhere anytime soon because there is no where for the water to run.He also said that a private land developer recently cleared land nearby which made matters worst.He said health officers from the Penal/Debe Regional Corporation visited last week and assured him that the problem will be looked into. Sieunarine said that waters have become a breeding ground for caimans as residents have caught the reptile and released in into rivers nearby. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/major-pain-for-citizens/article_72daf343-db55-5289-a2d1-693439cc5229.html\", \"TITLE\": \" Major pain for citizens \", \"DATE\": \"Oct 5, 2016 \", \"CONTENT\": \"AN unassuming, sunny day in Trinidad and Tobago took a shocking climatic turn around midday yesterday that left much of Trinidad under flood for hours, communities in the south without electricity and five fire officers recovering from electrocution. Reports from around the country are that close to noon, citizens noticed the seemingly sudden appearance of dark, heavy clouds. Many on social media said they noted the change of weather and prepared for a rainy afternoon. None however anticipated the extent to which the showers and winds that followed would have affected the country\\u2014including a lightning storm that knocked out most of South Trinidad's power supply, up to a reported five feet of flood water in some areas and the near-deaths of five fire officers as they tried to rescue commuters stranded on the Priority Bus Route. A tree was also reported fallen near President's House in St Ann's but no injuries were reported. The Trinidad and Tobago Meteorological Office, in a noon bulletin, advised of more showers to come and warned those in flood-prone areas to stay alert. Sunny periods were to be interrupted by \\u201clight to moderate showers in varying localities\\u201d, meteorologist Jean-Marc Rampersad stated, adding: \\u201cThere is a 60 per cent chance that one or two of these showers could become heavy and/or thundery in a few confined areas.\\u201d Patchy cloudiness, gusty winds and heavy downpours/and or thunder showers were also expected into last night, with the odd shower. The conditions were attributed to a number of factors, including high morning temperatures meeting cooler sea breezes in the North and the eventual passage of a nearby tropical wave, whose effects were felt in Tobago earlier in the day. Maxi-taxi drama In Port of Spain, the first set of showers just after midday caused flash flooding almost immediately, putting South Quay, parts of Independence Square and other sections downtown under water. As has become the norm, the filthy water was strewn with garbage\\u2014mostly styrofoam food boxes and plastic bottles\\u2014as it rotated downtown. There was some power loss in the north as well, with parts of Cascade, San Juan, St James and Malabar going dark for just over an hour. But what was a thorn in the side of the capital city was a major pain in East Trinidad. In San Juan, some homeowners scampered to secure household goods as the flood rose, while those in vehicles had to navigate nearly a foot of water in lower lying areas. In neighbouring Barataria the situation was worse, with up to four feet of water reported in some areas. Photographs and footage shared on social media showed the roundabout submerged and cars stranded in the car park at Maritime Plaza. On the PBR, a different drama unfolded when a maxi-taxi full of commuters became stranded near Morvant Junction. Fire officers responded quickly but within minutes found themselves needing help when a metal ladder they were using touched an exposed high-tension wire, giving the men a jolt that sent them running and falling. Four of the officers were later treated and discharged but one was hospitalised for more serious injuries. The incident was captured on video via a cellphone by one citizen and made the rounds on Facebook yesterday. Further East, Arima got its share, as did parts of Maloney and Arouca. 'Fantastic' lightning In Central, flooding and high winds were reported in Charlieville, Cunupia and Couva. Oropouche reported water in some low-lying areas, where farmers were also concerned about crop-loss. San Fernando and environs claimed it was worse in the south, with citizens insisting that what they experienced was \\u201cheavy, heavy, heavy\\u201d rain. Out of La Romaine, one social media user posted a photo than many found unbelievable\\u2014flood waters so high that only the very tops of the cars were visible. In the midst of the worrying weather, though, south citizens witnessed a fascinating phenomenon. A \\u201clightning show\\u201d that some said went on for close to half an hour was described on social media as \\u201cmesmerising\\u201d and \\u201cfantastic\\u201d. The downside of an otherwise beautiful display was a power outage that lasted some two hours in most of the South. Head of corporate communications at the Trinidad and Tobago Electricity Commission (T&TEC), Annabelle Brasnell, said the electricity supply had been knocked out in La Romaine, Corinth, parts of Princes Town and Guapo. Parts of Carapo also lost power for a short while. Brasnell said outages as a result of the weather were not uncommon. \\u201cWe have two instances of burst wires reported in south and north,\\u201d she said. Don't panic Head of the Office of Disaster Preparedness and Management (ODPM), Dr Stephen Ramroop told the Express all regional corporations were been placed on alert but no missions associated with the bad weather were known to have been launched up to late yesterday. He said the ground was also covered by the Trinidad and Tobago Police Service, while the National Operations Centre (NOC) was monitoring. He advised that citizens take precaution but get out of flooded areas as soon as possible. \\u201cDon't panic. It's just rain and heavy showers. Keep listening out for alerts. This is just a typically bad day in the rainy season,\\u201d Ramroop said. \\u2014With reporting by Sue-Ann Wayow TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/green-screen-the-climate-change-film-tour/article_2ccef3b5-44aa-5520-a359-3398dbdfb532.html\", \"TITLE\": \" Green Screen 2013: the Climate Change Film Tour \", \"DATE\": \"Oct 19, 2013 \", \"CONTENT\": \" The Green Screen, the annual Environmental Film Series, has returned. Now in its third year, Green Screen will run from October 31 to November 13. This years programme, the Climate Change Tour, boasts more local content. And with the focus on climate change, locally and internationally, the main message of this years selection of critically acclaimed movies is Seeing is Believing. Green Screen will be launched on October 31 with a fundraising cocktail reception at Digicel IMAX in Port of Spain, where the film Chasing Ice will be screened. The documentary dramatically shows the effects of climate change on glaciers through spectacular time-lapse images. After the screening, there will be an after-party at Drink! Lounge & Bistro on Rosalino St, Woodbrook. The series will continue with some eight feature films including five local ones highlighting various environmental issues, such as Nothing Like Chocolate, Burning in the Sun, A Fierce Green Fire and Bitter Seeds. Local films include Earth Water Woman, and The Amerindians, as well as A Sea Change. Sustain T&T, the organisation that produces Green Screen, made the film A Sea Change earlier this year with the support of the UNDPS GEF SGP Programme. The documentary focuses on the effects of climate change on the lives and livelihoods of residents of Diego Martin, Mayaro and Toco. Screenings, free to the public, will take place at the National Museum, at Medulla Art Gallery and two venues at UWI, St Augustine: the Film Programme Studio on Carmody Road, and the Institute of Critical Thinking. There will be additional special screenings for school groups. Green Screens sponsors and partners include The German Embassy Port of Spain, Medulla Art Gallery, the trinidad+tobago film festival, the Global Environment Fund Small Grants Programme UNDP, Drink! Lounge & Bistro and Digicel IMAX. For further updates and information, like Sustain T&T Sustainable Living In Trinidad and Tobago on Facebook, at facebook.com/SustainTT; or, call 385-1158. films Features Chasing Ice (75 mins): One mans mission to change the tide of history by gathering undeniable evidence of climate change. Using time-lapse cameras, his videos compress years into seconds and capture ancient mountains of ice in motion as they disappear at a breathtaking rate. A Fierce Green Fire: The Battle for a Living Planet (101 mins): This film is the first big-picture exploration of the environmental movement grassroots and global activism spanning 50 years from the early days of conservation to the latest challenge of climate change. Dirt! The Movie (86 mins): An insightful look at the glorious but unappreciated--material beneath our feet. The film takes a humorous yet substantial look into the history and current state of the living organic matter that we come from and will later return to, yet most of us know so little about it. Bitter Seeds (88 mins): Bitter Seeds raises questions about the human cost of genetically-modified agriculture, focusing on India, where every 30 minutes a farmer kills himself in despair. The film looks at a farmer and his familys struggle. Nothing Like Chocolate (63 mins): The film tells the compelling stories of the late anarchist chocolate-maker, Mott Green, founder of the Grenada Chocolate Company Co-operative and independent cocoa farmer, whose tiny factory turns out luscious creations that are organic and ethical. Biophilic Design: The Architecture of Life (60 mins): Discover green buildings that connect people and nature hospitals where patients heal faster, schools where childrens test scores are higher, offices where workers are more productive, and families thrive. Burning In the Sun (82 mins): Charismatic 26-year-old Daniel Dembls journey to bring electricity to rural communities in Mali, 99 per cent of which live without power. His business builds solar panels from recycled materials. The Amerindians (40 mins): In The Amerindians, Tracey Assing examines the way the story of indigenous people has been recorded. The structure of the Santa Rosa Carib Community, its politics and belief system are also explored as Assing makes a personal exploration of her Carib roots. Short Films Earth, Water, Woman (22 mins): The story of the roots of the Fondes Amandes Community Reforestation Project in the hills of St Anns, Trinidad. Founded by the charismatic Rastafarian woman Akilah Jaramogi, along with her late husband Tecumah over 30 years ago, the FACRP is a model for agro-forestry in the region. The Story of Stuff (21 mins): The Story of Stuff finally opens the door to a serious cultural dialogue about the costs of consumption, in particular, how this is affecting our earths natural environment. Floodprint (20 mins): Floodprint highlights flood damage in Trinidad through the stories of a farmers damaged crops, a young boys near-death experience and a womans damaged home. The film looks at how our own actions shape our circumstances. A Sea Change (36 mins): In Diego Martin, Mayaro and Toco, residents, fishermen and farmers are being affected by changing weather patterns. There is less food to pick, less fish to catch and more flooding. The film examines the causes and what these communities are doing to adapt. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}"
]