[
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/murdered-doctor-s-wife-slams-inadequate-health-care/article_27ddb052-7abd-5ce8-bc07-08190dbf793a.html\", \"TITLE\": \" Murdered doctor's wife slams 'inadequate health care' \", \"DATE\": \"Aug 3, 2010 \", \"CONTENT\": \"Juliette Mahajan, the wife of murdered medical doctor Avinash Mahajan, yesterday blamed the inadequate health care services for her husband's death. Mahajan said the Couva District Hospital, where her husband was being treated when he died, was not equipped for emergency cases. \\\"The district hospital simply did not have the equipment to deal with the emergency. \\\"I believe he would have been alive if they had the equipment to deal with my husband,\\\" she said. Mahajan said her husband was assisting workers at the family-owned service station at Southern Main Road, California, when a lone gunman entered and shot him three times in the back. The 58-year-old Indian national migrated to Trinidad and Tobago 35 years ago. He lived at Camden Road, Couva with his wife and their 17-year-old son, Akash. Mahajan's killer walked into the service station pretending to be a customer around 3.40 p.m. on Tuesday and the suspect followed Mahajan into the office where he pulled out a gun. Mahajan turned to run away and was shot in the back. His killer then searched Mahajan's pockets and escaped with a quantity of cash. Police continued the search for the suspect last evening. An employee described Mahajan as a loving, caring person. An autopsy would be performed on his body this morning. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/cops-hunt-doctor-s-killer/article_97e427c6-0aa7-561c-9785-62212bca388e.html\", \"TITLE\": \" Cops hunt doctor's killer \", \"DATE\": \"Aug 4, 2010 \", \"CONTENT\": \"Dr Avinash Mahajan, who was shot and killed during a robbery at his service station, was wounded in the left lung. His bowels were also ruptured. An autopsy performed at the Forensic Science Centre at St James yesterday stated that Mahajan died from haemorrhaging caused by the gunshot wounds. Mahajan, 58, was shot on Tuesday afternoon by a man who entered the gas station at Southern Main Road, California pretending to be a customer. The gunman followed Mahajan into an office and shot him three times in the back. The suspect then searched Mahajan's pockets and ran off with the bleeding man's money. Mahajan, of Camden Road, Couva, died while being treated at the Couva District Hospital. His wife, Juliet, blamed the inadequate health care service for her husband's death. She said the hospital was not equipped to deal with emergency cases. Mahajan will be cremated on Saturday, following a service at his home. Police continued the search yesterday for the killer who was dressed in a red T-shirt and three-quarter pants. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/doctors-to-get-panic-button/article_352d8fc2-f629-50fd-a98a-3ed70e78d260.html\", \"TITLE\": \" Doctors to get PANIC button \", \"DATE\": \"May 24, 2015 \", \"CONTENT\": \"A PANIC button is expected to be installed soon at the Emergency Department of the San Fernando General Hospital. This is just one of the measures the hospital will be undertaking to protect its staff from irate patients and relatives. Last Friday, hospital officials met with the Medical Professionals Association of Trinidad and Tobago (MPATT) to discuss safety measures after a member of staff was attacked at the Port of Spain General Hospital and a doctor at the San Fernando Teaching Hospital was slapped. Chief executive officer of the South West Regional Health Authority (SWRHA) Anil Gosine said panic buttons will be installed in various parts of the hospital deemed \\\"hotspots\\\", starting with the Emergency Department. He said: \\\"We will start with the hotspots in some of the areas. We have already implemented panic buttons in the psychiatry department. These panic buttons when pressed will sound an alarm so that security can attend to the situation.\\\" Gosine said he did not want to reveal all the departments termed \\\"hotpsots.\\\" He added: \\\"We looked at putting up signs now to protect our staff. We do have signs to protect the staff but we need to modify it. We need to have a system in place so that in the long term if some-one continues to come to the San Fernando General Hospital and continually pose a threat to the staff, we will find ways of having that person evicted.\\\" The signs would be at every ward stating that abuse by patients or relatives would not be tolerated. Gosine said a meeting was also held with the San Fernando Doctors' Association and some measures raised by the association were discussed. Some were already implemented he said. Some of those measures already implemented were having security escort staff to their vehicles at night, there was a hotline number for staff to call in case of an emergency and he said security personnel were increased in areas \\\"that we expect may have disputes with patients and patients' relatives.\\\" Gosine said discussions will be ongoing with the San Fernando Doctors' Association. ? TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/bad-attitude-from-doctors/article_308337e0-1658-53a1-9749-9ab3a0871e8d.html\", \"TITLE\": \" Bad attitude from doctors \", \"DATE\": \"Mar 20, 2011 \", \"CONTENT\": \"Why do doctors in T&T believe they are beyond investigation For far too long we have heard the horror stories coming out of our health institutions and now that a government finally has the courage to investigate complaints, the doctors are up in arms. Hearing comments on the news after a meeting of doctors at the San Fernando hospital over suspension letters, one had to believe there should be no questions asked, investigations or disciplinary action taken against themperiod. Ridiculous! Congrats to the Minister of Health and the SWRHA for what should have been done a long time ago. C Peters via e-mail TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/tha-health-secretary-launches-probe-into-hiring-of-new-doctor/article_38f89b65-f7a9-521c-805d-f7a8df5d852a.html\", \"TITLE\": \" THA Health Secretary launches probe into hiring of new doctor \", \"DATE\": \"Mar 1, 2016 \", \"CONTENT\": \"TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/woman-and-lover-beaten-by-husband/article_95c84b6a-bab9-11e9-bf59-e3ee9ed2ca65.html\", \"TITLE\": \" Woman and lover beaten by husband \", \"DATE\": \"2 hrs ago \", \"CONTENT\": \"{{description}} Email notifications are only sent once a day, and only if there are new matching items. A woman and her lesbian lover were allegedly beaten by the woman\\u2019s husband after she confessed to an extramarital affair last Saturday. The suspect, a 48 year old fisherman, flew into a rage after the confession and allegedly beat his wife at their home in Charlieville. Police said when the wife called her lover and told her of the attack, the lover went to the house and was allegedly battered by the suspect and his 19 year old son. The suspect and his son allegedly ganged up and beat the lover with their fists and a cutlass, police said. The two women \\u2013the 43 year old Charlieville wife and her 47 year old lesbian lover - went to the Chaguanas police station that night and reported the incident to police. Officers took both women to the Chaguanas District Health Facility and they were transferred to the Eric Williams Medical Sciences Complex. The suspect\\u2019s wife was treated for minor injuries and discharged. Police said that the lover was severely beaten on the head and face, and was warded at hospital. She is being treated at hospital for a fractured jaw, perforated eye ball, sliced tongue and dislodged teeth, police said. Police said the husband also went to the Chaguanas District Health Facility on the night of the incident. He allegedly told officers that his wife\\u2019s lover chopped him with a cutlass on the arm and finger. He received three stitches to the finger and five stitches to the arm. Officers took the husband into custody after he was treated and discharged. The 19 year old son left the home after the incident. Police officers are looking for him. Police said the husband faces charges of assault occasioning bodily harm and assault by beating. Police said the lesbian lover could also be charged with assault occasioning bodily harm. PC Backan of Chaguanas CID is investigating. A PIPE FITTER who told the court he found and kept five protected tortoises, has been arrest\\u2026 Public Administration Minister Marlene McDonald and her husband Michael Carew are still bein\\u2026 Police need help in locating 16-year-old Shakira Moore. A woman and her lesbian lover were allegedly beaten by the woman\\u2019s husband after she confess\\u2026 FOURTEEN-year-old Nicholai Hodge died as a result of two stab wounds to the chest, an autops\\u2026 PRIME Minister Dr Keith Rowley, who spoke yesterdat to CNC3 News following the detention of \\u2026 Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/it-s-part-of-a-diabolical-plan/article_a8d6c10c-bb0c-11e9-b669-5bce36994535.html\", \"TITLE\": \" It\\u2019s part of a diabolical plan \", \"DATE\": \"4 hrs ago \", \"CONTENT\": \"\\u2018PM get like a mouse\\u2019: Dr Roodal Moonilal {{description}} Email notifications are only sent once a day, and only if there are new matching items. \\u2018PM get like a mouse\\u2019: Dr Roodal Moonilal Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. There may be a more diabolical plan afoot, of which today is one small piece, and they may be up to no good and up to a \\u00addiabolical plan that may or may not involve us,\\u201d said Moonilal. He was speaking at the United \\u00adNational Congress (UNC) \\u201cpavement meeting\\u201d in the Barataria/San Juan constituency on Thursday\\u2014\\u00adthe same day McDonald and her husband were detained by police for questioning on corruption-related matters. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. TWO videos which show minors engaged in sexual acts with adults are now engaging the attention of police. This was confirmed by Children\\u2019s Authority chairman Hanif Benjamin yesterday. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. A PIPE FITTER who told the court he found and kept five protected turtles, has been arrested\\u2026 Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/doctors-we-are-not-to-blame/article_54b7eb9c-2d75-5958-bb72-e562153b8ca7.html\", \"TITLE\": \" Doctors:We are not to blame \", \"DATE\": \"Jun 17, 2009 \", \"CONTENT\": \"stalled: Equipment on the compound at Golconda, Village, San Fernando, where construction of the highway from San Fernando to Point Fortin is to begin. \\u0097Photo: TREVOR WATSON stalled: Equipment on the compound at Golconda, Village, San Fernando, where construction of the highway from San Fernando to Point Fortin is to begin. \\u0097Photo: TREVOR WATSON Doctors at the San Fernando General Hospital said yesterday they were not to blame for the death of Judith Regis, who died last Friday, hours after delivering her baby by Caesarean Section. It appears that Regis developed a pulmonary embolism that was not directly related to the delivery of her baby. And Regis allowed a C-Section to be performed, according to Dr Eric Richards, the consultant who managed Regis while she was a patient at the hospital. The funeral for Regis was held yesterday at the Torrib Tabaquite Seventh Day Adventist Church, New Grant. It is the church in which Chief Magistrate Sherman McNicolls is an elder. Regis's six-day-old baby boy, Isiah, was not taken to the church. Pastor Andy Manzano said of her death, \\\"The pieces surrounding her death do not fit. In our minds, we are trying to make sense of this.\\\" Regis, a 38-year-old pre-school teacher, appeared well after the baby's delivery last Friday, but suddenly died. Her husband, Patrick Regis, blamed doctors, and refused to allow an autopsy to be done at the hospital's mortuary. A forensic examination was done on Tuesday. Regis said his wife died from blood clots. Yesterday, a press briefing was held by chief executive officer of the South West Regional Health Authority Mike Harris. Harris said he had not received a copy of the death certificate, \\\"but from preliminary investigations carried out by the Obstetrics and Gynaecology Department of the hospital, it was revealed that an agreement by the patient and consultant was made to have the baby delivered by C-Section and through the procedure she was monitored by hospital staff\\\". Richards said \\\"the baby's welfare was being compromised and there were no complications during the C procedure\\\". At the funeral, Regis's kindergarten pupils sang for a final time for her. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/nigerian-doctor-family-quarantined/article_6b44c1c6-ea79-5522-afbf-021b707c454c.html\", \"TITLE\": \" Nigerian doctor, family quarantined \", \"DATE\": \"Oct 23, 2014 \", \"CONTENT\": \" TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/arima-hospital-to-get-m-health-facility/article_ef3b2774-698b-5aa3-a003-81176f226b55.html\", \"TITLE\": \" Arima hospital to get $30m health facility \", \"DATE\": \"Mar 14, 2015 \", \"CONTENT\": \"Arima is expected to benefit from the state-of-the-art Arima Diagnostic Clinic (ADC) and Research Institute at 25-28 Hollis Avenue, close to Arima Velodrome. The $30 million facility will boast two operating theatres, inpatient facilities, a 24-hour accident and emergency specialist clinic, a healthy eating restaurant and obstetric services. Rev Dr Margaret Elcock, president/CEO of the Family Focus Broadcasting Network and ISAAC 98.1, paid kudos to hospital CEO Helen Alleyne and her family at the launch and dinner celebration at the banquet hall of Eastern Credit Union, Sorzano Street, Arima, on Saturday night. Alleyne was also hailed as a pioneer, since she started the first school of ultrasound sciences and several speakers who brought greetings called for Alleyne to be conferred with a national award during Independence celebrations on August 31. Elcock labelled Alleyne a visionary, in the presence of her spouse/managing director Benjamin Alleyne and children Doctor of Engineering (PhD) Ian, medical doctor Ron, hospital manager Megan and University of Trinidad and Tobago (UTT) biomedical engineering student Okon. The matriarch of the family, Alleynes 90-year-old mother Olive Caton, whom she described as the best business adviser, also attended the vent. They were joined by Hamid OBrien, adviser to Minister of Health Dr Fuad Khan, Justice Lloyd Elcock, Accreditation Council of Trinidad and Tobago (ACTT) executive director Michael Bradshaw, chairperson Nicole Larsen, Newsday editor-in-chief Jones P Madeira, medical doctors Spencer Perkins and Daniel Otajele and Bishop Andrew John, who said the commissioning prayer. Another highlight of the elegant evening was the presentation of awards to deserving employees. The ADC is a vision whose time has come. I am deeply moved because I am witnessing the fulfilment of the vision of Helen, one of my dearest friends. When she shared her dream, we would laugh a lot about these crazy ideas. God opened incredible doors that only he could. Her dreams came to pass, said Elcock. As a visionary, you learn certain principles, people will always be there waiting to help you. If you have no dream or if you do not begin to act on it, the people who are supposed to help you wont know where to find you, she added. Slipping into her motivational speaker role, Elcock imparted kernels of wisdom to the audience. Write your vision down. Make it plain and articulate it. Be careful whom you allow to influence you. Your vision can either be encouraged or destroyed by others. People have the potential to create your environment. Your environment determines your mindset, your mindset determines your future. Choose your friends wisely. OBrien said it was important to form public and private partnerships to assist the population. He also spoke about the dialysis programme which Minister Khan had unveiled to improve time and reduce costs. He also said health tourism can only be successful if Trinidad and Tobago can provide quality health care institutions. He said the Ministry had signed a memorandum of understanding with COSTAAT/Skills Training to develop a nursing programme and arrest the critical demand for nurses. OBrien lauded Alleyne for having the vision to establish a diagnostic centre. During her remarks, Alleyne, a radiographer, said the clinic was born out of a passion for providing health care services, including ultrasound, X-rays and mammograms. I was acutely aware of the absence of the imaging sciences, there was no medical science. Little did I know at that time the provision of these basic services would lead to opportunities for providing full medical services, she said. Alleyne said her family has learnt to rely upon Gods unchanging love and the grace so freely given through faith in Jesus Christ. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/t-t-short-of-doctors/article_f2459538-7ca8-514a-b6fa-04a4b6f3e7bf.html\", \"TITLE\": \" 'T&T short of doctors' \", \"DATE\": \"Oct 19, 2010 \", \"CONTENT\": \"There are only six nuerosurgeons working in the public health system and the country is short of 240 doctors, Health Minister Therese Baptiste-Cornelis said. The Ministry, she said, had put in a request for local doctors to return to the system, but received only 11 applications. She said \\\"bringing in doctors from another country was not a simple process\\\" since all foreign medical workers must be able to speak English. The Minister said \\\"the current deficit of doctors exists all over the world and neurosurgery is a very highly skilled area and, again, what I have heard is that the salaries we offer are not competitive\\\". Baptiste-Cornelis said the salary of doctors \\\"is not a simple process\\\" and Government did not have unlimited funds. \\\"We want the best doctors, but they have to be affordable.\\\" She said invitations were sent to other countries, asking for assistance. Baptiste-Cornelis spoke with reporters on Monday after the launch of the Electronic Birth Registration System at the San Fernando General Hospital. She also said the Ministry got the approval of Cabinet to decentralise the pharmaceutical warehouse, which will now be located in east, central and south Trinidad and Tobago, so \\\"there will be a smoother transition of drugs\\\". The warehouse is located in Chaguaramas. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/doctors-at-sea/article_73930537-de82-5d46-a5ff-a52a68d35b08.html\", \"TITLE\": \" Doctors at sea \", \"DATE\": \"Mar 5, 2015 \", \"CONTENT\": \"A doctor I know insists that sex is perfectly all right after a heart attack, provided that you close the ambulance door. I would recommend him if you are at death's door. He will definitely pull you through. And if you have problems with your heartbeat he will soon put a stop to it. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/crackdown-on-doctors/article_aa965966-1d9b-56bd-9f1e-1c2b26b9989a.html\", \"TITLE\": \" CRACKDOWN ON DOCTORS* \", \"DATE\": \"Nov 28, 2015 \", \"CONTENT\": \"{{description}} Email notifications are only sent once a day, and only if there are new matching items. Specialist doctors have been ordered to be present at the nation's hospitals in an effort to prevent the deaths of pregnant women and babies. This instruction is contained in a report, for immediate implementation, which was circulated to all of the public hospitals on November 23. The recommendations to address issues related to maternal and perinatal morbidity and mortality in this country were prepared by Dr Adesh Sirjusingh, who is part of the team appointed by Prime Minister Dr Keith Rowley to review the regional health authorities (RHAs) and the health sector. Sirjusingh is also the administrator of clinical services at the Sangre Grande Hospital. ? TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/fuad-specialist-doctors-will-leave/article_4e316231-814c-5d33-be70-e592eaee7112.html\", \"TITLE\": \" Fuad: Specialist doctors will leave \", \"DATE\": \"Nov 30, 2015 \", \"CONTENT\": \"Former Health Minister Dr Fuad Khan has predicted there will be an exodus of specialist doctors from the public hospitals.Khan said consultants will leave the public health care sector if there are being mandated to work full time because it simply is not lucrative for them.You cannot expect a consultant person to be there full time with the salary that they are getting because then you will get absolutely nobody there, there will be an exodus, said Khan.The instruction that specialist doctors be present at public hospitals in an effort to prevent the deaths of babies and mothers, was contained in a report circulated to public hospital on November 23.Khan said the report was just a piece of paper that would not be adhered to.He said further when he was health Minister, together with Chief Medical Officer (CMO) Dr Colin Furlonge, he made a proposal to the Chief Medical Officer (CMO) that specialist doctors be paid more as their services were needed at the public institutions not only for care but for training.He said this was rejected by the CPO.You will get an exodus, even as a consultant I wouldnt take that nonsense, you cant expect me to work like that, not pay me and expect to be responsible for all the mishaps. A lot of the mishaps that occur is not the consultants fault, its the ancillary staff, some nurses behaviour, the entire thing is a process, he said.Khan said specialists doctors/consultants earn over $40,000 a month but their take home salary after taxes is around $30,000.He said specialists earn this amount in one day in private practice.Meanwhile, obstetrician/gynaecologist Dr Sherene Kalloo who worked in the public health sector said consultants should make a choice between public and private practice as she did.Kalloo said she felt that patients in the public health sector were at a disadvantage because she could not commit to their full time care.I could not give it my full attention and patients require 200 per cent attention. In order to avoid any disasters I had to make a choice and I also took into consideration the demands of my own family, I have three young boys who needed their mothers care then and still do she said.If it comes down to specialists having to make a choice today in order to provide better health care and reduced maternal mortality then they should know what is the right thing to do, said Kalloo. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/doctors-in-pain/article_92925908-07c4-5cbf-86bf-a2a6be980803.html\", \"TITLE\": \" DOCTORS IN PAIN \", \"DATE\": \"Dec 24, 2011 \", \"CONTENT\": \" House officers at the Port of Spain General Hospital say the chronic shortage of staff and non-payment of overtime at the hospital are becoming untenable. The doctors claim that since May they have not been paid overtime. If the situation does not improve, health care at the hospital could be heading towards crisis proportions soon, doctors told the Express. According to their contracts, the doctors must work seven sessions per month, and must be compensated for working additional sessions. To deal with the staff shortage however, house officers are working as many as ten sessions and are yet to be compensated. The Express spoke with one such doctor yesterday who has accrued more than $20,000 in overtime. He described the distress he and his colleagues are currently experiencing as a result of not being paid overtime since May. He said the doctors were afraid to speak out publicly, fearing that they would lose their jobs. \\\"The situation is so distressing, we keep working the extra sessions, hoping that things will change but months have gone by and still we have not been paid for overtime. These doctors have to pay rent, mortgage, car loans, and since many of the doctors are foreigners, they also need to see about their families back home. It is not fair, what kind of message is being sent to foreigners coming here to work\\\" he asked. \\\"It's not motivation that is driving us because right now the doctors aren't motivated. Our consciences are what's driving us to continue because we know that we can't compromise health care, we can't leave our patients to suffer because that will not be fair to them.\\\" The doctor claimed that the hospital medical chief of staff, Dr Colin Furlonge, has advised the doctors to adjust their rosters so that each doctor works their stipulated seven sessions. \\\"We have tried this recommendation, but because there are not enough doctors to be spread around, it is not possible for doctors to work just seven sessions. If every doctor decides that he or she will work only seven sessions, then you will have other sessions that are unaccounted for,\\\" he said. Furlonge could not be reached for comment yesterday. In early December, Health Minister Dr Fuad Khan announced that a new batch of Cuban doctors and nurses had arrived in Trinidad. While an influx of nurses and specialists is a welcome sight, the house officers at the hospital contend that junior doctors are specially needed to work on the wards and ground levels of the hospital. This is not the first time problems affecting junior doctors at the hospital have been brought to attention. Several weeks ago an unsigned letter listing a number of grievances among junior doctors was circulated to media houses. Among the claims made in the letter were that junior doctors have to spend money hiring attorneys to get monies owed to them by the North West Regional Health Authority and that accident and emergency junior doctors are being denied compensatory days for public holidays. The letter also stated that junior doctors must work under poor conditions and use poor unsafe on-call facilities. \\\"There is a false belief that being a doctor is a noble profession, we urge parents to guide their children otherwise. Being a doctor in T&T is real hell and this situation is a national shame,\\\" the letter concluded. In response to a few questions sent to the board of the NWRHA regarding the contents of the letter, the Express was told that a meeting was held between management and doctors to discuss the matter of compensation and that another meeting was scheduled to take place. But a doctor speaking on the condition of anonymity said the second meeting was cancelled and the doctors still do not know when they will be compensated for working extra sessions. When contacted yesterday, Health Minister Dr Fuad Khan said he had not been apprised of the issue regarding overtime payments. He added that it must be investigated. The minister also said the doctors affected should write him directly on the matter. \\\"We are not fighting with government or with management but doctors are humans too. And so we expect management to make the work environment more conducive for their staff to thrive and provide more doctors and not compromise the health care of its citizens,\\\" said an aggrieved doctor. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/punish-the-doctor/article_c08677de-9ed8-5937-82f4-83784e37c232.html\", \"TITLE\": \" Punish the doctor \", \"DATE\": \"Jun 14, 2014 \", \"CONTENT\": \"BABY SIMEON\\u0092S MOTHER: Quelly Ann Cottle BABY SIMEON\\u0092S MOTHER: Quelly Ann Cottle The doctor responsible for the death of baby Simeon should be punished by having his medical licence revoked, his mother Quelly Ann Cottle said yesterday . On March 1, Dr Javed Chinnia performed a Caesarean section on Cottle at the Mt Hope Womens Hospital during which baby Simeons head was sliced open. On instructions of Prime Minister Kamla Persad-Bissessar, Attorney General Anand Ramlogan appointed a committee to investigate the death. This team comprised chairman and retired Appeal Court judge Mustapha Ibrahim, neonatologist Dr Petronella Manning-Alleyne and consultant obstetrician/gynaecologist Dr Melanie Clare Davis of the UK. The committees report has stated that baby Simeons injury occurred from failure to exercise the degree of skill which was required in order to perform the surgery. It also stated that a prima facie case of medical negligence may have been made out following Chinnias admission that a surgical error was to be blamed for the babys death. The committee advised that the medical disciplinary authorities as constituted under the Medical Board Act Chapter 29:50 should determine the necessary course of action in this case. Speaking to the Express by phone yesterday, Cottle said she was surprised to see the report findings in the newspapers. She said she feels like a fool because she met with Health Minister Dr Fuad Khan at the Parliament last Friday and when she asked for a copy of the report she was told she cannot get it until released to the Parliament. She said Khan told her she can view the report tomorrow. I feel like its some pappyshow because my baby died and I cant get a copy of the report on how he died but it was given to the media, said Cottle. Nevertheless, Cottle said based on the media reports it is clear that the doctor who did the surgery was to blame as both she and her husband had said from day one. I think he should be punished, they should take away his licence so he cannot make any more mistakes, said Cottle. She said she asked Khan what action will be taken against the doctor and he told her it was a case for the Medical Board to determine. This thing real affecting me. I feel as though I did wrong and the doctor is the victim. My baby died because of him, said Cottle. I will leave it in the hands of God but I really do not want to be one to say that I did not get justice, Cottle added. She reiterated her call for a copy of the report and expressed hope that proper action would be taken against the doctor . Chinnia was suspended with basic pay following baby Simeons death. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/what-discourages-some-doctors/article_00a67080-b979-5d03-a8c1-7a5788cff169.html\", \"TITLE\": \" What discourages some doctors \", \"DATE\": \"Jul 26, 2010 \", \"CONTENT\": \"EVASIVE ACTION: Trinidad and Tobago winger Akeem Garcia, left, skips past Suriname goalkeeper Savio Proeger during Caribbean Football Union (CFU) Under-17 World Cup qualifying action on Thursday night at Ato Boldon Stadium in Balmain, Couva. T&T won 3-1 and play their final group match today against Guyana from 7 p.m. at Hasely Crawford Stadium. \\u0097Photo: JERMAINE CRUICKSHANK EVASIVE ACTION: Trinidad and Tobago winger Akeem Garcia, left, skips past Suriname goalkeeper Savio Proeger during Caribbean Football Union (CFU) Under-17 World Cup qualifying action on Thursday night at Ato Boldon Stadium in Balmain, Couva. T&T won 3-1 and play their final group match today against Guyana from 7 p.m. at Hasely Crawford Stadium. \\u0097Photo: JERMAINE CRUICKSHANK When I was a youngster and there was the occasional photograph in the press of a newly qualified doctor, all bedecked in his graduation gown, I used to think that here is a young modern doctor who therefore knows more than the old fogies here. Little did I know that at graduation one only begins to learn the practice of medicine and before that it is mostly book learning. I have already told the story of my first day after graduation when in my Dublin teaching hospital a patient to whom I was speaking suddenly suffered a heart attack and how I panicked, forgetting what dose of this and that should be given in such an emergency. The head nurse had to come to my rescue! In fact, several years ago we deemed that there should be a two-year instead of a one-year internship period before being granted full registration. However, it appears that as far as the university is concerned, their responsibility ends on graduation day, and they seem to be relatively unconcerned about the level of supervision which their interns receive in the hospitals. It is as though once the baby is delivered, there is no interest in the postpartum care. How well I remember the utter distress of a newly-qualified young intern who came complaining to me that she was left unsupervised in a pediatric ward. As she cried, trembling slightly: \\\"But children die so easily.\\\" Now, when in 1967 it was decided to decentralise the teaching of medicine from the Mona Campus in Jamaica to include teaching in the Queen Elizabeth Hospital in Barbados and the Port of Spain General Hospital, one reason which was put forward to justify the initiative was that the interns should be taught in the hospitals where they will eventually work, and that the new university-appointed staff should try to raise the standard of medicine and academia in these government-run hospitals. I do believe that we did succeed to a certain extent with that in the early days but it was blood sweat and tears and even in those days there were major staffing problems. A typical medical (or surgical) firm should comprise a consultant, a registrar, a house-officer and an intern or two as a minimum. Registrars in the United Kingdom, for example, are those who are pursuing postgraduate training in order to achieve specialist status. Usually in internal medicine, they already have the diploma of the Membership of the Royal College of Physicians (MRCP) and in surgical firms, the FRCS (Fellow of the Royal College of Surgeons), which are not per se recognised degrees for specialist status. They generally stay in that post for about four years and then move on to wherever to make room for other registrars. This is very important. As an aside, this reminds me of a well-known practice in the days when I sat the examination. That degree from Edinborough, for example, is designated MRCP(E) and from Ireland it is MRCP(I). Many students from India used to come to the UK to sit this prestigious examination. Most failed but they would then return to India and put MRCP(F) on the large shingles outside their private offices to impress the patient. Of course, and deceptively so, (F) could stand for (France) or (Finland) or wherever. However, their (F) really stood for \\\"Failed.\\\" Legally therefore, the doctor did not lie! In the UK, registrars are not allowed private practice. They are in the hospital all day and are a most important anchor, liaising with the consultant and are also involved in the teaching and supervision of the junior house-officers and interns. In fact, in certain practical ways I learned more from my registrar than from the consultants. I will only refer to the Port of Spain General Hospital because I know relatively little about the others but I am sure that they suffer the same problem. A suitably qualified registrar is a rarity in the hospital's medical firms. Unfortunately, those who do have the MRCP diploma frequently consider themselves specialists when they are not and, to make matters worse, they quickly set up a private practice and you cannot find most of them after 1 p.m. in the hospitals. Attention Ministry of Health! But hospitals are where the most interesting, challenging and difficult medicine is seen and, as is found in the great First World hospitals, there must be strict discipline, proper staffing, good management and, last but not least, inspirational and exemplary registrars, consultants and heads of departments. In fact, any hospital without such a cadre of staff cannot be worthy of being chosen to be a teaching hospital since, among many other things, without such seniors the supervision and training of young doctors will be severely compromised as will any attempt to provide an academic atmosphere which is so essential for excellence. This discourages some young doctors. And so, they leave for this and other reasons. To be continued Prof Courtenay Bartholomew is UWI's first Trinidadian professor ofmedicine and director of the Medical Research Centre TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/suspended-doctors-return-to-work/article_346011d1-7b93-5fc7-9638-4e6c1d28e517.html\", \"TITLE\": \" Suspended doctors return to work \", \"DATE\": \"May 9, 2016 \", \"CONTENT\": \"Just one day after the Public Services Association (PSA) threatened contempt of court proceedings against the Tobago Regional Health Authority (TRHA), Tobago House of Assembly Health Secretary Claudia Groome-Duke has ordered that three doctors previously suspended by the TRHA be reinstated to their positions at Scarborough General Hospital. In a letter dated Monday, May 9, the Health Secretary addressed TRHA acting CEO Dr Nathaniel Duke: \\u201cI hereby direct you to retain the status quo by complying with the order of the court, by allowing the claimants to return to their respective posts. In the interim the claimants should not be deprived of their employment.\\u201d Groome-Duke further advised a management plan should be instituted to facilitate a period of adjustment for the doctors, including training and appropriate oversight, to prevent further maternal mortality in Tobago. The TRHA's action followed the death of 35-year-old Rose Gordon on New Year's Day. Later that month the doctors were suspended by the TRHA board and the doctors, represented by the PSA, took legal action in the matter. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/doctor-i-was-never-hired/article_b927432f-87f8-5aaf-8b6b-c1b59fe21678.html\", \"TITLE\": \" Doctor: I was never hired \", \"DATE\": \"Jul 29, 2010 \", \"CONTENT\": \"Dr Richard Spann, the neurosurgeon blamed for leaving patients in the lurch at public hospitals, has said he was never a member of staff at these institutions. He said he had been volunteering his services for years at the San Fernando General Hospital and the Mount Hope Medical Sciences Complex with the understanding that the Ministry of Health would find a replacement. The UK trained Dr Spann continues to work full time at the Community Hospital of Seventh Day Adventists in Port of Spain, where he also is the chief executive officer, and still volunteers his services at the public hospitals. On Wednesday, a woman who took her eight-month-old baby for help at the San Fernando General Hospital, was told she had to go to Port of Spain. She was one of several people turned away from the south hospital because of the absence of a specialist to treat head and brain injuries. Contacted yesterday for comment on his \\\"sudden resignation\\\" that left almost 50 patients, including eight children, in need of specialist neurological attention, Spann said he had informed Health Minister Therese Baptiste-Cornelis by letter of his decision to sever his volunteer services about a week ago. Spann said he had many conversations with officials at both institutions about finding replacements. \\\"I have been working in Trinidad for ten years, but I have never worked as a member of staff in any public health institution. I was always employed at Community Hospital but from time to time I was asked to help out at the public institutions (San Fernando General Hospital) and Mount Hope. I agreed to do so until these institutions could get a neurosurgeon on staff,\\\" he said. Spann said he extended himself between three hospitals and nothing was seemingly being done at the Ministry of Health to find a solution. However, the extremely long hours and hectic duties began taking a toll on his personal and family life, he said. The doctor said it was impossible for him to give the effective care that some patients needed at these hospitals. He has been serving at the San Fernando hospital since 2008, but because it was impossible for him to visit patients daily, he suggested that the patients who needed urgent daily care and surgery be transferred to the Community Hospital at which he worked. In 2008 that was done, but no contracts were signed and monies are still owed for services provided, he said. He also responded to Baptiste-Cornelis' claim that $30 million was owed to private institutions by the South West Regional Health Authority, and concerns that patients being kept too long at the institutions. Spann however said, \\\"All that money is not owed to us. And some of these patients with brain and spinal injuries need round the clock attention, but we cannot ever say stop the service on a patient in need. That's an ethical issue there.\\\" He believes many doctors opt out of the public institutions because they are frustrated in trying to provide health care in the midst of staff shortages, inadequate equipment, lack of drugs and other ongoing problems. There are nine specialist neurosurgeons in the country with three at the Port of Spain General Hospital, three in private practice and three retired. If called upon by the Health Minister, Spann said these professionals could make recommendations to resolve the problem at the health institutions while, hopefully, younger doctors are encouraged to specialise. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/doctor-charged-with-cocaine-possession/article_e507bf1b-6950-5d93-84e1-4dfd525cf565.html\", \"TITLE\": \" Doctor charged with cocaine possession \", \"DATE\": \"May 31, 2014 \", \"CONTENT\": \"A doctor, who police claim tried to smuggle 17 kilogrammes of cocaine in two water heaters, will appear in the Arima Magistrates Court tomorrow charged with possession of illegal drugs. The doctor, police said, is attached to the Tobago Regional Health Authority. Police allege the doctor was attempting to ship the two water heaters to Jamaica late last year at Piarco International Airport when the cocaine, valued at $8.6 million, was discovered inside the items. The doctor at that time denied having any know- ledge of the cocaine and was released, police said. However, on Friday, police officers arrested the doctor in Tobago, and he was flown to Trinidad and charged with the offence. Police said in 2012, the doctor was also charged with stealing medication from the Sangre Grande Hospital and attempting to sell it TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/foreign-doctors-for-health-sector/article_def06ea1-b5c1-538e-b7eb-81a507b9f7d6.html\", \"TITLE\": \" 119 foreign doctors for health sector \", \"DATE\": \"Aug 7, 2009 \", \"CONTENT\": \"FIVE hundred and thirty-four foreign medical professionals, including 119 doctors, are scheduled to start arriving in this country from as early as next week in order to fill the gaps within the health sector, according to Parliamentary Secretary in the Ministry of Health, Senator Wesley George. \\\"They are coming in batches and I understand that the first batch would be coming in from Cuba and they would be distributed evenly throughout the regions in all sorts of specialties across the board,\\\" he said. George, who said the ministry hoped that within the next five years they would \\\"have no need for foreign health professionals because our own Trinidadians and Tobagonians would have been trained and registered in every available vacancy in our public health system\\\", was speaking to the Express after the graduation ceremony for Operating Theatre Nurses at the Eric Williams Medical Sciences Complex yesterday when he made the statements. Health Minister Jerry Narace however told the Express that these professionals would not be shuffled into the system until they have been assessed and trained according to the rules outlined by the law. Speaking to the Express via telephone, Narace said even though the number seems large, the group was made up of doctors, nurses and technicians, all of whom are needed to fill the severe shortage currently being experienced in all of the hospitals today. \\\"We have a huge hole to fill in the health sector as it relates to professionals and all we are trying to do is meet that,\\\" he said. In addition to that, the minister insisted that nothing would be done contrary to what an assigned government panel, designed to oversee them, has outlined. \\\"There are going to be terms and conditions ... and that includes the writing of an English exam and be supervised,\\\" he said. Nevertheless, medical students, who spoke to the Express, said they felt shunned and upset over the ministry's decision to hire the non-English speaking doctors because most of the times they did \\\"not know how to speak English correctly and were often times unable to understand patients if they did\\\". In addition to that, they questioned whether or not they would be given full preference when they graduated. The minister however, said they had nothing to worry about. \\\"Our first preference has always been to use the local doctors, but we have a cadre of spaces to full and we have to full them. But these students have nothing to worry about because we have made it clear that all graduating UWI (University of the West Indies) doctors will get jobs,\\\" he said. In fact, he said the UWI students, who would have been refused registration in the past, are now guaranteed registration with the passing of the Medical Board Amendment Bill. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/probe-doctor/article_f62838e2-ecf7-57a7-8d59-6d704ead9570.html\", \"TITLE\": \" PROBE DOCTOR \", \"DATE\": \"Oct 29, 2014 \", \"CONTENT\": \" TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/doctors-suspended/article_97ba23e0-14d0-5b1a-97f3-4849fffc274a.html\", \"TITLE\": \" 5 DOCTORS SUSPENDED \", \"DATE\": \"Mar 13, 2011 \", \"CONTENT\": \" FIVE doctors and four nurses were yesterday suspended from the San Fernando General Hospital following a preliminary investigation into the death of Chrystal Boodoo-Ramsoomair. Boodoo-Ramsoomair, 29, a mother of three, died hours after giving birth to a baby girl by Caesarean section at the San Fernando General Hospital two Fridays ago. At a press conference at the ministry's head office in Port of Spain yesterday, Health Minister Therese Baptiste-Cornelis said the suspensions will allow authorities to remove those involved in the case, as well as guarantee an unbiased investigation so that full disciplinary action can take place if necessary once it is completed. The investigation, she added, which is being conducted by an independent panel, will take place over two weeks and should not be \\\"deemed to be a stain on the reputations of anyone\\\". At Boodoo-Ramsoomair's funeral last Saturday, Legal Affairs Minister Prakash Ramadhar said Prime Minister Kamla Persad-Bissessar had called for measures to be put in place to ensure there is no repeat of the incident. At the press conference yesterday, Baptiste-Cornelis said the suspension was in keeping with the Prime Minister's call. \\\"The difference between this death and the death of other nationals is that the autopsy revealed certain information ... and in order to facilitate the investigation, the South West Regional Health Authority's board has advised the minister, and the Ministry of Health, that all members involved in this particular case will be sent on two weeks suspension of duties with basic pay,\\\" she said. The decision to suspend the medical workers, which she admitted was a first for the ministry, was made by SWRHA's chief executive officer Paula Chester Cumberbatch. \\\"It should be noted that the suspension was not seen directly as a penalty, but it more represents the fact that we must ensure public confidence is rekindled in our system and we have promised transparency and accountability to all our nationals,\\\" she said. When asked about other maternal deaths and whether the doctors involved could meet the same faith, the minister said those deaths did not happen during her tenure. As for the three other maternal deaths that did occur under her tenure, Baptiste-Cornelis said she will be making a statement on them as soon as she receives the final report from Attorney General Anand Ramlogan. \\\"But as the Prime Minister said, of the three cases, two of them have showed no fault of the doctors or nurses involved, but all three cases have recommended procedural changes,\\\" she said. The minister added, however, that following their own preliminary investigations into maternal care at the nation's hospitals, it has come to their attention \\\"that the Ministry of Health on November 4, 2009, did put out certain policies and procedures which must be followed by all RHAs\\\". Baptiste-Cornelis said \\\"some people have seen those policies as not necessarily policies they need to adhere to\\\". \\\"We have spoken to some of them and we have actually been very frank. If they would not like to follow the policies by the Ministry of Health based on WHO/PAHO standings, you are free to demit yourself from work,\\\" she said. As for the new investigation into maternal health care, Baptiste-Cornelis said an overall strategy for dealing with it is being looked at and the ministry will seek to ensure new procedures are developed and maintained. Heading this committee is chairman of the SWRHA, Dr Lackram Boodoo. Asked if she felt there was any conflict of interest considering that he is a medical practitioner and certified gynaecologists/obstetrician, the minister insisted there was none and in spite of his appointment being political, it was just the way the government did it. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/pm-no-one-is-above-the-law/article_7b548146-bb0d-11e9-bd37-6b3070eef214.html\", \"TITLE\": \" PM: No one is above the law \", \"DATE\": \"10 hrs ago \", \"CONTENT\": \"AWAITING OUTCOME: Keith Rowley {{description}} Email notifications are only sent once a day, and only if there are new matching items. AWAITING OUTCOME: Keith Rowley THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. The Prime Minister admitted he was saddened by what had happened to McDonald, but reiterated that no one was above the law. And Government Minister Fitzgerald Hinds said he and other colleagues were surprised when they heard the news of McDonald\\u2019s arrest on Thursday. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. TWO videos which show minors engaged in sexual acts with adults are now engaging the attention of police. This was confirmed by Children\\u2019s Authority chairman Hanif Benjamin yesterday. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. A PIPE FITTER who told the court he found and kept five protected turtles, has been arrested\\u2026 Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/government-cops-respond-to-marlene-mcdonald-s-arrest/article_b8221798-b9e4-11e9-8bc6-afafcc864fa6.html\", \"TITLE\": \" Government, cops respond to Marlene McDonald's arrest \", \"DATE\": \"21 hrs ago \", \"CONTENT\": \"Port of Spain South MP Marlene McDonald FLASHBACK: Newly appointed Minister of Public Utilities Marlene McDonald is congratulated by, from left, close friend Michael Carew, Jean Elder, chairman of the Port of Spain South Constituency, Port of Spain \\u201ccommunity leader\\u201d Cedric (Burkie) Burke, Kenroy Dopwell and Sharon Felix at President's House, St Ann's, after she was sworn in. \\u2013Photo: CURTIS CHASE Minister of Public Administration, Marlene McDonald MP Marelene McDonald's constituency office. {{description}} Email notifications are only sent once a day, and only if there are new matching items. Port of Spain South MP Marlene McDonald Government this afternoon acknowledged for the first time the police investigation involving Public Administration Minister Marlene McDonald. In a brief statement issued at 2:39p.m. newly appointed Communications Minister Donna Cox said: \\\"The Government of the Republic of Trinidad and Tobago (GoRTT) wishes to confirm that a search warrant was executed at the home of Minister of Public Administration the Honourable Marlene McDonald this morning (8 August 2019). However, this is an ongoing police investigation and further information will be provided as it is made available by the Trinidad and Tobago Police Service.\\\" Shortly after the Government's statement, the TTPS issued an statement of its own. The TTPS stated: \\\"Police officers investigating alleged corruption offences have arrested and taken into custody, Government Minister Marlene McDonald and her husband for questioning. They were detained earlier today, Thursday 8th August 2019. Enquiries are ongoing at this time and more information will be provided when it becomes available.\\\" At around dawn today, McDonald and her husband were detained. McDonald, the Member of Parliament for Port of Spain South was taken into police custody. The arrests were made at the couple's home at around 4a.m. by police executing a search warrant. The detention came after police went to the Director of Public Prosecutions Roger Gaspard with an investigation file on Tuesday. McDonald, a Cabinet minister, is being investigated on the allegation of misappropriation of public funds. MP Marelene McDonald's constituency office. The Express was told that McDonald, complained of feeling unwell and was treated at hospital. On June 1, 2017, Prime Minister Dr Keith Rowley advised then President Anthony Carmona to revoke the appointment of McDonald who was then Minister in the Ministry of Public Utilities. Minister of Public Administration, Marlene McDonald McDonald had only recently been sworn in as Minister in the Ministry of Public Utilities after a sixteen month period of absence from the Cabinet. Why was MacDonald fired then? McDonald met with Prime Minister Dr Keith Rowley the morning of her firing, as a result of the controversy caused by her choice of guests attending her swearing-in ceremony at the President's House in St Ann's days before. The commotion surrounds the presence of reputed \\\"community leader\\\" Cedric \\\"Burkie\\\" Burke, who accompanied contractor Kenroy Dopwell to the event. Senior elements of the national security community had expressed alarm at the presence of Burke, who has been engaging their attention. FLASHBACK: Newly appointed Minister of Public Utilities Marlene McDonald is congratulated by, from left, close friend Michael Carew, Jean Elder, chairman of the Port of Spain South Constituency, Port of Spain \\u201ccommunity leader\\u201d Cedric (Burkie) Burke, Kenroy Dopwell and Sharon Felix at President's House, St Ann's, after she was sworn in. \\u2013Photo: CURTIS CHASE Not only was he present, but Burke was introduced by her to the President and posed for pictures with Carmona Carmona. On August 2, Rowley reappointed McDonald, to the post of Minister of Public Administration. Burke was detained on Monday by police who seized his electronic devices including cell phones and laptops. He was questioned and released on Wednesday morning. Reporting by Alexander Bruzual Police need help in locating 16-year-old Shakira Moore. A woman and her lesbian lover were allegedly beaten by the woman\\u2019s husband after she confess\\u2026 FOURTEEN-year-old Nicholai Hodge died as a result of two stab wounds to the chest, an autops\\u2026 PRIME Minister Dr Keith Rowley, who spoke yesterdat to CNC3 News following the detention of \\u2026 Minister in the Ministry of Public Administration and Communications, Marlene Mc Donald spen\\u2026 Government Minister Marlene McDonald was dealt a third strike to her political career yesterday with her arrest by police on corruption allegations. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/marlene-grilled-for-eight-hours/article_f805a324-bb0c-11e9-8663-5fcd22e380e6.html\", \"TITLE\": \" ...Marlene grilled for eight hours \", \"DATE\": \"7 hrs ago \", \"CONTENT\": \"VISITORS: Arima Mayor Lisa Morris-Julian and Laventille East/Morvant MP Adrian Leonce on Thursday night at the St Joseph Police Station, where they visited Minister of Public Administration Marlene McDonald, who was being held for questioning. \\u2014Photo: JERMAINE CRUICKSHANK {{description}} Email notifications are only sent once a day, and only if there are new matching items. VISITORS: Arima Mayor Lisa Morris-Julian and Laventille East/Morvant MP Adrian Leonce on Thursday night at the St Joseph Police Station, where they visited Minister of Public Administration Marlene McDonald, who was being held for questioning. \\u2014Photo: JERMAINE CRUICKSHANK MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. McDonald and her husband were brought to the Professional Standards Bureau office at Henry Street, Port of Spain, at about 8 a.m. yesterday. Shortly after, Pamela Elder SC and attorney Owen Hinds Jr arrived at the PSB office and went inside. Elder, who is representing McDonald and her husband Michael Carew, remained inside the building until about 2.15 p.m. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. TWO videos which show minors engaged in sexual acts with adults are now engaging the attention of police. This was confirmed by Children\\u2019s Authority chairman Hanif Benjamin yesterday. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. A PIPE FITTER who told the court he found and kept five protected turtles, has been arrested\\u2026 Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/cuban-doctors-and-nurses-join-health-sector/article_81777ea8-aa05-5695-8aab-cc82bace786d.html\", \"TITLE\": \" 14 Cuban doctors and 56 nurses join health sector \", \"DATE\": \"Jun 9, 2012 \", \"CONTENT\": \"emulate work ethic: Dr Fuad Khan emulate work ethic: Dr Fuad Khan SEVENTY Cuban doctors and nurses were last Friday each granted two-year contracts for employment in the public health sector, as the Ministry of Health seeks to address the shortage of doctors and nurses in this country. During the opening session of the Orientation Programme for Heath Professionals from the Republic of Cuba, which took place at the Crowne Plaza hotel in Port of Spain, Health Minister Dr Fuad Khan said, \\\"the work ethic of the Cuban professionals is something I ask our professionals to emulate.\\\" According to a press release from the Ministry, the group comprised 14 doctors and 56 nurses. The 14 doctors comprise 11 general practice physicians who will serve in the public health system's primary care facilities and one ENT specialist, one nephrologist and one paediatrician who would serve within the hospital system. The nurses' specialties range from intensive care nursing to neonatal and community nursing, according to the release. \\\"The recruitment of foreign professionals forms part of the ministry's overall strategy to address the shortage of doctors and nurses within the health system in the short and medium term. \\\"Attracting, training and recruitment of local human resource to fill vacancies within the sector remains the ultimate goal for filling the employment gap in the long term. In the interim however, further retention of foreign healthcare professionals remains a priority given the significant shortage of health professionals in the public health sector,\\\" the release stated. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/doctors-upset/article_b6e0237c-371a-5511-95fe-c536a5113b58.html\", \"TITLE\": \" Doctors upset \", \"DATE\": \"Mar 22, 2013 \", \"CONTENT\": \"MEDICAL DOCTORS are upset that they will no longer be entitled to certain tax exemptions as part of their employment package, but Health Minister Dr Fuad Khan said he was working to have the issue \\\"sorted out\\\". The Medical Professionals Association of Trinidad and Tobago (MPATT) held a meeting at San Fernando General Hospital's nursing lounge Friday to discuss the issue. MPATT's vice president Dr Ravindranath Narine said a document was sent from the Ministry of Health stating that Regional Health Authority (RHAs) doctors will no longer be entitled to partial motor vehicle tax exemption. Narine said, \\\"Doctors, like other employees are travelling officers and they have to work beyond the hours of 8 a.m. to 4 p.m. They may have to work at other health care institutions in other regions. This has been in existence since time immemorial and is one of the few benefits that are given to public travelling officers.\\\" Narine said in 2005, the ministry negotiated an arrangement to grant motor vehicle tax exemptions. In a letter dated June 16, 2005, it was confirmed that the partial exemption was to be arranged for public officers. Narine said, \\\"Our goodly (chief personnel officer) Stephanie Lewis has communicated to former permanent secretary (Antonia) Popplewell at Ministry of Health dated January 21 indicating that she has unilaterally removed this benefit, apparently not recognising the fact that MPATT is the majority recognised trade union for doctors employed at SWRHA. As such any treatment of doctors' remuneration package must be done in consultation with the MPATT, as provided for under Section 40 of the Industrial Relations Act.\\\" Khan, in response to Narine's statements, told the Sunday Express the tax exemption was a benefit of public servants, and RHA doctors were contract doctors. However, he said the deputy permanent secretary has been working for the past two months to get the RHA doctors the benefit. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/superior-health-care-at-sangre-grande-hospital/article_ad3f0e74-56d8-5e1a-8a22-00545a57817c.html\", \"TITLE\": \" 'Superior health care' at Sangre Grande Hospital \", \"DATE\": \"Jan 13, 2012 \", \"CONTENT\": \"focus on customer service: Eastern Regional Health Authority CEO Stacy Harricharan at the ERHA offices on Eastern Main Road, Sangre Grande. focus on customer service: Eastern Regional Health Authority CEO Stacy Harricharan at the ERHA offices on Eastern Main Road, Sangre Grande. THE MOTHER of nine-year-old Ariel Rostant was looking for a medical institution to perform eye surgery on her daughter. She was told at the Eric Williams Medical Sciences Complex, Mt Hope that she would have to wait a few years for the surgery, while the Sangre Grande Hospital informed her it could be done within a few weeks. She made the obvious choice. Following the successful retinal implant surgery last Wednesday Rostant's mother has heaped praise on the hospital staff. \\\"(The service) was excellent, the doctors are very caring, and considerate, I recommend they get more funding,\\\" she told the Sunday Express yesterday in a telephone interview. She said that the doctors were \\\"extremely polite\\\", nurses \\\"par excellence\\\" and she also found them \\\"very caring and considerate\\\". \\\"I have the highest esteem and regard for them,\\\" she added. This was one of a number of positive reports the Sunday Express has received from patients at the Sangre Grande Hospital which falls under the purview of the Eastern Regional Health Authority (ERHA). The ERHA, with the hospital, 15 health centres and the Mayaro District Health Facility, provides coverage for 130,000 people from Matelot down to Guayaguayare across to Rio Claro and up to Cumuto. ERHA chief executive Stacy Harricharan, speaking to the Sunday Express on Friday at the ERHA's offices in Sangre Grande, said it was about one-third of the land mass of the country but it was very disparate which has been one of the challenges for them. Asked if they got a lot of traffic from outside the catchment area, Harricharan said \\\"of course we do\\\", noting that the attraction was the \\\"superior health care\\\". ERHA quality manager Keith Beharry said they got patients from surrounding areas like Arima but also from other parts of the country. \\\"We get people from even as far as Diego Martin sometimes coming to Grande just for the service. (For) our maternity ward (women from) as far as South will come just to deliver at Grande. The name Sangre Grande Hospital speaks for itself,\\\" he added. He said a main attraction was good waiting times for both surgical and medical services including same day emergency ultrasound, routine cases and urgent cases for CT scans could be done almost immediately. \\\"Routine cases for diagnostic reviews can be done within three to four weeks, that as well is unheard of really in the sector but it's because of the management of the cases,\\\" he added. Harricharan recalled hearing positive reports about the hospital prior to becoming CEO in August last year. \\\"Like everybody else, I had heard the great things about Sangre Grande Hospital so I had a lot of preconceived notions of it being very good in terms of patient care and service delivery,\\\" she commented. Harricharan stressed that they take a \\\"customer service view\\\" of the service they offer at the hospital and all the ERHA's health centres and outreach centres. She said one of the first things that struck her at the hospital was the \\\"smiling faces\\\", possibly a product of the \\\"Miles of Smiles\\\" initiative launched in 2009 \\\"to engender in employees the willingness to cooperate with the patient\\\". Beharry said the initiative was for the staff to understand their role in the sector and how to help a patient or address one with a concern who may feel they are not getting adequate attention. \\\"The focus really was on ensuring that the Sangre Grande Hospital really became a customer service organisation and I think we have been able to accomplish that in the last couple years,\\\" he said. He noted that the training was multi-disciplinary with a wide range of staff including doctors, nurses, clerks and attendants. He said after the training there was monitoring on a monthly basis via patient discharge surveys which cover from point of entry to exit, ascertaining what patients liked and areas of improvement. The survey includes attitude of all staff, cleanliness of ward areas, comfort, ability to rest, meals, interaction with doctors and explanations of their condition, and counselling on medication use. \\\"So they were actually able to tell us what their experience was and that is important to us,\\\" he said. Asked about the similarities with the planned health sector exit forms, mentioned recently by Health Minister Dr Fuad Khan, Beharry said the Minister appeared to be on the same \\\"trend of thought that we have been on\\\". Harricharan said they had a robust client feedback system, which included the discharge surveys and suggestion boxes at all ERHA facilities, and \\\"the eastern region can boast a very high resolution rate.\\\" \\\"If for example a patient has a complaint...what we do is very actively endeavour to try to resolve same,\\\" she said On the general feedback from patients, Harricharan noted that she is often complimented about the type of service a patient received from a particular doctor. She praised the staff at the hospital including their \\\"world-class\\\" team of consultants. Beharry described the consultants as very committed. \\\"We don't have stories of our consultants not being on the job,\\\" he added. Harricharan said they had a lot of doctors and nurses that were very good to patients \\\"because you go into the hospital and it is something that strikes you. \\\"Everybody is committed, everybody is diligent, everybody does the best with the resources that we have, I think that generally is the feedback that the general public has of the hospital, and we try very hard to maintain that here,\\\" she added. Harricharan also noted that they had a committed management team, a lot of them were new as she had to fill a lot of vacancies when she took up the post. She recalled when she became CEO she found a \\\"very strong and robust hospital system\\\". \\\"We are all working very hard to just ensure that what we found when we came here is improved upon,\\\" she said, She added: \\\"The (positive) branding of the Sangre Grande Hospital is a result of the good work of the doctors, the nurses, board and management team.\\\" Speaking on the management style she commented: \\\"We understand in the Eastern region that health care is not about buildings, we recognise that it has 110 per cent to do with our human resources and so the management style is very collaborative, the managers and the doctors work together hand in hand, there is very open communication between us and them, (similarly with nursing staff), we can monitor what needs there are and our job is to meet their resource needs.\\\" Harricharan said the hospital is not perfect and has constraints like every hospital including space, but they work in tandem with the Health Ministry. \\\"We just try hard to really reach the performance targets set by the ministry, and we use the milestones to govern our behaviour and manage staff,\\\" she said. Beharry noted the hospital had won a lot of quality awards from the Health Ministry. Most recently its male and female medical awards won National Health Sector Quality Awards from the Health Ministry \\\"for hospitality, personalised and respectful care\\\". He said that during the assessment the delivery on the ward was \\\"beyond the call\\\" of duty including ensuring patients are comfortable and happy. He also pointed out that Sangre Grande has won best secondary care facility for 2008 and 2009, not applying in 2010 due to heavy construction, and the ERHA has won best performing RHA four years in a row due to \\\"staff working hard to performance measurement targets\\\". He said the paediatric ward has been changed from clinical in nature to more inviting to the children, including murals, dishes with characters and colourful uniforms for the nurses. They also set up a private room for breast feeding mothers and a play area for the children. At the paediatric ward a letter from a patient was posted on the door thanking the staff for their \\\"kind\\\" and \\\"helpful\\\" service. There was also a section for the Health Ministry Quality Awards that the ward had won. Beharry said that their kitchen area has been improved with specific patient diets being prepared at the main kitchen for individualised care. During the tour of the hospital the Sunday Express was shown their archiving system, implemented September 2011, which is completely wireless and interlinked with other ERHA facilities. Health officials explained that documents like x-rays can be done in Rio Claro and sent to Sangre Grande Hospital via the system without the need for a physical transfer. Dr Nalini Kokaram-Maharaj at the radiology department said their case load per day was equivalent to Mt Hope or San Fernando General Hospital with less than a third of the staff but while these institutions may have workload dating back a couple years theirs date back a couple of weeks. \\\"(We are) one of the most if not the most productive of the regions,\\\" she said. She added that they needed larger facilities and are hoping for funding for an MRI machine in order to be more self-sufficient. They currently have to send patients to Mt Hope and San Fernando General Hospital. Beharry noted they are working on a proposal to take to the Health Ministry to rename Sangre Grande County/District Hospital because it has reached the point where it is a general hospital. Harricharan noted for this fiscal year they are looking to expand their cardiology unit, establish an endoscopy unit and they are \\\"trying hard\\\" to open a fourth operating theatre. The second phase of work on their extended care unit should finish in September this year. Other changes include a new pharmacy building, storage area and medical records area, extension of the radiology building and a waiting room for the Intensive Care Unit. \\\"We try to prioritise with the budget we get every year,\\\" she added. Beharry noted Sangre Grande Hospital has been one of the fastest growing hospitals in this country and since 2007 they have introduced a lot of new services as they had listened to calls from the catchment population for more services closer to their area. Harricharan noted that patient numbers have increased greatly since the new services were introduced including the ophthalmology clinic (239 per cent), oncology clinic had (150 per cent) and orthopaedics (223 per cent), which \\\"drives\\\" them to provide services. She said the number of visits for fiscal 2009-10 has been 75,000 across disciplines. \\\"In spite of the fact that we don't serve as many patients as some of the other RHAs, what we strive to do here is ensure that the quality of service that we deliver is optimal,\\\" she said. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/doctors-not-ready-with-report/article_c3dc747c-56c1-5fa7-8775-40fadcee08c1.html\", \"TITLE\": \" Doctors not ready with report \", \"DATE\": \"Oct 22, 2013 \", \"CONTENT\": \"THE 21-year-old woman who is accused of killing her two-day old baby three weeks ago by stuffing him in a bag and dumping the bag in a river in Sangre Grande, was yesterday remanded in custody at the St Anns Psychiatric Hospital for an additional seven days. Magistrate Alexander Prince, presiding in the Sangre Grande Second Court, remanded Alicia Acevero at the health institution until next week Thursday. This was as a result of doctors at the hospital needing additional time in order to have Aceveros mental evaluation report completed. During her appearance, Prince was informed by the prosecution that doctors had indicated the report could not be made available to the court before next week Wednesday. In addition to this, Prince said he was not willing to consider granting bail in the matter as he was not the resident magistrate presiding over the enquiry. When Acevero first appeared before Magistrate Rae Roopchand on October 9, defence attorney Fareed Ali, made an application for disclosure in the matter. Yesterday he renewed the application as none of the material he requested was made available. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}"
]