[
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/we-like-it-so-the-culture-factor/article_9093f068-99c5-5203-89c6-42bb0d2d0001.html\", \"TITLE\": \" We Like it so: The Culture factor \", \"DATE\": \"May 6, 2013 \", \"CONTENT\": \"Dr Terrence Farrell addresses guests at the launch of his book at the National Library last Thursday. \\u0097Photos: Ayanna Kinsale Dr Terrence Farrell addresses guests at the launch of his book at the National Library last Thursday. \\u0097Photos: Ayanna Kinsale Former deputy governor of the Central Bank, Terrence Farrell, has classified Trinidad and Tobagos economy as underachieving. To support his theory, Farrell, a former CEO of One Caribbean Media Ltd (OCM), has authored a book The Underachieving Society: Development Strategy and Policy in Trinidad and Tobago 1958-2008. It was formally launched last week at the National Library but was sold out on the same day. In explaining the choice of title, Farrell observed that Trinidad and Tobago is operating way below its potential. On the flipside, he reasoned, T&T can hardly be classified as an overachieving society hence his conclusion and diagnosis that the twin island republic was underachieving. The following is an excerpt from the novel titled We Like It So: The Culture Factor. An important argument that should not be discounted too easily is that the people of a country may actually not aspire to the standard of living of the richer and more developed countries. They may choose to work less hard, be less innovative and productive, and consume more because they value leisure, conviviality and pleasure more than they value work, and the income and wealth it produces. In other words some societies may display a combination of values, attitudes and behaviours that do not emphasise wealth accumulation and prosperity in purely economic or material terms. Alternatively, while they may well aspire to greater wealth and economic prosperity, the values, attitudes and behaviours they embrace may lead to their making choices of strategy and policy that ultimately do not conduce to growth and development. The people of Trinidad and Tobago have been stereotyped as having a carnival mentality and enjoying parties and liming. Work is as much or more about socialising and sustaining relationships as it is about producing or contributing. In addition, Trinidad and Tobago has a large number of public holidays. There are fourteen official public holidays and the two Carnival days constitute de facto public holidays, making a total of sixteen public holidays. These attitudes towards work and productivity often mean that systems and processes do not work well. Since citizens do not expect or trust that systems will work well, resort is had early in any transaction to the identification of a contact within the system who can expedite accomplishment of the transaction. This further compromises the efficiency of the system and discriminates in favour of those persons who are well connected. Another aspect of the culture of Trinidadians and Tobagonians is ambivalence towards things local and things foreign. V S Naipaul, Trinidad and Tobago born Nobel Laureate in Literature, has pejoratively described the countrys people as mimic men. Frantz Fanon wrote of the black skins, white masks of the post-colonial elite. On the face, local cultural practices and products are celebrated, vaunted even. Trinidadians and Tobagonians are proud, and justifiably so, of the steel pan musical instrument that was invented here, of the Carnival celebrations that are always described as the biggest in the world, of the gift to the world of calypso and soca music, of the success of the countrys athletes at premier events such as the Olympics, the English Premier League, of the fact that this country is the smallest ever to qualify for the Soccer World Cup (2006), of the contribution to West Indies cricket, and of the phenomenal success of their women at international beauty pageants. For a country of only 1.3 million in an English-speaking Caribbean of only five million, we punch above our weight in the international arena. This is true not only in respect of sports, music and beauty contests. Trinidadians and West Indians more generally have indeed excelled on the international stage in politics, international relations and international law, playing critical roles in introducing the Law of the Sea and the exclusive economic zone, in the efforts at the United Nations and Commonwealth Secretariat to bring an end to apartheid in South Africa, and earlier through the efforts of Jamaican Marcus Garvey, Trinidadian Stokely Carmichael (Kwame Ture) and George Padmore to the pan-African movement, in the development of black consciousness and the success of the civil rights movement in the United States. At the same time, the countrys elite hanker after metropolitan tastes and lifestyles, including foreign travel to metropolitan capitals, and measure their personal achievements against those of people living in those countries. Having grown up with British institutions and practices in law and jurisprudence, medicine, party politics and parliament, these institutions and practices have become the yardstick against which local institutions and practices are routinely measured. This is not to say that no institutional innovations have been made. Trinidad and Tobago moved to republicanism in 1976, while Jamaica, Barbados and other Caribbean territories have remained constitutional monarchies. Yet Trinidad and Tobago, despite being the seat of the Caribbean Court of Justice (to which Barbados and Guyana have acceded), retains the United Kingdom Privy Council as the final court of appeal. Not surprisingly, the intellectual fountains from which the countrys leaders and technocrats drink are located in the metropolitan schools, media and academies. It was Lloyd Best who famously called out the intellectual elites of the region when he opined on the cultural anarchy created by an economy where men - among them the most capable - are forced, by the needs of living, to show excellence in purveying metropolitan propaganda , political and academic; where other men, standing always on the wings of power, have no choice but to preoccupy themselves with public relations; where the working people are confined to technological mimicry and the assembly of parts, where the population seeks dignity in a scramble for consumer durables; and where the political leadership survives by submissiveness to imperial power. Best castigated the plantation mind of the regions intellectual elite. For him, Arthur Lewis was epistemologically an Englishman . . . brought up by Ricardian and Smithian theories . . . he had to be an Englishman. Lewiss model was not suitable for the Caribbean since the Caribbean is constituted from the outside by foreign investors, comprised of transplanted populations brought as slaves and indentured workers, with no households, no production for domestic consumption, and no families. With such a mentality, the political and technocratic elites, which sought to promote development, could hardly be expected to fully come to terms with the Caribbean reality and formulate and implement appropriate policies to foster growth and development. The third cultural characteristic of Trinidad and Tobago, and perhaps Caribbean society as a whole, is the precedence of relationship over rules. The significance of personal relationships (which may have an ethnic dimension) was identified by the Uff Commission of Enquiry speaking on the apparent attempt to influence the placing of a contract in these terms: [R]ather than indicating corruption, we think this is more a reflection on local culture in a society where no one is anonymous and business at any level is made more complicated by the undoubted existence on many levels of personal relationships involving predispositions to favour one person over another. Such a culture cannot be changed but the consequences in terms of potential corruption must be guarded against. Societies that aspire to and achieve development are disciplined in terms of both the setting of rules and in ensuring conformity and obedience to the rules. It is not that there are no rules governing all spheres of life in Trinidad and Tobago, but perhaps because of the size of the society where social networks are numerically small, it is the enforcement of the rules that suffers. The Uff Commission of Enquiry noted as follows: We have observed in the context of contractual issues as well as regulatory matters that there exists a culture of non-enforcement which appears to operate on a mutual basis. Contractors seem reluctant to issue proceedings for payments overdue or to enforce claims and employers in turn refrain from enforcing time obligations which are routinely not complied with. It is not only construction contracts and regulations relating to building construction that are not properly enforced. Lack of enforcement of rules is pervasive. The use of the roadway by drivers in Trinidad and Tobago causes great alarm to visitors. Yet the routine flouting of the rules of the road, leading to a high accident rate, has brought only weak and sporadic enforcement of the traffic laws. Customs regulations are avoided, promoting corruption and reducing government revenues. Rules regarding the acquisition of permissions for land use from the Town and Country Planning Department or for environmental safeguards are often ignored, and the relevant government departments do not apply sanctions. The rules promulgated by the Integrity Commission relating to the compulsory submission of declarations of assets are flouted by persons in public life who are part of the countrys governing elite. In a society where rule enforcement is observed more in the breach, whenever there is an attempt to actually enforce the rules, the sanction may then appear to be exemplary and inequitable. While part of mutual non-enforcement of rules may be attributed to the precedence of relationship over rules, another part may be attributed to the tendency to avoid confrontation since confrontation may escalate dramatically and turn quickly into conflict. One can therefore observe a tendency to threats, bluffing and blustering, with apparently open, vigorous challenge or opposition to some issue, but compromise and accommodation behind the scenes. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/british-pm-launches-unicef-inspiration-programme/article_0a06a29e-82a6-5a94-a11c-15067ddf6954.html\", \"TITLE\": \" British PM launches UNICEF 'Inspiration' programme \", \"DATE\": \"Nov 28, 2009 \", \"CONTENT\": \" British Prime Minister Gordon Brown, along with sports personalities, Darryl Browne and Daren Ganga yesterday visited Fatima grounds on Mucurapo Road for the launch of Unicef's International Inspiration's youth programme. Brown took time out from his Commonwealth Heads of Government schedule to visit several young students who had gathered to celebrate the local launch of the UK-produced initiative which came into being as part of the UK's sport and education campaign for the 2012 Olympics. International Inspiration is a sporting, healthy lifestyle and leisure development programme formulated with a particular focus on developing the holistic wellnes and social inclusion of all children, even the differently abled. The programme has already been launched in Azerbijan, Brazil, Palau, India and Zambia. Representatives of the British Council told the Sunday Express that Brown's visit to T&T for the CHOGM meeting was seen as a good time to launch the local leg of the global initiative. Dr Suleiman Braimoh, UNICEF's representative for Guyana, Suriname and Trinidad and Tobago, said International Inspiration was an excellent complement to the organisation's work with the T&T Government in creating youth friendly environments. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/features/are-you-a-sex-and-the-city-girl/article_8a7f4995-07ec-5cfe-8648-23b12adfd878.html\", \"TITLE\": \" Are You a Sex And The City Girl \", \"DATE\": \"Jul 30, 2015 \", \"CONTENT\": \"Artfully so, they were a mirror to our souls every week - the four women who captured our hearts and minds with their individual personalities, style and essence. The half-hour capsule of real talk in Sex and the City all lent to us identifying with the scenarios that were created for our viewing pleasure. There was no denying their influence on an era. The ladies of Sex and the City, Carrie, Miranda, Charlotte and Samantha bore a frighteningly close resemblance to maybe you or a relative, friend or co-worker. Am I right A six-year run and two movies later, I still indulge in an episode or two whenever I come upon the show while leisurely channel-surfing. But some of us are so addicted to the series we watch the marathons of Sex and the City and love it to the max. In fact we are glued to our seats for hours on end, drinking in every word...The show as we know portrayed four classic women who owned their personalities, perspectives and ideals and made no real apologies for them. In this here 2015, women seem to dare anyone who challenges them to change or re-visit their mindsets. Lets examine the characters.Carrie was, generally speaking, that city girl with small-town ideals to some extent, and her style of dress was totally unique and bohemian. A social butterfly, Madame Bradshaw longed for the little girl dream of marrying her Prince Charming and living happily ever after. She was the type of girl who always ended up looking for love in the wrong places, or should I say, with the wrong men. Sometimes she wanted things to work so badly that she would sacrifice her own happiness and I dare say, dignity at times, just to have him. It seemed as if it was a case of the perpetual womans anthem, Let me give it time and see. She may have gotten caught up in the city girl antics where she didnt truly get to know a guy first before giving away her heart and cookie but she forever believed that she would one day mould the life she craved. She also held on to this one guy (Mr Big) who seemed to be poison to her system but she was apparently repelled by the idea of an antidote. Havent we had at least one guy in our lives whom we knew wasnt good for us; he was non-committed, selfish with his time, came around when he felt like it We understood the struggle we wanted something and we wanted that someone to be the person we wanted that something with. There are millions of us like Carrie.What is it about these men that draw some of us to them Are we somehow wired like men in a sense to want a challenge Or is it that a man may not seem like who we should have but we take him on as a project or better still a challenge..As for Miranda, she was the cynical, black and white type. An attorney by profession, she took her everything has a logical answer into her relationships as well. She would argue a point as passionately as she would in a courtroom. Her life revolved around being analytical and Math-centred; two plus two would always equal four. Everything had to have a plan, a formula or else it couldnt work. Spontaneity was not exactly a freedom, it might as well be a trap. Career was ultimate and no man or child should stand in the way of it or so she thought. One whod come across as a feminist, she was willing to contest the status quo with respect to men in the workplace and in relationships.Charlotte was the prissy one with her head in the clouds. Her vision for life and love seemed borne of fairy tales and sugary stuff. She wanted the white picket fence, or at least to be fenced away from the public at a Park Avenue apartment. She wanted the frills and thrills and knight in shining armour who would love her eternally. She believed that everyone could find their match. Miss York refused to willingly accept that lust is just as good as love. A family life was just as valuable and precious to her as the pieces of art hanging in her gallery and nothing would stop her search to have her truest desires. Faith, hope and patience always win in her eyes.Then theres Miss Jones who feverishly had a thing going on with countless men. She definitely had a healthy libido but she really shed light on how womens outlooks had changed. Women were no longer waiting for a man to make a move; they werent concealing their lustful desires and werent afraid to verbalise agreement to less than committed relationships. Casual sex encounters were run-of-the-mill for her and she made no apology for her lifestyle. Samantha represented women who lived and loved like a man.She had no time to entertain whimsical advances and images of love ever after. But her life was strictly a sexual one of instant gratification, and a man with the goods a man who was well endowed was her momementary prince.You might ask if there are women like this in your midst. Oh yes! Trust me, they are out here in droves and its alarming, quite frankly. I have witnessed them in all their glory and heard enough stories. Women are, well, taking the bull by the horns. Its part of this new (insipid) trend of I am independent and grown thinking. When you think about it, Samantha made promiscuity look coolunfortunately. Its noteworthy though that at different stages, due to lifes circumstances and maybe wisdom, they revised their once-concrete ideals. Samantha tried the monogamous life; Charlotte accepted that what she needed would come from a sweaty man and not the cool, debonair heir; Miranda realised that not everything in life had to unfold methodically; and Carrie, I would say, went against the grain, and stuck to what her heart wanted (at least by the end of the original movie, she got her Mr Big, lock, stock and barrel). I think to some degree, they showed us that sometimes you get exactly what you want with the most unexpected person at the most unexpected time and that following your heart does not have to end badly.By the way, did you ever figure out which SATC girl you are I think Carrie, Miranda and Charlotte spoke to my spirit the most. At one point in my life, I embodied the no grey areas like Miranda but Ive learnt my lesson(s). I live in the town but have country-girl desires, have my own sense of style (which I believe no one but me has to understand), and I certainly believe in happily ever after.nfpeters3434@gmail.com Wedding celebrations can sometimes feature some unusual and surprising traditions from countries all around the world, that we would consider to be extreme. In the following article people share their experiences of weddings they have been to in various countries. Trincity Mall has now become even more fun as FunStation opened its north store last weekend\\u2026 Trevor\\u2019s Edge has gotten a whole lot sharper. The popular reclusive St Augustine tavern is traditionally known as the cultural hub of the \\u201cMiddle East\\u201d. It was the home of the Gillian Moore-inspired \\u201cSongshine\\u201d, the 2000s\\u2019 spoken word showcase that birthed a new generation of poets. Veteran rare calypso acts also featured weekly, during that time, at their \\u201cIndependence to Republic\\u201d concert series. Tobago is gaining international recognition through a destination marketing campaign titled \\u2026 STRAY animals roaming the streets remains a perennial problem in T&T and in many countri\\u2026 \\\"Social media and proper leadership are two vital interventions for Civil Society Organisati\\u2026 \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/daily-walking-prevents-breast-cancer/article_1b861c48-aeff-569c-9fdf-fee07ee0adce.html\", \"TITLE\": \" Daily walking prevents breast cancer \", \"DATE\": \"Nov 2, 2013 \", \"CONTENT\": \"Dr Cory Couillard Dr Cory Couillard New research has found women who walk an hour every day can reduce their risk of developing breast cancer. Even more encouraging, more frequent and vigorous exercise was found to provide additional protection. The study, published in Cancer Epidemiology, Biomarkers & Prevention followed more than 73,000 women over 17 years. Researchers found a 14 per cent reduced risk when compared to women with sedentary lifestyles. Exercise consisting of over seven hours per week was associated with a 25 per cent reduced risk. This is encouraging news for women who arent very active or sporty. The nice message here is, you dont have to go out and run a marathon to lower your breast cancer risk, go for a nice, leisurely walk an hour a day to lower risk, says Alpa Patel, senior epidemiologist. Walking appears to help cut down the amount of body fat that is directly linked to cancer-stimulating hormones such as insulin and oestrogen. Being physically active can improve insulin control and burn fat in high-risk areas of the body. Excess fat around the waist may affect ones breast cancer risk more than the same amount of fat around the hips or thighs. Strength training (exercising with weights) is also beneficial to help burn off abdominal fat. Spot exercising, such as doing sit-ups, can tighten abdominal muscles, but is not an effective way to lose belly fat according to Harvard Medical School. Diet is also important. Pay attention to portion size, and emphasise complex carbohydrates (fruits, vegetables, and whole grains) and lean protein over simple carbohydrates such as white bread, refined-grain pasta, and sugary drinks, they added. Unhealthy saturated and trans fats have also been linked to abdominal obesity and ones breast cancer risk. Saturated and trans fats are commonly found in highly processed foods that are often high in energy and low in essential nutrients. All fats are not harmful to ones health and are actually needed to lose weight, balance hormones and fight cancer. Unsaturated, or healthy fats are found in polyunsaturated and monounsaturated fats. These fats are found primarily in fish, plant oils, seeds and nuts all of which have been shown to lower ones risk of developing breast cancer. Drastically cutting the amount of energy in ones diet, especially while engaging in regular exercise is not recommended. Too little units of energy can force the body into starvation mode, slowing ones metabolism and ironically storing more fat around the mid-section. The best weapon in overcoming breast cancer is the ability to prevent it from occurring in the first place. Its important to apply proactive lifestyle habits in ones life versus reactively trying to treat or reverse cancer when it could be too late. Dr Cory Couillard is an international health columnist that works in collaboration with the World Health Organisations goals of disease prevention and global health care education. Views do not necessarily reflect endorsement. E-mail: drcorycouillard@gmail.com Facebook: Dr Cory Couillard Twitter: DrCoryCouillard TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/woman-and-lover-beaten-by-husband/article_95c84b6a-bab9-11e9-bf59-e3ee9ed2ca65.html\", \"TITLE\": \" Woman and lover beaten by husband \", \"DATE\": \"2 hrs ago \", \"CONTENT\": \"{{description}} Email notifications are only sent once a day, and only if there are new matching items. A woman and her lesbian lover were allegedly beaten by the woman\\u2019s husband after she confessed to an extramarital affair last Saturday. The suspect, a 48 year old fisherman, flew into a rage after the confession and allegedly beat his wife at their home in Charlieville. Police said when the wife called her lover and told her of the attack, the lover went to the house and was allegedly battered by the suspect and his 19 year old son. The suspect and his son allegedly ganged up and beat the lover with their fists and a cutlass, police said. The two women \\u2013the 43 year old Charlieville wife and her 47 year old lesbian lover - went to the Chaguanas police station that night and reported the incident to police. Officers took both women to the Chaguanas District Health Facility and they were transferred to the Eric Williams Medical Sciences Complex. The suspect\\u2019s wife was treated for minor injuries and discharged. Police said that the lover was severely beaten on the head and face, and was warded at hospital. She is being treated at hospital for a fractured jaw, perforated eye ball, sliced tongue and dislodged teeth, police said. Police said the husband also went to the Chaguanas District Health Facility on the night of the incident. He allegedly told officers that his wife\\u2019s lover chopped him with a cutlass on the arm and finger. He received three stitches to the finger and five stitches to the arm. Officers took the husband into custody after he was treated and discharged. The 19 year old son left the home after the incident. Police officers are looking for him. Police said the husband faces charges of assault occasioning bodily harm and assault by beating. Police said the lesbian lover could also be charged with assault occasioning bodily harm. PC Backan of Chaguanas CID is investigating. A PIPE FITTER who told the court he found and kept five protected tortoises, has been arrest\\u2026 Public Administration Minister Marlene McDonald and her husband Michael Carew are still bein\\u2026 Police need help in locating 16-year-old Shakira Moore. A woman and her lesbian lover were allegedly beaten by the woman\\u2019s husband after she confess\\u2026 FOURTEEN-year-old Nicholai Hodge died as a result of two stab wounds to the chest, an autops\\u2026 PRIME Minister Dr Keith Rowley, who spoke yesterdat to CNC3 News following the detention of \\u2026 Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/fitness-for-life/article_0a05e5ea-9b7c-579d-8a4c-df2186856884.html\", \"TITLE\": \" Fitness for Life \", \"DATE\": \"Jan 1, 2015 \", \"CONTENT\": \"Greetings and a very warm welcome to all readers of fitness articles and all those interested in fitness as a lifestyle. The title of this article forms an important part of my philosophy for a good life and it is also the core of my career. Starting from the green and early days as a teenager teaching fitness at my community centre to maturing and being educated in fitness, as well as attending world-class fitness conventions, hosting corporate fitness workshops and keeping focus on my own personal fitness, I count my blessings every day for this very special journey. I hope this innate passion for fitness touches you in some way through these fitness columns I plan to share with you for 2015. What does fitness mean to you Fitness to me means a lot and can take many different angles. In physical education class we are taught that physical activity promotes your physical, emotional, mental and psychological well-being. Physical fitness by definition refers to the ability to carry out daily tasks with vigour and alertness, without undue fatigue and ample energy to enjoy (leisure) pursuits and to meet unforeseen emergencies ACSM (2011)*. As trivial as this may sound to some it is the underlying foundation to happiness, together of course with other important elements not discussed here. Taken from the definition above, here are a few ways (minimum) being physically fit can positively affect your life. Most fitness enthusiasts Im sure can testify to these benefits: Mental: after a good cardio session your brain/cognitive awareness is sharpened. Physical: Better able to do physical functional work: lift, squat, reach, lunge and tri-planar movements. Psychological: A boost to your self-esteem and self-confidence. Emotional: Better able to handle stresses of life. The quality and range of fitness can be specific to the sport or life sport you train for. Each sport or sporting related activity has its own package of fitness requirements. Also, each individual may have different goals for training; some may want the ripped look, some may have injuries and want to function properly without pain, some may desire general fitness or some Crossfit, just to name a few goals. On a general level, the important factor for you is to have a goal, to include fitness of some sort into your life whether it is the tried and true practices of walking, jogging and running or more formal programmes such as Yoga, aerobics, Bootcamp or Functional Training. The bottom line is to keep active. It promotes quality of life. Dont just say its a New Year resolution once more. Make it happen. I would be happy to hear about your start up, your successes, your achievements (or downtime/failures, we all have those!) or, perhaps, how you are motivating others to fitness. Write to me at my e-mail address below and let me know your story. Some of your stories would be shared in this column so we can together inspire others to fitness. Some would remember my last column here in 2013. Since that time I experienced a special blessing; I became a mother. I was blessed with a beautiful baby girl Kaitlan Amanda Jack. I love and adore her. To share a bit about my experience, I would have to say that I now understand what true motherly love and responsibility are all about. Also, the wonders of pregnancy, childbirth and motherhood all confirm to me that there is a loving God who takes care of us all. I would definitely share with you my experience and some fitness guidelines which I followed during and after pregnancy a bit later in these columns. Special thank you to the Fitness Centre Ltd for creating the environment that inspires, from my inception at age 18 to the present. Catch you next week as we take on 2015 together! Please submit your fitness story or your questions to: tenillegonzales@hotmail.com TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/marlene-grilled-for-eight-hours/article_f805a324-bb0c-11e9-8663-5fcd22e380e6.html\", \"TITLE\": \" ...Marlene grilled for eight hours \", \"DATE\": \"7 hrs ago \", \"CONTENT\": \"VISITORS: Arima Mayor Lisa Morris-Julian and Laventille East/Morvant MP Adrian Leonce on Thursday night at the St Joseph Police Station, where they visited Minister of Public Administration Marlene McDonald, who was being held for questioning. \\u2014Photo: JERMAINE CRUICKSHANK {{description}} Email notifications are only sent once a day, and only if there are new matching items. VISITORS: Arima Mayor Lisa Morris-Julian and Laventille East/Morvant MP Adrian Leonce on Thursday night at the St Joseph Police Station, where they visited Minister of Public Administration Marlene McDonald, who was being held for questioning. \\u2014Photo: JERMAINE CRUICKSHANK MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. McDonald and her husband were brought to the Professional Standards Bureau office at Henry Street, Port of Spain, at about 8 a.m. yesterday. Shortly after, Pamela Elder SC and attorney Owen Hinds Jr arrived at the PSB office and went inside. Elder, who is representing McDonald and her husband Michael Carew, remained inside the building until about 2.15 p.m. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. TWO videos which show minors engaged in sexual acts with adults are now engaging the attention of police. This was confirmed by Children\\u2019s Authority chairman Hanif Benjamin yesterday. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. A PIPE FITTER who told the court he found and kept five protected turtles, has been arrested\\u2026 Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/government-cops-respond-to-marlene-mcdonald-s-arrest/article_b8221798-b9e4-11e9-8bc6-afafcc864fa6.html\", \"TITLE\": \" Government, cops respond to Marlene McDonald's arrest \", \"DATE\": \"21 hrs ago \", \"CONTENT\": \"Port of Spain South MP Marlene McDonald FLASHBACK: Newly appointed Minister of Public Utilities Marlene McDonald is congratulated by, from left, close friend Michael Carew, Jean Elder, chairman of the Port of Spain South Constituency, Port of Spain \\u201ccommunity leader\\u201d Cedric (Burkie) Burke, Kenroy Dopwell and Sharon Felix at President's House, St Ann's, after she was sworn in. \\u2013Photo: CURTIS CHASE Minister of Public Administration, Marlene McDonald MP Marelene McDonald's constituency office. {{description}} Email notifications are only sent once a day, and only if there are new matching items. Port of Spain South MP Marlene McDonald Government this afternoon acknowledged for the first time the police investigation involving Public Administration Minister Marlene McDonald. In a brief statement issued at 2:39p.m. newly appointed Communications Minister Donna Cox said: \\\"The Government of the Republic of Trinidad and Tobago (GoRTT) wishes to confirm that a search warrant was executed at the home of Minister of Public Administration the Honourable Marlene McDonald this morning (8 August 2019). However, this is an ongoing police investigation and further information will be provided as it is made available by the Trinidad and Tobago Police Service.\\\" Shortly after the Government's statement, the TTPS issued an statement of its own. The TTPS stated: \\\"Police officers investigating alleged corruption offences have arrested and taken into custody, Government Minister Marlene McDonald and her husband for questioning. They were detained earlier today, Thursday 8th August 2019. Enquiries are ongoing at this time and more information will be provided when it becomes available.\\\" At around dawn today, McDonald and her husband were detained. McDonald, the Member of Parliament for Port of Spain South was taken into police custody. The arrests were made at the couple's home at around 4a.m. by police executing a search warrant. The detention came after police went to the Director of Public Prosecutions Roger Gaspard with an investigation file on Tuesday. McDonald, a Cabinet minister, is being investigated on the allegation of misappropriation of public funds. MP Marelene McDonald's constituency office. The Express was told that McDonald, complained of feeling unwell and was treated at hospital. On June 1, 2017, Prime Minister Dr Keith Rowley advised then President Anthony Carmona to revoke the appointment of McDonald who was then Minister in the Ministry of Public Utilities. Minister of Public Administration, Marlene McDonald McDonald had only recently been sworn in as Minister in the Ministry of Public Utilities after a sixteen month period of absence from the Cabinet. Why was MacDonald fired then? McDonald met with Prime Minister Dr Keith Rowley the morning of her firing, as a result of the controversy caused by her choice of guests attending her swearing-in ceremony at the President's House in St Ann's days before. The commotion surrounds the presence of reputed \\\"community leader\\\" Cedric \\\"Burkie\\\" Burke, who accompanied contractor Kenroy Dopwell to the event. Senior elements of the national security community had expressed alarm at the presence of Burke, who has been engaging their attention. FLASHBACK: Newly appointed Minister of Public Utilities Marlene McDonald is congratulated by, from left, close friend Michael Carew, Jean Elder, chairman of the Port of Spain South Constituency, Port of Spain \\u201ccommunity leader\\u201d Cedric (Burkie) Burke, Kenroy Dopwell and Sharon Felix at President's House, St Ann's, after she was sworn in. \\u2013Photo: CURTIS CHASE Not only was he present, but Burke was introduced by her to the President and posed for pictures with Carmona Carmona. On August 2, Rowley reappointed McDonald, to the post of Minister of Public Administration. Burke was detained on Monday by police who seized his electronic devices including cell phones and laptops. He was questioned and released on Wednesday morning. Reporting by Alexander Bruzual Police need help in locating 16-year-old Shakira Moore. A woman and her lesbian lover were allegedly beaten by the woman\\u2019s husband after she confess\\u2026 FOURTEEN-year-old Nicholai Hodge died as a result of two stab wounds to the chest, an autops\\u2026 PRIME Minister Dr Keith Rowley, who spoke yesterdat to CNC3 News following the detention of \\u2026 Minister in the Ministry of Public Administration and Communications, Marlene Mc Donald spen\\u2026 Government Minister Marlene McDonald was dealt a third strike to her political career yesterday with her arrest by police on corruption allegations. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/pm-no-one-is-above-the-law/article_7b548146-bb0d-11e9-bd37-6b3070eef214.html\", \"TITLE\": \" PM: No one is above the law \", \"DATE\": \"10 hrs ago \", \"CONTENT\": \"AWAITING OUTCOME: Keith Rowley {{description}} Email notifications are only sent once a day, and only if there are new matching items. AWAITING OUTCOME: Keith Rowley THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. The Prime Minister admitted he was saddened by what had happened to McDonald, but reiterated that no one was above the law. And Government Minister Fitzgerald Hinds said he and other colleagues were surprised when they heard the news of McDonald\\u2019s arrest on Thursday. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. TWO videos which show minors engaged in sexual acts with adults are now engaging the attention of police. This was confirmed by Children\\u2019s Authority chairman Hanif Benjamin yesterday. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. A PIPE FITTER who told the court he found and kept five protected turtles, has been arrested\\u2026 Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/la-rufin-the-gem-of-moruga/article_0b8db545-6a49-5aac-8ef0-82e0a8077cb2.html\", \"TITLE\": \" La Rufin, the gem of Moruga \", \"DATE\": \"Feb 28, 2010 \", \"CONTENT\": \" Forgotten by most except the elders with long memories, La Rufin is re-emerging as the gem of Moruga. It was swept aside to a dark corner, covered with dirt and neglect. Today it is a different story. Its beach, the River of Hope, and the carefree lifestyle make this village unique in many ways. It has one of the two remaining spring bridges that are suspended by cable. The other bridge is over the Marianne River at North Coast, Blanchisseuse. The La Rufin bridge was constructed over a century ago to assist landowners in transporting their agricultural crops from the estates to Moruga. In 1993, on Carnival Monday, the bridge collapsed after years of neglect, trapping dozens of vehicles belonging to families who had gone to the famed La Rufin beach for a Carnival escape. At that time there were only 50 people living on the banks of the river. They led a rescue effort that got the families over the river by boat, then constructed rafts, using oil drums as floats, to take the vehicles across. The village has grown over the years, and now there are some 700 people, mostly fisherfolk, who earn their living from fishing in the river and nearby sea at Gran Chemin. La Rufin beach lies to the east of Gran Chemin and is accessed via La Rufin Road, which intersects Moruga Road shortly before reaching Gran Chemin. The narrow road crosses the River of Hope and ends abruptly on the beach. The beach has no human habitation or life guards, but it is safe for bathing. No one has ever drowned on that beach, according to the locals. The beach is part of a ten-mile stretch of sandy shoreline suitable for camping. La Rufin means the end of the road. It was the name given to a cacao estate overlooking the sea which was owned by the Herrera family. Abandoned to some extent, there are some areas that are cultivated by squatters.The soil is fertile and suitable for growing fruit crops such as avocado, papaw and mango. The River of Hope has a place in history and dates back to 1498, when explorer Christopher Columbus reached Trinidad. Peter Glodon, a longtime resident of the village, and president of Moruga/La Rufin Fishing Cooperative, said, \\\"It is really the Moruga River, but the name was changed in 1998 by the Moruga 500 Committee when an attempt was made by villagers of Gran Chemin to celebrate the 500-year visit by Columbus in 1498.\\\" Columbus was sailing along the south coast of Trinidad and needed drinking water, the history books record. He and his crew kept their eyes looking for a river to get fresh water. They first spotted the beach and named it Punta de la Playa. He anchored in the bay and sent his men to fill their casks with water from the Moruga River. The river holds the key to future hope and development of the village. Richard Gopaul has been living at La Rufin for many years. He witnessed the migratory pattern into the village as it unfolded over the years. \\\"I believe those who came here were looking for a way out of pollution. The air here is pure and the way of life is simple.\\\" He said it is a small community with people interested in advancing their fishing skills. There are no public facilities or recreation grounds. Along the road leading to the beach are several well-stocked bars, which serve as meeting places for residents. Along the River of Hope, some 70 boats are moored. There are no storage facilities for fish. Vendors from many parts of Trinidad purchase fresh fish at La Rufin because the wholesale prices are reasonable. The future of La Rufin lies in the expansion of facilities for the fishermen as well as development of a plan to make the village a tourist attraction. Glodon said, \\\"We have the beach for safe bathing, the river for fishing and aquatic sports, and in the area of agriculture there are vast lands suitable for vegetable and other crops.\\\" He would like the Government to develop a camping site in close proximity to the river where families could spend their leisure time. He regretted that earlier plans to develop such a programme close to the beach were not successful. \\\"It should be given a second try, so we live in hope,\\\" he said. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/questions-with-karlon-richards/article_a58fac29-7171-587a-aa6c-a27aa6583ae5.html\", \"TITLE\": \" 21 Questions with Karlon Richards \", \"DATE\": \"Jul 28, 2011 \", \"CONTENT\": \"Queen of the road: Marianne Vos of the Netherlands won the gold medal in the women's road race yesterday, holding off Britain's Elizabeth Armitstead in a rain-drenched sprint on The Mall. \\u0097Photo: AP Queen of the road: Marianne Vos of the Netherlands won the gold medal in the women's road race yesterday, holding off Britain's Elizabeth Armitstead in a rain-drenched sprint on The Mall. \\u0097Photo: AP 1. What quality do you like most in women I truly admire the ability of women to multi-task work, school and family life. 2. Your happiest moment Copping the title, as it brought with it a sense of pride and ambassadorship. 3. Your secret fear Failure 4. Which living person do you admire most I admire my four brothers, especially my second brother Keevin, he is intelligent, focused, goal oriented and most importantly successful. His observance of family life is the key which keeps him grounded. 5. What quality do you value most in your friends both male and female Honesty and loyalty. These are the virtues that defines friendship. 6. What is your greatest extravagance I guess it is time. It is also the most valuable resource due to the time spent developing my craft,modeling and athletics. 7. The place you would like to visit before you die Rome 8. What is your favourite journey Seeing the growth of my three nephews. It is quite a rewarding journey for me to play a significant role in the development of young impressionable minds. 9. What advice would you give to people wishing to enter your field To have God as your focus and friends that constructively criticise and motivate you. As a model you also need to have a high self-esteem as the industry is cruel and competitive.Someone is always trying to take your spot. 10. What is your current state of mind Focused 11. What is the trait you most deplore in others I deplore dishonesty. 12. What is your greatest joy The realisation that not only myself but also my family are truly blessed. 13. What is your biggest turn on in a woman Those hips don't lie... LOL and confidence of course. 14. What is your guilty pleasure Hmmmm *BIG SMILE* If you know me you'll know my guilty pleasure. My lips are sealed. 15. What is your lowest depth of misery Growing up in a large single income family meant that I wasn't always afforded the luxury and sometimes necessities needed to maintain a balanced and healthy lifestyle. 16. What is your pet peeve RACIALISM 17. What do you get complimented most about I am told I have innocent eyes 18. When was the last time you cried Its been a while 19. What was the first thing you did this morning Prayed and thanked God for another day 20. What do consider your most cherished virtue My blatant honesty. 21. If you had one personal wish (which you alone can benefit from hence world peace, etc, not applicable) what would it be A hall pass to heavenPersonal highlights Karlon Richards is the holder of the title of Mr Trinidad and Tobago/World. The 26 year-old Financial Advisor is currently pursuing his BA in Human Resource Management through the University of London. He is single and spends his leisure time training and developing himself as both an athlete and model. His watchwords are,\\\" Our deepest fear is not that we are inadequate rather that we are powerful beyond measure.\\\" \\\"Even though I currently hold the title Mr Trinidad and Tobago World I maintain a humble persona through family life and my relationship with God. I am passionate about children as I believe children who are loved and cared for will become instrumental in the development of our society. It is therefore my ambition to use my capacity as Mr TnT World to influence the lives of the less fortunate and misguided children, one at a time.\\\" TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/these-men-are-rowing-from-portugal-to-trinidad/article_29570b7a-ca88-5d87-a138-8f0aa04816be.html\", \"TITLE\": \" These men are rowing from Portugal to Trinidad \", \"DATE\": \"Mar 3, 2016 \", \"CONTENT\": \"ARMED with an adventurous spirit and no rowing experience, five British men have embarked on what they hope will be a record-setting expedition across the Atlantic ocean from Europe to Trinidad. The men, dubbed \\u201cTeam Essence\\u201d, set out on February 7 from Lagos, a town in the south of Portugal, on the transatlantic journey. They will set the record in Venezuela, but set their finish line at The Crews Inn Hotel, for around March 30. The team comprise Matthew Bennet, 37, Oliver Bailey, 39, Jason Fox, 39, Aldo Kane, 38, and Ross Johnson, 37. According to their website www.team-essence.com the five man team is attempting to break the transatlantic rowing record of 52 days, 23 hours from Portugal to Venezuela (3,807 miles). They are hoping to make the journey in 46 days. \\u201cThe passage from the Algarve region of Portugal to Venezuelan landmass, thereby achieving a continent to continent crossing, covers a vast swathe of the mid Atlantic and is by far the most challenging of all the Atlantic crossings, 500 miles further than the more popular route from the Canary Islands to Antigua. On this route will likely encounter extreme weather, wildlife and we hope, considerable natural beauty to offset the physical toil we are set to endure. In a relative sense, many Atlantic crossings have taken place since the advent of the organised race in 1997, but our chosen passage differs considerably in its length and unfavourable conditions\\u201d, the team stated. According to Francesca Hunt of the team's administration, the men have been rowing unassisted, that is, \\u201cno support boat, and no engine, using just the oars to get them across from Europe to Trinidad, stopping briefly for 30 minutes in Venezuela to set the world record (this has never been done by a team before). They have raised over \\u00a3100,000.00 for the NSPCC (National Society for the Prevention of Cruelty to Children), a large children's charity in the United Kingdom\\u201d. The website also gave brief details on the lifestyles and careers of the men, who have embarked on the amazing expedition. According to the website, the idea behind the transatlantic journey came from Bennet, a former military police officer, security contractor in Iraq, and financial trader. \\u201cAs a bachelor in his mid 30's Mathew decided that he would like to embark on a adventure of a life time with friends before its too late. Having seen a programme describe rowing the Atlantic advertised as one of the most physically enduring challenges on the planet, he set about enlisting a group of friends that he believed, not only could endure such a challenge but that would also make it enjoyable. After a small amount of persuasion assisted by a large amount of beer we now have 'Team Essence' who really are the rogues of ocean rowing\\u201d, stated Bennet's profile. Bailey has a career in finance, but has engaged in many sports and activities such as ski-touring, climbing, running and CrossFit in his leisure time. Fox joined the Marine Commandos at 16, and was later was a member of the Special Forces and then Special Boat Services. He left his military career behind in 2012 and became a security consultant as well as engaged in skiing, climbing, and skydiving. Kane joined the Royal Marine Commandos and became one of the youngest snipers in the UK armed forces. He has since left the Royal Marines and now works with some of the largest film and television production companies operating in hostile environments. Johnson was also a member of the Royal Marines having joined when he was 16, and has passed both commando and sniper training by 18 years old. He has served in middle and far east, and Afghanistan. He has switched careers to investment banking and but also has a keen interest in adventure and extreme sports, skiing, mountaineering, skydiving, freediving and is also an avid crossfit enthusiast. Follow their Twitter for location updates and images. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/it-s-part-of-a-diabolical-plan/article_a8d6c10c-bb0c-11e9-b669-5bce36994535.html\", \"TITLE\": \" It\\u2019s part of a diabolical plan \", \"DATE\": \"4 hrs ago \", \"CONTENT\": \"\\u2018PM get like a mouse\\u2019: Dr Roodal Moonilal {{description}} Email notifications are only sent once a day, and only if there are new matching items. \\u2018PM get like a mouse\\u2019: Dr Roodal Moonilal Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. There may be a more diabolical plan afoot, of which today is one small piece, and they may be up to no good and up to a \\u00addiabolical plan that may or may not involve us,\\u201d said Moonilal. He was speaking at the United \\u00adNational Congress (UNC) \\u201cpavement meeting\\u201d in the Barataria/San Juan constituency on Thursday\\u2014\\u00adthe same day McDonald and her husband were detained by police for questioning on corruption-related matters. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. TWO videos which show minors engaged in sexual acts with adults are now engaging the attention of police. This was confirmed by Children\\u2019s Authority chairman Hanif Benjamin yesterday. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. A PIPE FITTER who told the court he found and kept five protected turtles, has been arrested\\u2026 Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/go-barefoot/article_4a076960-ffbd-5710-b6e8-8cd782144e48.html\", \"TITLE\": \" GO BAREFOOT \", \"DATE\": \"Oct 28, 2010 \", \"CONTENT\": \" 'Barefoot and pregnant' is an image that has been associated with disempowered women, dependent and entangled in a cycle of poverty, frustration and self-negation from limited life chances resulting from unplanned, unaffordable pregnancies. Similarly, aspects of the feminist movement have also frowned on lengthening and thinning heels on women's shoes as similar representations of internalised repressions. In fact, shoes and rising heels have been associated with improved standards of living, and lifestyles that allow persons to afford shoes to potect themselves from dreaded poverty-associated diseases, and the roughness of the ground. Now leading women in the civil society movement have adopted the metaphor at least half of it, 'barefoot' and extended it, to remind the world of the violations of human rights around the world. Go barefoot lose your shoes is the rallying call to the world to remind ourselves of these violations. Led by CIVICUS a world alliance of civil society interests, based in South Africa and headed by Ingrid Srinath men and boys, women and girls shed their shoes and trekked barefooted through most of the CIVICUS World Assembly activities in Montreal recently, to signal their commitment to defending the rights of persons around the world. On Human Rights Day, December, 10 mark the date - the CIVICUS led campaign Every Human Has Rights will rally people to focus, even for a few moments, to think about other people whose rights have been violated in the hope of building understanding and to begin to make the fight for human rights part of everyone's lives. This year's rally around the slogan Go Barefoot Lose Your Shoes, will zero in on people living in poverty people who don't have food to put on their table, let alone shoes to put on their feet. In particular, we may want to think of the women and children in the some 20 per cent of the population of Trinidad and Tobago whose existence hovers around the 'poverty line'. I have found that more horrifying than what is conjured by the metaphor of 'barefoot and pregnant', is the statistic of 20 per cent of our population being barely able to afford life's basics, given that T&T's Gross Domestic Product (GDP) per head is said to be some US$20,000. In lay terms, that means, that if this country's wealth was more equitably distributed, every individual will be earning some TT$120,000 a year. Human Rights Day was introduced to keep focus on the Universal Declaration of Human Rights, the anniversary of this Declaration with its 30 Articles of the rights of men and women. In printed form, the 9 cm by 12 cm booklet of 15 pages defines human rights as right to life, liberty, security, property, education, equality before law, freedom of thought, religion, opinion, peaceful assembly, political participation, equal pay for equal work, right to join trade unions, right to a standard of living adequate for health and well being. Other less known, are 'right to nationality', family, equal access to the public service, free development of personality and right to protection of moral and material interests from any scientific, literary or artistic production. Trinbagonians, with the endemic liming culture would be pleased to know it also includes the right to participate in cultural life, enjoy the arts, share in scientific achievement as well as note this \\\"rights to the freedom to rest and leisure and periodic holidays with pay\\\". It is clear that many of these rights still point to the unequal status of women in many parts of the world where women still do not enjoy right to property, freedom of thought, equal pay for equal work, and right to enjoy adequate standard of living for health and well-being and access to social and public services and utilities, and many have no prospect of experiencing \\\"rights to the freedom to rest and leisure and periodic holidays with pay\\\". Go Barefoot Lose your Shoes, is based on the belief that the world would be a better place if every person walked a mile in another person's. Wouldn't it Try it and at noon on December 10, take off your shoes, step out onto the street and walk around to reognise that Every Human Has Rights. Some details in the box on what you can do. Dr Kris Rampersad is a media, cultural and literary consultant, and author of Through the Political Glass Ceiling Race to Prime Ministership by Trinidad and Tobago's First Female. Email kriscivica@ yahoo.com. From blog, Demokrissy: http:// kris-rampersad.blogspot.com/2010/10/go-barefoot-for-human-rights.html TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/ensuring-the-spa-is-up-to-par/article_367cafb5-d550-5ef3-acb7-d1141e9b49cb.html\", \"TITLE\": \" Ensuring the spa is up to par \", \"DATE\": \"May 7, 2013 \", \"CONTENT\": \" The worldwide growth in spa services to men and women has accelerated and evolved into many different definitions. These days, all kinds of establishments have the word spa included in signage and promotional material. But does putting the word spa on something make a place of beauty or leisure a spa Spas have a long history going back thousands of years. Spas were known in times dating back to Babylonian, Greek and Roman times. They were typically located at hot-springs or mineral baths. The word spa is thought to have derived from the Belgium town of Spa that was known as a place of healing. Another theory is that it is an acronym for the Latin phrase, salus per aquae or health through water. Whatever, this leisure industry, which is still in its infancy, is estimated to be worth $40 billion yearly, with about 50,000 spas doing business globally. Spas have emerged as entities that bring together many different cultures, traditions and knowledge in the search for wellness. The current state of the worlds consciousness about our quality of life is reflected in ageing boomers and their offsprings search for how to live well in a sustainable way. More women and increasingly men worry about how to reverse the effects of ageing and pollutants on our bodies. The stress of modern living has generated a need for spaces that offer the wealth of the worlds wellness practices. This has been defined as Conshumanism and has seen a 20 per cent yearly growth in the industry and the evolution of spas in general. The list is amazing. Your choices now include the day spa, the destination spa, the resort/hotel spa, the medical spa or Medi-Spa, the mineral spring spa, the club spa, the cruise ship spa and the airport spa. Each type focuses on providing different services (ranging from surgery to metaphysical (energy work), ambience and results. Though, they all aim at improving their clients overall feelings of well-being and confidence. In Trinidad, almost any place that provides facials and nail services tags itself as a spa, even when the establishment is essentially a beauty salon providing haircuts in a noisy, un-tranquil environment. There are what some refer to as feel-good or luxury spas, where you get pampered with massages, facials, manicures and pedicures set in an upscale environment with wine or champagne being served. Weve also seen the growth of more invasive and high-tech spas offering laser treatments for hair removal and skin resurfacing, plastic surgery including liposuction with injectable fillers and Botox in high demand. These services fall under the Medical or Medi-Spa labels and should only be performed by trained professionals such as doctors and or medical aestheticians. Other less invasive procedures such as microdermabrasion and skin peels fall into this category. The type of spa that you attend depends on what youre looking for. If you just want to de-stress then the feel-good, luxury spa is the place for you. If youre looking to repair a skin condition then you need a spa manned by a dermatologist, plastic surgeon or a certified medical aesthetician. These professionals are well versed in the science of the skin, skin-care treatments and procedures. Hopefully, they will have their certificates and diplomas on display. Be warned! There are unscrupulous spa operators who are able to purchase expensive equipment and products and offer services with minimally trained, uncertified attendants. People are reporting that theyve attended laser clinics only to be badly burned and unhappy with the results. Before any laser treatment make sure that the proposed laser is suitable for your skin-type. The ND YAG Laser is a hair removal system that works best on olive, tanned, dark skin and dark coarse hair. Others have claimed that they received a cursory consultation that did not question their skin-care regimen or lifestyle. When you call to book an appointment make sure that the customer service representative is knowledgeable about the equipment, products and treatments being offered. If they cant answer your questions satisfactorily you should look elsewhere. These operators typically offer very little follow-up and after-care. Youre on your own! Spa equipment is another area of concern. There are different types of microdermabrasion machines on the market. Some cost thousand of dollars and come with ISO certification. While others cost hundreds and provide inferior results. Training and experience are critical in the type of care and results you receive and achieve. In professional circles, the line is: its not the machine but the doctor operating that makes the difference. Ask questions; protect your skin, yourself and your wallet. If youve been a client of a spa for years and you see no improvement in skin clarity, reduction in the size of pores, acne breakouts, wrinkles or fine lines then you need to do research into what treatments or procedures will give you the results that you desire. You also need to be realistic in your expectations. If youve suffered with a skin condition since your teenage years then one treatment or procedure is probably not going to give you satisfaction. Your aesthetician will probably recommend a course of treatment lasting weeks or even months. The Trinidad and Tobago spa industry is unregulated. Consumers have no authority or regulatory body to seek redress for botched treatments or procedures. Thus the onus is on potential clients to educate themselves and to ask questions. Industry prices vary wildly, though luxury (upscale) and Medi-Spa services tend to cost more. Finally, consumers of what is considered to be a leisure Industry need to insist on proof of qualification. This is the first step to ensuring a positive and rewarding experience. Lydia Ramesar is a Canadian-trained advanced medical aesthetician and the owner/operator of TruKomplexion Unisex Medi-Spa. For further information e-mail trukomplexion@gmail.com TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}"
]