[
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/pm-no-one-is-above-the-law/article_7b548146-bb0d-11e9-bd37-6b3070eef214.html\", \"TITLE\": \" PM: No one is above the law \", \"DATE\": \"10 hrs ago \", \"CONTENT\": \"AWAITING OUTCOME: Keith Rowley {{description}} Email notifications are only sent once a day, and only if there are new matching items. AWAITING OUTCOME: Keith Rowley THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. The Prime Minister admitted he was saddened by what had happened to McDonald, but reiterated that no one was above the law. And Government Minister Fitzgerald Hinds said he and other colleagues were surprised when they heard the news of McDonald\\u2019s arrest on Thursday. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. TWO videos which show minors engaged in sexual acts with adults are now engaging the attention of police. This was confirmed by Children\\u2019s Authority chairman Hanif Benjamin yesterday. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. A PIPE FITTER who told the court he found and kept five protected turtles, has been arrested\\u2026 Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/it-s-part-of-a-diabolical-plan/article_a8d6c10c-bb0c-11e9-b669-5bce36994535.html\", \"TITLE\": \" It\\u2019s part of a diabolical plan \", \"DATE\": \"4 hrs ago \", \"CONTENT\": \"\\u2018PM get like a mouse\\u2019: Dr Roodal Moonilal {{description}} Email notifications are only sent once a day, and only if there are new matching items. \\u2018PM get like a mouse\\u2019: Dr Roodal Moonilal Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. There may be a more diabolical plan afoot, of which today is one small piece, and they may be up to no good and up to a \\u00addiabolical plan that may or may not involve us,\\u201d said Moonilal. He was speaking at the United \\u00adNational Congress (UNC) \\u201cpavement meeting\\u201d in the Barataria/San Juan constituency on Thursday\\u2014\\u00adthe same day McDonald and her husband were detained by police for questioning on corruption-related matters. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. TWO videos which show minors engaged in sexual acts with adults are now engaging the attention of police. This was confirmed by Children\\u2019s Authority chairman Hanif Benjamin yesterday. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. A PIPE FITTER who told the court he found and kept five protected turtles, has been arrested\\u2026 Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/marlene-grilled-for-eight-hours/article_f805a324-bb0c-11e9-8663-5fcd22e380e6.html\", \"TITLE\": \" ...Marlene grilled for eight hours \", \"DATE\": \"7 hrs ago \", \"CONTENT\": \"VISITORS: Arima Mayor Lisa Morris-Julian and Laventille East/Morvant MP Adrian Leonce on Thursday night at the St Joseph Police Station, where they visited Minister of Public Administration Marlene McDonald, who was being held for questioning. \\u2014Photo: JERMAINE CRUICKSHANK {{description}} Email notifications are only sent once a day, and only if there are new matching items. VISITORS: Arima Mayor Lisa Morris-Julian and Laventille East/Morvant MP Adrian Leonce on Thursday night at the St Joseph Police Station, where they visited Minister of Public Administration Marlene McDonald, who was being held for questioning. \\u2014Photo: JERMAINE CRUICKSHANK MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. McDonald and her husband were brought to the Professional Standards Bureau office at Henry Street, Port of Spain, at about 8 a.m. yesterday. Shortly after, Pamela Elder SC and attorney Owen Hinds Jr arrived at the PSB office and went inside. Elder, who is representing McDonald and her husband Michael Carew, remained inside the building until about 2.15 p.m. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. TWO videos which show minors engaged in sexual acts with adults are now engaging the attention of police. This was confirmed by Children\\u2019s Authority chairman Hanif Benjamin yesterday. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. A PIPE FITTER who told the court he found and kept five protected turtles, has been arrested\\u2026 Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/opinion/columnists/society-steeped-in-corruption/article_2f748644-185c-11e9-91db-679e194d4402.html\", \"TITLE\": \" Society steeped in corruption \", \"DATE\": \"Jan 14, 2019 \", \"CONTENT\": \"{{description}} Email notifications are only sent once a day, and only if there are new matching items. Sometime in 2017, I wrote a column in which I counselled Prime Minister Dr Keith Rowley to refrain from hurling allegations of corruption against ministers and senior officials of the People\\u2019s Partnership government unless or until such time as some of them have been charged with serious corruption-related criminal offences. By then, I had reasoned most citizens had grown fed up with such allegations being made by parties in power and those in opposition, with no proof produced as they exchanged places every five years from 1986 when the People\\u2019s National Movement was first voted out of office after a 20-year grip on power. The average person knew or believed there was rampant corruption involving PNM ministers, and the overwhelming vote they gave the National Alliance for Reconstruction was fuelled by expectations that they would finally see \\u201cbig sawatees\\u201d hauled before the courts in handcuffs, with many of the crooks ending up behind bars like the common criminals they were. IN yet another incident which has had the effect of piling \\u00adembarrassment upon embarrassment for the authorities, a convict walked out of the Golden Grove facility in Arouca on Thursday, and was on the run up to last night. THE West Indies has had a phenomenal number of exceptional cricketers in its history. The captains have been mostly \\u00admiddling. I restricted the playbooks to those of Frank Worrell, Richie Benaud and Mike Brearley simply because they were known as thinking men; able in both the technical and \\u201cman-management\\u201d aspects of the game. International Youth Day is approaching. It is time for the youth of this country to stand up and make their voices heard. It is time to become more \\u00adinvolved in the political process to put an end to the corruption and mismanagement taking place far too often and for too long. Recently, the press \\u00adreported that a mother was in tears after her victim impact statement was read out in court during the trial of the accused for her son\\u2019s murder. She cried out for answers as to the reason the accused, having robbed her son of his \\u00adcellphone, had killed him. While the horizon must seem unrelievedly grim to many citizens, once in a while a few specks of bright light appear to \\u00adrelieve the gloom. And so it was \\u00adrecently when it was announced that the country\\u2019s first drug treatment court was to be established within three months. Regarding the arrest of Minister Marlene McDonald in the ongoing investigation of corruption charges levelled against her, Dr Rowley bought that wholesale. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/woman-and-lover-beaten-by-husband/article_95c84b6a-bab9-11e9-bf59-e3ee9ed2ca65.html\", \"TITLE\": \" Woman and lover beaten by husband \", \"DATE\": \"2 hrs ago \", \"CONTENT\": \"{{description}} Email notifications are only sent once a day, and only if there are new matching items. A woman and her lesbian lover were allegedly beaten by the woman\\u2019s husband after she confessed to an extramarital affair last Saturday. The suspect, a 48 year old fisherman, flew into a rage after the confession and allegedly beat his wife at their home in Charlieville. Police said when the wife called her lover and told her of the attack, the lover went to the house and was allegedly battered by the suspect and his 19 year old son. The suspect and his son allegedly ganged up and beat the lover with their fists and a cutlass, police said. The two women \\u2013the 43 year old Charlieville wife and her 47 year old lesbian lover - went to the Chaguanas police station that night and reported the incident to police. Officers took both women to the Chaguanas District Health Facility and they were transferred to the Eric Williams Medical Sciences Complex. The suspect\\u2019s wife was treated for minor injuries and discharged. Police said that the lover was severely beaten on the head and face, and was warded at hospital. She is being treated at hospital for a fractured jaw, perforated eye ball, sliced tongue and dislodged teeth, police said. Police said the husband also went to the Chaguanas District Health Facility on the night of the incident. He allegedly told officers that his wife\\u2019s lover chopped him with a cutlass on the arm and finger. He received three stitches to the finger and five stitches to the arm. Officers took the husband into custody after he was treated and discharged. The 19 year old son left the home after the incident. Police officers are looking for him. Police said the husband faces charges of assault occasioning bodily harm and assault by beating. Police said the lesbian lover could also be charged with assault occasioning bodily harm. PC Backan of Chaguanas CID is investigating. A PIPE FITTER who told the court he found and kept five protected tortoises, has been arrest\\u2026 Public Administration Minister Marlene McDonald and her husband Michael Carew are still bein\\u2026 Police need help in locating 16-year-old Shakira Moore. A woman and her lesbian lover were allegedly beaten by the woman\\u2019s husband after she confess\\u2026 FOURTEEN-year-old Nicholai Hodge died as a result of two stab wounds to the chest, an autops\\u2026 PRIME Minister Dr Keith Rowley, who spoke yesterdat to CNC3 News following the detention of \\u2026 Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/government-cops-respond-to-marlene-mcdonald-s-arrest/article_b8221798-b9e4-11e9-8bc6-afafcc864fa6.html\", \"TITLE\": \" Government, cops respond to Marlene McDonald's arrest \", \"DATE\": \"21 hrs ago \", \"CONTENT\": \"Port of Spain South MP Marlene McDonald FLASHBACK: Newly appointed Minister of Public Utilities Marlene McDonald is congratulated by, from left, close friend Michael Carew, Jean Elder, chairman of the Port of Spain South Constituency, Port of Spain \\u201ccommunity leader\\u201d Cedric (Burkie) Burke, Kenroy Dopwell and Sharon Felix at President's House, St Ann's, after she was sworn in. \\u2013Photo: CURTIS CHASE Minister of Public Administration, Marlene McDonald MP Marelene McDonald's constituency office. {{description}} Email notifications are only sent once a day, and only if there are new matching items. Port of Spain South MP Marlene McDonald Government this afternoon acknowledged for the first time the police investigation involving Public Administration Minister Marlene McDonald. In a brief statement issued at 2:39p.m. newly appointed Communications Minister Donna Cox said: \\\"The Government of the Republic of Trinidad and Tobago (GoRTT) wishes to confirm that a search warrant was executed at the home of Minister of Public Administration the Honourable Marlene McDonald this morning (8 August 2019). However, this is an ongoing police investigation and further information will be provided as it is made available by the Trinidad and Tobago Police Service.\\\" Shortly after the Government's statement, the TTPS issued an statement of its own. The TTPS stated: \\\"Police officers investigating alleged corruption offences have arrested and taken into custody, Government Minister Marlene McDonald and her husband for questioning. They were detained earlier today, Thursday 8th August 2019. Enquiries are ongoing at this time and more information will be provided when it becomes available.\\\" At around dawn today, McDonald and her husband were detained. McDonald, the Member of Parliament for Port of Spain South was taken into police custody. The arrests were made at the couple's home at around 4a.m. by police executing a search warrant. The detention came after police went to the Director of Public Prosecutions Roger Gaspard with an investigation file on Tuesday. McDonald, a Cabinet minister, is being investigated on the allegation of misappropriation of public funds. MP Marelene McDonald's constituency office. The Express was told that McDonald, complained of feeling unwell and was treated at hospital. On June 1, 2017, Prime Minister Dr Keith Rowley advised then President Anthony Carmona to revoke the appointment of McDonald who was then Minister in the Ministry of Public Utilities. Minister of Public Administration, Marlene McDonald McDonald had only recently been sworn in as Minister in the Ministry of Public Utilities after a sixteen month period of absence from the Cabinet. Why was MacDonald fired then? McDonald met with Prime Minister Dr Keith Rowley the morning of her firing, as a result of the controversy caused by her choice of guests attending her swearing-in ceremony at the President's House in St Ann's days before. The commotion surrounds the presence of reputed \\\"community leader\\\" Cedric \\\"Burkie\\\" Burke, who accompanied contractor Kenroy Dopwell to the event. Senior elements of the national security community had expressed alarm at the presence of Burke, who has been engaging their attention. FLASHBACK: Newly appointed Minister of Public Utilities Marlene McDonald is congratulated by, from left, close friend Michael Carew, Jean Elder, chairman of the Port of Spain South Constituency, Port of Spain \\u201ccommunity leader\\u201d Cedric (Burkie) Burke, Kenroy Dopwell and Sharon Felix at President's House, St Ann's, after she was sworn in. \\u2013Photo: CURTIS CHASE Not only was he present, but Burke was introduced by her to the President and posed for pictures with Carmona Carmona. On August 2, Rowley reappointed McDonald, to the post of Minister of Public Administration. Burke was detained on Monday by police who seized his electronic devices including cell phones and laptops. He was questioned and released on Wednesday morning. Reporting by Alexander Bruzual Police need help in locating 16-year-old Shakira Moore. A woman and her lesbian lover were allegedly beaten by the woman\\u2019s husband after she confess\\u2026 FOURTEEN-year-old Nicholai Hodge died as a result of two stab wounds to the chest, an autops\\u2026 PRIME Minister Dr Keith Rowley, who spoke yesterdat to CNC3 News following the detention of \\u2026 Minister in the Ministry of Public Administration and Communications, Marlene Mc Donald spen\\u2026 Government Minister Marlene McDonald was dealt a third strike to her political career yesterday with her arrest by police on corruption allegations. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/lawless-society/article_c448cad7-8dd9-5c39-9f64-98fcf0e7a4c0.html\", \"TITLE\": \" Lawless society \", \"DATE\": \"Nov 9, 2013 \", \"CONTENT\": \"This is a parked vehicle on a zebra crossing next to a no parking sign at the Piarco International Airport TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/caring-for-society/article_87273305-6d77-52c6-b520-aa15d5e17c2d.html\", \"TITLE\": \" Caring for society \", \"DATE\": \"Jul 4, 2014 \", \"CONTENT\": \"There is enormous scope for non-governmental organisations, community-based organisations and private individuals, particularly those in business and the professions, to continue to make the proverbial difference to the negative conditions prevailing in sections of our society. The tireless good works of all volunteers in service are undoubtedly \\\"a key terrain of strategic action to construct an alternative social order\\\". However, it is important to appreciate where those who selflessly offer voluntary assistance to others stand in our Republic at this juncture. We have always been a very small post colonial, uneven, and highly diverse society. Added to that we are now manifesting significant instability and institutional failure, and we are suffering from the negative fall out from political corruption and narco dictation. We need also to appreciate fully what the negative conditions are and the strength of the undercurrents they produce. In this regard I can hardly add to what Dr Lennox Bernard, former independent senator and educator, wrote in this newspaper in February of this year before the Dana Seetahal murder woke up some people who were living in a delusion created to justify their good times rolling. Dr Bernard wrote: \\\"We face negative value frames especially among our youth\\u2014low self-esteem, learned helplessness, ambivalent self-regard, hopelessness coupled with anger and rage, impulsivity and lack of empathy\\u2014escalating crime and violence, domestic and child abuse, bullying, neglect of the poor and indigent and a general malaise reflecting lack of respect for one another\\\". Given those negative conditions, we are not dealing merely with poverty, poor living conditions and physical and mental afflictions. In Jamaica, the Office of the Children's Advocate, Dr Ganesh Shetty, has reportedly expressed its own concern that \\\"child abuse results in children becoming low achieving, short tempered adults with low self esteem\\\", who themselves sometimes enter into abusive relationships. Perhaps our interventions to help the citizens who are disadvantaged by the negative conditions are limited by too narrow a view of what we are up against, timidity in the face of political authority and a lack of co-ordination, sometimes amounting to unhelpful rivalry between those active in seeking to make positive interventions. In his seminal column entitled The Struggle for Recognition, from which I have quoted above, Dr Bernard emphasised that we need to love the nation's children. From my own meanderings in the cultural sector and and other interactions such as those I described in previous columns of mine, like Yetunde's Theme, it has long been clear to me that there is an urgent need to provide affection and friendship along with material assistance to raise the self-esteem of those to whom we offer caring and it was encouraging to have Dr Bernard set this out so clearly. Shortly after we met, Yetunde had described the affection gap for me in these words: \\\"Many times we fail to encourage and acknowledge the good in individuals; for many times we only focus on the failures. In the news they mostly show the negative side of youths and the success of the super stars. When last have we acknowledged a simple young person for the little they did, even if that was just crossing an old lady across the road When last have we told them how much we love them for who they are All these things help to develop self-determination in individuals\\\". Conditions in the fractured segments of our society are deteriorating so rapidly that there is no longer any time for theoretical discussions about corporate social responsibility and the appropriate boundaries between having and developing individual responsibility and being supported by the care of others. Whatever voluntary projects are currently operational, reshaped and expanded, voluntary caring may require the following: providing bonds, however slender, of sustainable affection, wider co-operation, examining existing research about our communities, working with evidence based information and recognising that caring is a means of altering behavioural standards. This column includes the gist of remarks I made last week as a guest speaker at a Rotary installation ceremony where I laid emphasis on the need for a plan for co-operation among business and the professions and those already in the fields in caring for society. There is support for this in what was reported to be the position of the publisher of the 2013/2014 T&T Corporate Social Responsibility Review, Ms Donna Ramsammy. The CSR Review is also quoted as warning as follows: \\\"There are social indicators screaming at us. If we don't act now we may face a societal implosion from which recovery could prove difficult\\\". As I listen to the talk about unleashing the dogs of war against the criminal elements and as the threat of violent confrontation grows, the question arises who will care for the not yet criminalised children in the \\\"war zones\\\" and what is the policy prescription for those children and for those in charge of them Have we left it too late TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/the-underachieving-society/article_97cad70f-849c-5375-91d8-5d20abc3e4bc.html\", \"TITLE\": \" The Underachieving Society \", \"DATE\": \"Jul 22, 2013 \", \"CONTENT\": \"Former Deputy Governor of the Central Bank Dr Terrence Farrell during the launch of his book The Underachieving Society-Development Strategy and Policy in Trinidad and Tobago 1958-2008 on May 2 at NALIS, Port of Spain. Cover of The Underachieving Society-Development Strategy and Policy in Trinidad and Tobago 1958-2008. \\u0097Photos: AYANNA KINSALE Former Deputy Governor of the Central Bank Dr Terrence Farrell during the launch of his book The Underachieving Society-Development Strategy and Policy in Trinidad and Tobago 1958-2008 on May 2 at NALIS, Port of Spain. Cover of The Underachieving Society-Development Strategy and Policy in Trinidad and Tobago 1958-2008. \\u0097Photos: AYANNA KINSALE Although Terrence Farrells The Underachieving Society is 290 pages long, the argument in its title takes just 11 pages to make. Most of the other 279 pages is an history of economic policy-making in this country. Farrell, a former deputy governor of the Central Bank, notes in the preface that he considers economics a technical discipline requiring econometrics and mathematics. However, in order to make the work accessible to more general readers, interested primarily in the economic history of Trinidad and Tobago, he writes, I have tried to make the exposition clear and readable without, I hope, losing much if any of the analytical rigour. Having made it clear that he could have written a book which would impress experts, Farrell underachieves in the two respects listed. Although the prose is readable, he retains the dry academic tone of his re-mastered masters thesis (down to continual use of the pronoun We) which makes up the bulk of the book. But the crucial fault lies in the exposition, which, until page 232, consists only of a few occasional comments in his detailed record of paradigms and policy. Farrell clearly didnt bother to examine other books which have similar objectives, such as William Easterlys The Elusive Quest for Growth, Jeffery Sachs The End of Poverty, or Daron Acemoglus and James Robinsons Why Nations Fail. Such a study would have helped him improve the prose, structure, and weaving of the arguments with information, (or, since the books publication was subsidised by Republic Bank, he could have hired an editor to achieve these ends). Farrell lists three reasons for writing the book to revisit his masters thesis of 30 years ago; to document the Vision 2020 exercise where he chaired the macroeconomics sub-committee; and to simply document a part of T&T history. It is in this last respect that he best succeeds. The book is divided into six parts. The first lays out the background for T&Ts history from colonial times, as well as the various economic paradigms which would inform political and technocratic decisions. The other parts are divided chronologically, covering 1958 to 1973, a period in which import-substitution for industrialisation was the main strategy, followed by 1974 to 1982 when industrialisation was based on oil and natural gas. The ten years between 1983 and 1992 is titled The Lost Decade, while the last phase covered, from 1993 to 2008, is called The Neoliberal Phase. In part six, Farrell gives his overall evaluation of all these policies. Given the title of his book, Farrell is generally gentle in his criticism of the individuals and groups behind policy-making. He badtalks neither politicians nor technocrats nor business groups. By contrast, he is relatively harsh on two entities the Central Statistical Office (which he describes as a shadow of its former self... so much so that there are now serious questions about the integrity and reliability of certain data produced) and the Public Service (geared to maximise the numbers employed rather than attract and keep the best and the brightest). He is also full of praise for the Roman Catholic Church, which he mentions twice for seemingly no other purpose than to demonstrate his faith. From this one might infer that, despite the seeming objectivity of his book, Farrell may not have overcome certain biases in his analysis. He has put in many things, but what has he omitted In the 11 pages in which he demonstrates how T&T has underachieved, he makes a secular comparison of this country with Barbados, Singapore, and Norway on key indicators such as GDP, literacy, and infant mortality and, while Farrell may certainly have thought up this approach himself, similar analyses had been done in the now defunct Trinidad and Tobago Review periodical founded by the late Lloyd Best. Nonetheless, given the vast amount of information Farrell has put into this work, The Underachieving Society joins Kirk Meighoos Politics in a Half-Made Society and Wendell Mottleys Industrial Policy 1959-2008 as one of the three most important histories of modern Trinidad and Tobago. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/features/cancer-society-moves/article_697a6cb6-97e4-5d2c-878e-e90d81f1b355.html\", \"TITLE\": \" Cancer Society moves * \", \"DATE\": \"Oct 29, 2017 \", \"CONTENT\": \"Cristobal Joaquin, Adanna Bacchus, Lorraine Biran, Robert Dumas and Cindy Singh. \\u2013Photos: VERDEL BISHOP Cristobal Joaquin, Adanna Bacchus, Lorraine Biran, Robert Dumas and Cindy Singh. \\u2013Photos: VERDEL BISHOP THE Trinidad and Tobago Cancer Society (TTCS) has moved to a new location. Last Thursday the TTCS, which was previously located at Rosalino Street in Woodbrook, celebrated the launch of its new home, at 69 Dundonald Street in Port of Spain, along with its new website and amenities, with the theme \\u201cWe Have Replanted Our Roots\\u201d. Speaking at the launch of the new facilities, TTCS chairman Dr George Laquis said the accommodation is only temporary, as there are plans to utilise the 6 \\u00bd acres of land in Mucurapo to construct a permanent structure soon where more state-of-the-art services will be offered to cancer patients. Wedding celebrations can sometimes feature some unusual and surprising traditions from countries all around the world, that we would consider to be extreme. In the following article people share their experiences of weddings they have been to in various countries. Trincity Mall has now become even more fun as FunStation opened its north store last weekend\\u2026 Trevor\\u2019s Edge has gotten a whole lot sharper. The popular reclusive St Augustine tavern is traditionally known as the cultural hub of the \\u201cMiddle East\\u201d. It was the home of the Gillian Moore-inspired \\u201cSongshine\\u201d, the 2000s\\u2019 spoken word showcase that birthed a new generation of poets. Veteran rare calypso acts also featured weekly, during that time, at their \\u201cIndependence to Republic\\u201d concert series. Tobago is gaining international recognition through a destination marketing campaign titled \\u2026 STRAY animals roaming the streets remains a perennial problem in T&T and in many countri\\u2026 \\\"Social media and proper leadership are two vital interventions for Civil Society Organisati\\u2026 \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/opinion/time-to-reflect-on-respect-in-society/article_15cccc68-36c8-5244-9732-26de215a94e1.html\", \"TITLE\": \" Time to reflect on respect in society \", \"DATE\": \"Nov 27, 2016 \", \"CONTENT\": \"Oh to have been the proverbial fly on the wall when Education Minister Anthony Garcia reported to Prime Minister Keith Rowley on his trip to the Santa Flora Government Primary School last week! It apparently took an instruction from the latter to get him to visit the school that had been closed for nine weeks. This is despite the visit by the school's PTA on October 11, to his offices with then three weeks old complaints about non-functioning toilets and other infrastructural woes. After that meeting he said, \\u201cif a child is out of school for one day that is a day too much\\u2026we are going to ensure that the time away is curtailed\\u201d. Last week he complained that \\u201cchildren were being used as pawns\\u201d and asserted \\u201che will not speak (to parents as opposed to the PTA) if you cannot address me properly\\u201d. The counter position articulated by a parent is, \\u201cI get big and still duncey. I don't want that for my son\\u2026I do everything for him to have a better life and this is what is going on here\\u201d. This exchange captures the need for us to reflect on the issue of respect in our society. Be it this case or one in Laventille we all desire respect. A lack of respect is wounding since it fails to acknowledge that another human being is worthy. By according respect to only the highly placed, we create a man-made shortage for respect since it costs nothing to be respectful to each other. In an age of inequality where some lose control over their lives becoming consumers of whatever is provided rather than participants in crafting the necessary solutions respect is even more desired. Respect, or its lack, reveals personal character in situations of inequality. We experience it daily in our hospitals and on our roads. Those who lead, be they government or opposition, should avoid pity or contempt in dealing with the needs of the public. Their example may help us regain mutual respect. Treating people with respect does not just happen; it is a negotiated position between our character and social structure. We have to distinguish between our position in society and our prestige which is the result of emotions ascribed by others to us in that position. Status does not automatically lead to prestige as Minister Garcia and President Carmona, one of the school's graduates, have discovered. Disrespecting others comes naturally though we fight to keep from being disrespected ourselves. But society cannot function without restraint and adherence to recognised forms of behaviour. Therefore we cannot only show love to our friends and family and be indifferent to other social relations. As Otis Redding sang \\u201cwhat you want you got it\\u2026all I'm asking for is a little respect\\u201d. IN yet another incident which has had the effect of piling \\u00adembarrassment upon embarrassment for the authorities, a convict walked out of the Golden Grove facility in Arouca on Thursday, and was on the run up to last night. THE West Indies has had a phenomenal number of exceptional cricketers in its history. The captains have been mostly \\u00admiddling. I restricted the playbooks to those of Frank Worrell, Richie Benaud and Mike Brearley simply because they were known as thinking men; able in both the technical and \\u201cman-management\\u201d aspects of the game. International Youth Day is approaching. It is time for the youth of this country to stand up and make their voices heard. It is time to become more \\u00adinvolved in the political process to put an end to the corruption and mismanagement taking place far too often and for too long. Recently, the press \\u00adreported that a mother was in tears after her victim impact statement was read out in court during the trial of the accused for her son\\u2019s murder. She cried out for answers as to the reason the accused, having robbed her son of his \\u00adcellphone, had killed him. While the horizon must seem unrelievedly grim to many citizens, once in a while a few specks of bright light appear to \\u00adrelieve the gloom. And so it was \\u00adrecently when it was announced that the country\\u2019s first drug treatment court was to be established within three months. Regarding the arrest of Minister Marlene McDonald in the ongoing investigation of corruption charges levelled against her, Dr Rowley bought that wholesale. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/a-selfish-and-uncaring-society/article_276e1e82-6ea3-11e8-8eb0-8bbbe494dbf8.html\", \"TITLE\": \" A selfish and uncaring society \", \"DATE\": \"Jun 12, 2018 \", \"CONTENT\": \"{{description}} Email notifications are only sent once a day, and only if there are new matching items. Has Trinidad and Tobago become a selfish, uncaring society? This is the question being asked by The University of the West Indies lecturer and founder of Inter\\u00adnational Men\\u2019s Day, Dr Jerome Tee\\u00adlucksingh. Teelucksingh was yester\\u00adday reacting to the brutal beating of Kemba Olufemi by her ex-lover, Lloyd Logan, 62, outside Tropical Plaza in Marabella on Monday, and the failure of passers-by to help. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/musical-poison-for-our-society/article_28edb690-5b73-5f71-8071-c574c3c3477c.html\", \"TITLE\": \" Musical poison for our society* \", \"DATE\": \"Jan 11, 2018 \", \"CONTENT\": \"It's not that I have any interest in the chutney soca saga/commess which has unfolded this year. If it's not the \\u201cEmpire\\u201d playing smart with foolishness in its stupefying effort to strike back at chutney \\u201cJedi\\u201d Nermal Gosein by strangling the funding, it's the deluge of the most sickening lyrics being used to completely prostitute the chutney artform. Either way, the biggest victim is the artform itself, which is used like a one-night stand \\u2014slam, bam, thank you ma'am. For the umpteenth year running, almost every single chutney song, jingle and dirge is about \\u201cSunil drinking rum, going home to beat Savitri with a bilna because he meets her in bed with another woman, his brother or father\\u201d or all of the above, or some other sexually laced piece of vulgarity. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/secret-society/article_1754f1b7-9673-578f-9b54-e8eb11594c34.html\", \"TITLE\": \" Secret Society \", \"DATE\": \"Dec 2, 2013 \", \"CONTENT\": \"The State is the dominant agent in our national economy, which is the most vibrant in the Caribbean. It is therefore essential for us to understand how the State works so that we can better understand, or even plan, our interaction with that dominant party. Given the role T&T plays in the wider Caribbean, those concerns extend beyond our country to our region. In order for us to understand how the State works, we must get quality information in the required quantities. We must also have the right to request further information from public bodies so that we can examine particular matters more closely see sidebar. This countrys Integrity Framework comprises elements such as - The Integrity Commission (IC), which is responsible for monitoring the integrity of public officials; The Freedom of Information Act (FoIA), which gives the right to ask for unpublished information; The Auditor General, the Independent body monitoring the financial reporting of public bodies; The Investments Division of the Ministry of Finance, monitoring the operations of State Enterprises; The two Parliamentary Accounts Enterprises Committees, providing parliamentary oversight of public bodies This sustained examination of our countrys integrity framework is directed towards an enhanced level of information on how our nations public bodies are functioning. This week, there is a shifting focus from the controversial Integrity Commission to the Freedom of Information Act, which I understand is serviced by the Freedom of Information Unit, a division of the Office of the Prime Minister. One of the points I made on the impact of the Appeal Court ruling of June 27 on the application of the Integrity in Public Life Act (IPLA) to TSTT and State Enterprises was that those potent shifts would have an effect on other parts of the integrity framework. That appeal by TSTT was against a 2007 High Court ruling that the IPLA applied to TSTT and it is cited by the Freedom of Information unit. The FoIA was passed in 1999 and the IPLA in 2000. The combined impact of those laws was significant against a State sector which had long enjoyed only occasional oversight. No doubt the political climate of an embattled UNC and increasing public clamour against the high levels of alleged corruption were significant elements in the politics of the day which made those new laws both necessary and possible. According to Frederick Douglass, Power concedes nothing without a challenge. That is an important reminder for people who cannot see any possibility for change in our country. But this story also emphasises the fact that eternal vigilance is critical if we are to maintain our gains. The powerful elements who had benefitted from the previous, opaque arrangements were now forced to review their position, having suffered a defeat now that these two new transparency and accountability laws were in place. On the one hand it is impossible to openly state an intention to repeal these acts and on the other hand, those are far too disruptive to business as usual, to just leave intact. The challenge for those powerful elements was to find a way to dismember those new, disruptive transparency laws without recourse to repeal. As examined in relation to the IC, the challenge to the applicability of the IPLA came from Telecommunications Services of Trinidad & Tobago (TSTT), which is a public private partnership (PPP) in which the British multinational Cable & Wireless hold 49 per cent of the shares. This is a situation in which the two parts of our economy sit together in a limited liability company. The two parts are the offshore economy, with its international agenda, and the onshore economy, with its local perspectives. The fact is that pressure to escape the legal requirement for local oversight via the IPLA - of the directors wealth emerged from the TSTT board. It is therefore reasonable, in my view, to ask whether the offshore elements on that board are the ones who insisted on this course of litigation. The Appeal Court ruled on June 27 that the IPLA does not apply to TSTT, despite the Ministry of Finance current listing of TSTT as a State Enterprise. But it did not stop there, since the October 28 Appeal Court final hearing on the application of the FoIA to TSTT is also to be considered. TSTT is listed as No. 145 of a total of 199 public authorities subject to the FoIA on the units website. A lawsuit was filed in 2006 by Magdalene Samaroo against TSTT, challenging its refusal to publish the letters allegedly sent by the IC to exempt TSTT Directors from the IPLA. In July 2010 Justice Carlton Best ruled that TSTT was indeed a public authority subject to the FoIA. TSTT appealed that ruling and those proceedings closed on the October 28. There were two articles in other newspapers, both reporting that the Appeal Court ruled that TSTT was not subject to the FoIA. The Judiciary issued one of its rare statements to correct those articles by stating that no such ruling had been made. As a close observer of this ongoing dismemberment of our republics integrity framework, the transcript of that hearing was fascinating reading for me. The court stated that the appeal was compromised, which I take to mean that the parties had agreed to end the lawsuit, so no costs were awarded. What is fascinating is the combined effect of the Appeal Courts statements - ...the Freedom of Information legislation is...one in which the policy is to facilitate disclosure...; further, that they were not prepared to state an opinion on the subject-matter of the appeal and finally ...we can set aside the decision of Justice Best.... A ruling without a ruling. Literally incredible. Afra Raymond is a commentator on public matters; this discussion is also hosted at www.afraraymond.wordpress.com TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/a-frontier-society/article_34d8f9e4-b9d9-5f78-97d5-a43330443ed9.html\", \"TITLE\": \" A frontier society* \", \"DATE\": \"Jul 11, 2017 \", \"CONTENT\": \"St Vincent and the Grenadines (SVG), to give the nation its proper name, is very close to us in Trinidad and Tobago. There's been movement between the islands since at least the early 1800s. Many Trinis have SVG forebears and many in SVG have Trini relatives. So I want to notice an interesting new book about SVG. It's by Philip Nanton, a SVG-born, Barbados-based poet, social scientist, literary scholar and multi-media practitioner. His earlier book, Island Voices from St Christopher & The Barracudas (2014), is a witty, affectionate and often laugh-out-loud funny collection of dialogues and sketches about life in SVG (lightly disguised in the book's title). Nanton's new book, Frontiers of the Caribbean, is more of an academic book (it has endnotes and bibliography), but it is a highly original and unconventional study of SVG, past and present. It reflects his personal journey away from formal social scientific methods to the use of forms of creative expression for social analysis, as in Island Voices. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}"
]