[
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/athletes-collect-their-cash/article_4c542cda-c122-54c2-9708-254c23098833.html\", \"TITLE\": \" Athletes collect their cash \", \"DATE\": \"Mar 28, 2009 \", \"CONTENT\": \"REASON TO SMILE: Prime Minister Kamla Persad-Bissessar and Petrotrin chairman Lindsay Gillette, centre, display containers of heavy and light crude oil at yesterday's post-Cabinet press conference at the Office of the Prime Minister in St Clair. At left is Petrotrin's president-designate Khalid Hassanali. \\u0097Photo: MICHEAL BRUCE REASON TO SMILE: Prime Minister Kamla Persad-Bissessar and Petrotrin chairman Lindsay Gillette, centre, display containers of heavy and light crude oil at yesterday's post-Cabinet press conference at the Office of the Prime Minister in St Clair. At left is Petrotrin's president-designate Khalid Hassanali. \\u0097Photo: MICHEAL BRUCE Over $1m dollars was disbursed to 11 track and field athletes under the Elite Athletes Assistance Programme (EAAP). On Thursday, Minister of Sport Gary Hunt handed out 10 of the 11 cheques after having presented one to Emmanuel Callender on Wednesday. Collecting most of the cheques was president of the National Amateur Athletic Association (NAAA), Ephraim Serrette. The fathers of Darrel Brown and Josanne Lucas also collected on their children's behalf. The funding represents the first tranche of the EAAP grant which is made to athletes who have attained the qualifying international ranking as determined by the TTOC and/or won medals at specific international games. Athletes also qualify for EAAP funding using a two-tiered ranking system which outlines $250,000 for athletes who rank in the World Top 10 positions, $187,500 for those who rank in the World Top 11-40 positions and $75,000 on a case by case basis for athletes who win medals in specific games and championships. A monitoring and evaluation mechanism was recently incorporated into the EAAP, requiring funds to be disbursed in two tranches. The first tranche is disbursed to athletes based on application criteria. The second tranche is based on the results of a two-month monitoring exercise executed mainly by the TTOC in consultation with the Ministry.. Olympic silver medallist Callender received his cheque of $150,000 Wednesday at a brief ceremony as he had to leave Trinidad that night bound for his training base in Orlando, Florida. The eight other recipients are a mix of young and experienced athletes. They are Marc Burns ($150,000), Candice Scott ($100,000), Cleopatra Borel-Brown ($100,000), Brown ($150,000), Ayanna Alexander ($75,000), Charisse Bacchus ($75,000), Renny Quow ($150,000) and Joseanne Lucas ($100,000). TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/opinion/random-notes-on-the-year-in-athletics/article_a303dcd0-a3cf-5ae4-854b-b35bdc9de7f9.html\", \"TITLE\": \" Random notes on the year in athletics \", \"DATE\": \"Jan 1, 2017 \", \"CONTENT\": \"The Olympic Games are the Mt Everest of international sporting competitions and that's why every parent likes to say, \\u201cMy son/daughter is an Olympian.\\u201d No other sports title equals the magic word \\u201cOlympian\\u201d. But like everything else, there are Olympians and Olympians, those who mount the rostrum at the games and those who participate. In the 19th century Baron de Coubertin believed that participation was the thing. Then, winning was useful but the journey mattered more than the outcome. Those days have gone as evidenced by the TTOA officials who have set the goal of winning a certain number of gold medals by 2024. Winning a gold medal is extremely difficult as is climbing the podium in second or third position. Failure to climb the Olympic podium virtually consigns outstanding athletes to the waste basket of Olympic history. They are regarded as \\u201chistory's greatest also-rans\\u201d. In 1935 American sprinter, Eulace Peacock, beat Jesse Owens on five consecutive occasions. Owens admitted that Peacock was the better sprinter. In 1936, Olympic year, Peacock pulled a muscle and failed to make the American team. All the books are about Owens' feats in Berlin while the name \\u201cPeacock\\u201d is no more than an asterisk. All this is to say how difficult it is to mount the rostrum at the Olympics. A few days ago the TTOC correctly named bronze medallist Keshorn Walcott as Sportsman of the Year. In 2012 when he was Olympic gold medallist, he also won the award. However, the Sports Personality of the Year award eluded him in 2012 and this year. In the year of Brexit and the election of Donald Trump, one can say that any number can play where voters are involved. Here's my take. Winning races in Europe and elsewhere during the track or swimming season simply serves as preparation for the big one \\u2014the Olympic Games. The athlete receives money and self-satisfaction but that is no assurance of an Olympic medal. An analogous situation is an athlete winning all the preliminaries but not placing in the final. Only the final counts and the final's equivalent are the Olympic Games. Our team did not exactly excel in Rio and officialdom talked about a post-games report. A post- games meeting was held but no report has surfaced in public. It is useful to keep the public in touch. The aquatic centre in Couva is open and has already attracted a Canadian team to train there. This is fantastic because in addition to having a good place for our swimmers to train, it provides a venue of international standard to encourage sports tourism. Kudos to Sportt and all those involved in this enterprise! This focuses attention on the Hasely Crawford Stadium, in existence since 1972. Since its existence nothing has been done to involve the stadium in sports tourism. The name alone is an attraction- the home of an Olympic 100m gold medallist. Then there's Keshorn Walcott, another gold medallist, Wendell Mottley, Ed Roberts, Richard Thompson, Lalonde Gordon, and Ato Boldon, all Olympic medallists The tiny Cayman Islands host an international track meet annually and this and other sporting activities add to its tourist industry. The Cayman Islands had one outstanding international athlete and Trinidad and Tobago has George Bovell III. Both individuals helped to get sports tourism off the ground. If the NAAA does not have the know-how to build sports tourism around track and field, SporTT and those in the tourism industry would be willing to give advice and assistance. Inviting visitors to spend their foreign exchange here is the name of the game in these guava times. Speaking of foreign exchange, why was Michael Johnson invited to come here He was a great champion and certainly a nice guy, but he is in business to make money, the very thing we need to come into this country. A good businessman, he heard of Bolt and company running under ten seconds in Jamaica; so he flew down to see what they were doing. Now he has come here to show us saps what those sprinters were doing in Jamaica. Somewhere I read that we have 40 coaches in Trinidad and Tobago. If that is the case we need 600 more. It is imperative to place a physical education teacher with a BSc degree in every school. Our universities can produce them but prospective physical education graduates would need scholarships to attend. It is here that corporate assistance would be vital. Placing trained physical education teachers in every school in Trinidad and Tobago doesn't sound as impressive as bringing down Michael Johnson, but that is what will help us roll champions off the assembly line on a regular basis. Happy New Year! IN yet another incident which has had the effect of piling \\u00adembarrassment upon embarrassment for the authorities, a convict walked out of the Golden Grove facility in Arouca on Thursday, and was on the run up to last night. THE West Indies has had a phenomenal number of exceptional cricketers in its history. The captains have been mostly \\u00admiddling. I restricted the playbooks to those of Frank Worrell, Richie Benaud and Mike Brearley simply because they were known as thinking men; able in both the technical and \\u201cman-management\\u201d aspects of the game. International Youth Day is approaching. It is time for the youth of this country to stand up and make their voices heard. It is time to become more \\u00adinvolved in the political process to put an end to the corruption and mismanagement taking place far too often and for too long. Recently, the press \\u00adreported that a mother was in tears after her victim impact statement was read out in court during the trial of the accused for her son\\u2019s murder. She cried out for answers as to the reason the accused, having robbed her son of his \\u00adcellphone, had killed him. While the horizon must seem unrelievedly grim to many citizens, once in a while a few specks of bright light appear to \\u00adrelieve the gloom. And so it was \\u00adrecently when it was announced that the country\\u2019s first drug treatment court was to be established within three months. Regarding the arrest of Minister Marlene McDonald in the ongoing investigation of corruption charges levelled against her, Dr Rowley bought that wholesale. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/top-athletes-for-grand-games/article_6f1a9afa-443b-5469-9bcd-bf0e4552821d.html\", \"TITLE\": \" Top athletes for Grand Games \", \"DATE\": \"May 2, 2016 \", \"CONTENT\": \"{{description}} Email notifications are only sent once a day, and only if there are new matching items. THE Trinidad and Tobago Grand Games Athletics Invitational 2016 is scheduled to come off at the Hasely Crawford Stadium in Port of Spain on May 21, and according to Grand Games chief executive officer Regina John, the track and field extravaganza will be one of a high international standard. Speaking at a news conference at the stadium's VIP Lounge yesterday, John said: \\u201cWe have invited athletes from 25 countries while Trinidad and Tobago (T&T) will be represented by 22 athletes who all train abroad.\\u201d Headlining the international invitees are Jamaica's 200 metres specialist Warren Weir and world-ranked shot putter Michelle Carter of the United States. A bronze medallist at the 2012 Olympics in London, Weir has a personal best of 19.79 over 200m, and has since added 200m silver and men's 4x100m gold at the 2013 World Championships in Moscow, while Carter holds the American shot put record with a personal best of 20.24 metres and earned a 2015 Beijing World Championships shot put bronze medal following her fifth place finish at the London Olympics. Also listed to compete are the USA's Ryan Bailey and Natasha Morrison of Jamaica. Bailey has a personal best of 9.88 seconds over 100 metres and was a member of the USA's victorious men's 4x100 metres team at last year's World Relay Championships in the Bahamas, while Morrison, who holds a personal best of 10.96 seconds over 100 metres, was a member of Jamaica's women 4x100 metres unit that captured gold at the 2015 World Championships. Flying the red, white and black for T&T will be defending Olympic javelin gold medallist Keshorn Walcott, 2015 Pan American Games shot put champion and double Central American and Caribbean Games champion Cleopatra Borel as well as female sprinters Michelle-Lee Ahye and Khalifa St Fort, the 2015 World Youth Championships 100 metres silver medallist and 4x100m bronze medallist at the 2015 World Championships. John said track and field fans can expect a highly competitive meet, with athletes from Nigeria, Canada, Angola, Barbados, the Dominican Republic and the US Virgin Islands, in addition to Jamaica and the US, whose confirmation of their participation was secured via contracts. Prizes will be distributed from position one through eight with winners receiving US$4, 800 and eight place finishers collecting US$250. Michael Look Tong, director at Flow Sports, said his company was happy to be on board with the Trinidad and Tobago Grand Games and announced that the event will be broadcast live in HD to 10 countries, including T&T on channels 290 and 95. Tickets for the meet are priced at $200 and can be purchased at Francis Fashions Shoe Locker, Phats International, InXcess and Fan Zone. Ticket holders are guaranteed free entry to the Grand Games after party at the Jean Pierre Complex compound and also have an opportunity to win a Hyundai Elantra motor car. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/iaaf-upholds-bans-on-russian-athletes-for-rio-games/article_3d7707eb-03cf-5ed9-b473-11cb50629855.html\", \"TITLE\": \" IAAF upholds bans on Russian athletes for Rio Games \", \"DATE\": \"Jun 16, 2016 \", \"CONTENT\": \"VIENNA (AP) \\u2014 The IAAF upheld its ban on Russia's track and field team for the Rio de Janeiro Olympics on Friday in a landmark decision that punishes the world power for systematic doping. The Russian sports ministry said it was notified of the decision by track and field's world governing body, which ruled that the country had not done enough to earn reinstatement. The suspension was imposed in November following a report by a World Anti-Doping Agency commission that alleged state-sponsored cheating, corruption and cover-ups in Russian track and field. The Russian ministry said it was \\\"extremely disappointed\\\" by the decision to ban the entire team from the Rio Games. It appealed to the IOC to \\\"consider the impact that our athletes' exclusion will have on the dreams and the people of Russia.\\\" The International Olympic Committee has scheduled a summit of sports leaders next Tuesday to address \\\"the difficult decision between collective responsibility and individual justice.\\\" That meeting could potentially open the door for individual athletes who have never been accused of doping and are deemed to be clean to compete at the games. \\\"We will look at the next step for us,\\\" IOC vice president John Coates said earlier in Australia. \\\"It's the IOC who have been testing and re-testing samples. The debate next Tuesday will be on the issue of individual justice and rights.\\\" The decision to uphold the ban came in a meeting of the IAAF's ruling council. The IAAF acted on a recommendation by a special task force that has monitored Russia's reform efforts. The meeting came two days after a new WADA report cited continuing obstruction and violations of drug-testing in Russia. \\\"We are extremely disappointed by the IAAF's decision to uphold the ban on all of our track and field athletes, creating the unprecedented situation of a whole nation's track and field athletes being banned from the Olympics,\\\" the Russian sports ministry said. \\\"Clean athletes' dreams are being destroyed because of the reprehensible behavior of other athletes and officials. They have sacrificed years of their lives striving to compete at the Olympics and now that sacrifice looks likely to be wasted. \\\"We now appeal to the members of the International Olympic Committee to not only consider the impact that our athletes' exclusion will have on their dreams and the people of Russia, but also that the Olympics themselves will be diminished by their absence,\\\" the statement said. \\\"The games are supposed to be a source of unity, and we hope that they remain as a way of bringing people together.\\\" The IAAF rejected a last-minute plea by Russian Sports Minister Vitaly Mutko, who claimed the country had clean up its anti-doping system and met all the requirements for readmission. \\\"We firmly believe that clean athletes should not be punished for the actions of others,\\\" he said in an open letter to IAAF President Sebastian Coe. \\\"Russia is doing everything possible to ensure our athletes are a part of clean and fair Olympic Games. In light of our efforts, I urge you to reconsider the ban on our athletes.\\\" Two-time Olympic pole vault champion Yelena Isinbayeva is among the Russian athletes hoping to compete in Rio. She has threatened to go to court on human rights grounds if excluded from the games. Other cases could end up in the Court of Arbitration for Sport. Many sports officials and athlete groups outside Russia called on the IAAF and IOC to take a hard line, citing a loss of faith in the entire drug-testing system. Evidence of state-sponsored doping should be enough to disqualify the whole track team, they contend. Former WADA president Dick Pound, whose report led to Russia's suspension, said he saw little reason for the ban to be lifted. \\\"I don't think it's an easy case to make that all should be forgiven,\\\" he told The Associated Press. \\\"A lot of credibility is at stake for the Russians, the IAAF and the IOC. If you're convinced it's a state administered system, your athletes have to pay the price for that.\\\" TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/let-s-save-the-games-cries-grenada-sports-minister/article_9751901f-3d01-5693-9433-8b322731b29f.html\", \"TITLE\": \" Let's save the Games, cries Grenada Sports Minister \", \"DATE\": \"Jan 26, 2011 \", \"CONTENT\": \"l ST. GEORGE'S Minister of Sport Patrick Simmons is calling for regional governments to collectively discuss the situation of this year's CARIFTA Games. Simmons feels that regional governments need to intervene urgently since there are less than three months left to prepare to stage the Games. \\\"Grenada as chair of CARICOM will initiate discussions with other regional governments to see what can be done to assist in the staging of the Games,\\\" he said. \\\"The CARIFTA Games have provided international exposure for many of our track and field stars, including the likes of Debbie Ferguson-McKenzie, Obadele Thompson, Darrel Brown, Usain Bolt, and Kirani James, so we cannot allow it to fail.\\\" The annual track and field championship is in danger of being cancelled for the first time in 40 years, after original hosts St. Kitts gave notice late last year that they were unable to stage the games. Jamaica, Bahamas and Trinidad and Tobago were identified as potential hosts but they all turned down the offer. Simmons, who coached a number of Grenadian athletes, including former World Indoor 400 metres champion Alleyne Francique and triple jumper Randy Lewis, feels the region's young athletes should not be denied the opportunity to compete among themselves even if it's a scaled-down version. He believes there are other possibilities of engaging national Olympic committees and lottery authorities in the region. \\\"I have been discussing this with the general secretary of the Grenada Olympic Committee, Veda Bruno-Victor, who also shares a similar passion for regional track and field,\\\" said Simmons. This year's CARIFTA Games is scheduled for April 22-24. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/ideal-athlete/article_03642fdb-aaf0-5408-9215-5b23850f2bdd.html\", \"TITLE\": \" IDEAL ATHLETE \", \"DATE\": \"Aug 12, 2012 \", \"CONTENT\": \"Keshorn Walcott Keshorn Walcott The man responsible for shaping Keshorn Walcott into an Olympic gold medallist, Cuban throws coach Ismael Lopez, says there is no limit to the heights the talented teenager can attain. \\\"His best quality is dedication, so we can achieve anything. Wow. I feel very happy. I'm very proud of Keshorn. I don't have words to describe.\\\" Walcott became only the second Trinidad and Tobago athlete in Olympic history to strike gold, when he won the men's javelin with an 84.58 metres throw, at the Olympic Stadium, here in London, England, on Saturday. Walcott's winning throw was a 1.75-metre improvement on his pre-Olympic personal best82.83m. The 84.58m effort is a new Pan American junior (under-20) and national senior record. It lifted Walcott into second spot on the all-time global under-20 list, behind Latvia's Zigismunds Sirmais, the world junior record holder at 84.69m. Lopez told the Express he was not surprised by Walcott's London 2012 performance. \\\"For me, I expected the junior world record. We were working at making his first throw relaxed. If the first throw is good, it makes things easier.\\\" As planned, Walcott was relaxed for his first round effort, throwing the javelin 83.51m. In round two, he improved to 84.58mthe throw that would earn T&T its first taste of Olympic gold since Hasely Crawford's men's 100m triumph in 1976. Dexter Voisin, the T&T track and field manager at London 2012, said that Walcott's triumph could not have been anticipated. \\\"It was a surprise to anybody. I sat among European coaches and saw amazement in their faces. \\\"This shows that once you put your mind to something and stick to the game plan, you can achieve anything. Keshorn is a very disciplined guy, takes training very seriously, listens to his coach, and has a strong mind. He's the ideal athlete.\\\" T&T chef de mission, Annette Knott, also praised the 19-year-old Toco thrower. \\\"Quiet confidence. He works hard, without any fuss.\\\" Walcott has had an arduous but highly rewarding season, striking gold at the Carifta Games, the Central American and Caribbean (CAC) Junior Championships, World Junior Championships, and now the Olympic Games. Lopez said his athlete will now get a well-deserved rest, before beginning preparations for the 2013 season. \\\"We have to take care of him. Keshorn was invited to two meets in Europe, but he'll go home. For him, the season is finished.\\\" Walcott's main focus in 2013 will be the World Championships, in Moscow, Russia. Hitting the 90-metre mark is also among the thrower's goals for next season. Lopez said he is looking forward to the continued support of the Sports Company of Trinidad and Tobago (sportt). \\\"I'm grateful for the camp in Cuba in April and May that they paid for. It made a big difference in Keshorn's preparations.\\\" He said the pre-Olympic camp in Cardiff, Wales, was beneficial as well. \\\"It had all the facilities, everything, and played a key part in Keshorn's performance.\\\" While Walcott has a rare gift for hurling the spear, Lopez is convinced there are other potential Olympic champions in T&T waiting to be discovered. \\\"There are more like him, but something needs to be in place to develop field events. We need facilities. The throwers and jumpers cannot always train at the Hasely Crawford Stadium. Because of football games, the field is not always available. A field events facility is needed.\\\" Lopez said throwing talent abounds in both Toco and Tobago. \\\"You have to look long-term. Start at 12/13. At that age, you have the time to teach different skills for throws. At age 15/16, the athletes can specialise in a particular throw.\\\" If Lopez has his way, the Walcott winarguably the biggest surprise of London 2012will not be a one-off occurrence never to be repeated, but rather, the first of many global field successes for a nation that has built its Olympic reputation on the track. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/woman-and-lover-beaten-by-husband/article_95c84b6a-bab9-11e9-bf59-e3ee9ed2ca65.html\", \"TITLE\": \" Woman and lover beaten by husband \", \"DATE\": \"2 hrs ago \", \"CONTENT\": \"{{description}} Email notifications are only sent once a day, and only if there are new matching items. A woman and her lesbian lover were allegedly beaten by the woman\\u2019s husband after she confessed to an extramarital affair last Saturday. The suspect, a 48 year old fisherman, flew into a rage after the confession and allegedly beat his wife at their home in Charlieville. Police said when the wife called her lover and told her of the attack, the lover went to the house and was allegedly battered by the suspect and his 19 year old son. The suspect and his son allegedly ganged up and beat the lover with their fists and a cutlass, police said. The two women \\u2013the 43 year old Charlieville wife and her 47 year old lesbian lover - went to the Chaguanas police station that night and reported the incident to police. Officers took both women to the Chaguanas District Health Facility and they were transferred to the Eric Williams Medical Sciences Complex. The suspect\\u2019s wife was treated for minor injuries and discharged. Police said that the lover was severely beaten on the head and face, and was warded at hospital. She is being treated at hospital for a fractured jaw, perforated eye ball, sliced tongue and dislodged teeth, police said. Police said the husband also went to the Chaguanas District Health Facility on the night of the incident. He allegedly told officers that his wife\\u2019s lover chopped him with a cutlass on the arm and finger. He received three stitches to the finger and five stitches to the arm. Officers took the husband into custody after he was treated and discharged. The 19 year old son left the home after the incident. Police officers are looking for him. Police said the husband faces charges of assault occasioning bodily harm and assault by beating. Police said the lesbian lover could also be charged with assault occasioning bodily harm. PC Backan of Chaguanas CID is investigating. A PIPE FITTER who told the court he found and kept five protected tortoises, has been arrest\\u2026 Public Administration Minister Marlene McDonald and her husband Michael Carew are still bein\\u2026 Police need help in locating 16-year-old Shakira Moore. A woman and her lesbian lover were allegedly beaten by the woman\\u2019s husband after she confess\\u2026 FOURTEEN-year-old Nicholai Hodge died as a result of two stab wounds to the chest, an autops\\u2026 PRIME Minister Dr Keith Rowley, who spoke yesterdat to CNC3 News following the detention of \\u2026 Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/athletes-return/article_4f8fa382-7db3-55df-94f1-6c1ea2f76167.html\", \"TITLE\": \" ATHLETES RETURN \", \"DATE\": \"Aug 4, 2014 \", \"CONTENT\": \"Trinidad and Tobago's Commonwealth Games athletes returned home this afternoon after picking up three silver and five bronze in Glasgow. They were met by a proud Sports Minister Dr. Rupert Griffith at the Piarco Airport VIP Lounge. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/sports/local/athletic-coach-plans-protest/article_81f61565-c34e-5c9b-b89f-6c3c338769cf.html\", \"TITLE\": \" Athletic coach plans protest* \", \"DATE\": \"Jan 24, 2018 \", \"CONTENT\": \" With the NAAA hosting their Commonwealth Trials from February 17-18, the Sports Company of Trinidad and Tobago has advised athletic clubs of the closure of the Hasely Crawford Stadium (HCS) and the Jean Pierre Complex (JPC), started from Wednesday and lasting until February 13, because the venue will be hosting several Carnival fetes. However SPORTT advised that the external field, newly refurbished warm-up track and the strength and conditioning gym will continue to be available \\u201cfor use upon request.\\u201d But president of the Mustangs Athletics Club Richard Yearwood, whose athlete Daniel Gibbs is attempting to qualify for the quadrennial games and whose club is one of several that use the HCS as their home base, is miffed at the closure. Jereem \\u201cthe Dream\\u201d Richards, in the Men\\u2019s 200m dash, and the Men\\u2019s 4x100m relay team both grabbed silver last evening, helping Team TTO to its biggest medal haul at a Pan American Games with two more days to go. Team TTO rower Felice Aisha Chow continues defying her age, creating history by becoming the first rower from this country to win a Pan American Games medal in the sport when she earned silver in the Women\\u2019s Singles Sculls 2000m event yesterday at the Lima 2019 Games. The 2019 season has been a tough one for Jereem \\u201cThe Dream\\u201d Richards. Adversity, though, mak\\u2026 Team TTO top swimmer Dylan Carter rebounded from disappointment with a bronze medal response in the Men\\u2019s 100m backstroke Thursday night. After failing to deliver all series, the West Indies \\u201cA\\u201d batsmen finally came good to deny India \\u201cA\\u201d a series sweep as they held on to draw the final match of the three-game series at the Brian Lara Cricket Academy in Tarouba, yesterday. Joy turned to sorrow for Tyra Gittens in the 2019 Pan American Games women\\u2019s heptathlon here in Lima, Peru. Poised for the podium following the first four disciplines, on Wednesday, disaster struck for the Trinidad and Tobago athlete early on Thursday. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/games-about-sport-and-diplomacy/article_81ce5d1b-b6c4-55bd-9697-246724a4b124.html\", \"TITLE\": \" Games about sport and diplomacy \", \"DATE\": \"Jul 23, 2012 \", \"CONTENT\": \"l LONDON Britain deployed 1,200 extra soldiers yesterday in a last-minute effort to bolster Olympic security while global diplomatic tensions started to play out among athletes and politicians three days ahead of the opening ceremony. The additional troops, which took the military contingent at the 2012 Games to well over 17,000, were called in to cover an embarrassing shortfall left by private security group G4S, the world's largest by some measures, in the run-up to the Games. The company caused a scandal by failing to meet its target for the number of guards it could provide, and on Tuesday said that it had deployed around 5,800 security personnel, still short of its revised objective of 7,000. Police stressed that they were content with security arrangements for the greatest show on earth, which kicks off in Cardiff, Wales, today with a football match between the women's teams of Britain and New Zealand. \\\"We've done all the planning, we've looked at the way in which terrorists have attacked in the past and we try to make sure that none of those could get through our security measures,\\\" said Chris Allison, Britain's national Olympic security adviser. Hundreds of thousands of visitors have descended on London and a million extra people are expected in the city each day of the July 27-August 12 event, putting pressure on a creaking transport system, some of which dates from the 19th century. Yet for all the grumbling by a notoriously critical media and Londoners braced for disruptions to their daily lives, the sense of excitement was palpable with the Games just around the corner and the sun shining brightly after weeks of rain. Early buzz from Monday evening's technical rehearsal for the opening ceremony at the main stadium of the sprawling Olympic Park was positive, suggesting film-maker Danny Boyle's unusual, quirky and ambitious vision might just work. Some 11 million visitors will witness the thrill of victory and despair of defeat as some of the world's greatest athletes, from Jamaican sprinter Usain Bolt to US swimmer Michael Phelps, battle for the ultimate prize in sport--Olympic gold. Britons, buoyed by Bradley Wiggins' historic victory in the Tour de France cycling marathon at the weekend, are confident of another impressive medals haul after success in Beijing in 2008. The Games will cost nine billion pounds (US$14 billion) to stage, and in spite of criticism of the outlay during straitened economic times, officials have defended the spending as most goes into regenerating run-down east London for the long term. As well as a flood of ordinary people, luxury yachts of the super-rich have moored close to the stadium. Expected dignitaries include Russian President Vladimir Putin, presidential candidate Mitt Romney and US First Lady Michelle Obama. Politics played out before the world's media as much as sport in the final countdown to kick-off, with a debate over how to mark the 1972 Munich attack by Palestinian militants that killed 11 Israeli Olympic team members moving up the agenda. Security is already a sensitive issue in London. The day after the capital was awarded the 2012 Games, the city was hit by suicide bomb attacks that killed 52 people. Widows of those killed in 1972 arrive in London today to pressure Olympics organisers to mark the 40th anniversary of the tragedy, stepping up a long campaign to organise an official commemoration. Romney joined the fray, saying he supported a minute's silence at Friday's opening ceremony, after Olympic chief Jacques Rogge paid a surprise tribute to the fallen athletes in London on Monday. British Prime Minister David Cameron may use the Games, which unite world leaders, businessmen and celebrities as well as more than 16,000 athletes and 20,000 journalists, to press Putin over his ties to Syrian President Bashar al-Assad. Sources said he would accompany Putin to an Olympic judo match if the Russian leader attends the Games, and may urge him to drop his support for Assad's regime which is engaged in a violent conflict with rebels seeking to topple him. In a reflection of the world they have left behind for the duration of the Games, participants from Libya and Egypt will represent the new face of the \\\"Arab Spring\\\" after uprisings ousted the old regimes. Distance runner Guor Marial, a refugee from Sudan's civil war, is fighting for permission to compete as an independent athlete because his newly-established country, South Sudan, has not had time to create a National Olympic Committee. Marial, who lost 28 members of his family in the war, has refused an invitation to run for Sudan, from which South Sudan split last year. \\\"For me to just go and represent Sudan is a betrayal of my country first of all, and is disrespecting my people who died for freedom,\\\" he said. Syria's small Olympic team has arrived and is expected to compete but it was unclear how it will be received given the level of condemnation of Assad. Around 30,000 people, including family members of the huge cast of men, women and children taking part, filled the main Olympic stadium on a balmy Monday evening for the first open rehearsal of the opening ceremony. Most of them honoured Oscar-winning Slumdog Millionaire director Boyle's pleas for details of the event to remain secret and off the public pages of Twitter and Facebook. The opening ceremony mastermind has voiced frustration at the media and members of the public who have leaked elements of the ceremony, which is inspired by William Shakespeare's play \\\"The Tempest\\\" and has a strong musical element. What is officially known is that the first sequence recreates a pastoral idyll, complete with geese, sheep, horse and cart, fields, fences and a game of village cricket. The ceremony is expected to be artistic and intimate compared to the opening extravaganza in Beijing. What the media has since leaked includes elements of the next \\\"act\\\" of the show, recreating the \\\"dark Satanic mills\\\" of William Blake, whose poem including this reference to the Industrial Revolution became an anthem to England. Even at the full rehearsal there were key moments missing, and mystery surrounds both the location of the Olympic cauldron and the identity of the individual given the honour of lighting it in front of a television audience of more than a billion. The crowd faced some travel delays on their way home late on Monday, underlining the logistical challenge London faces, to be made worse by planned strike action by passport officials and some train drivers on key Olympic dates. The British government on Tuesday asked the High Court to block the strike action by the border staff union. London's \\\"Games lanes\\\", reserved for Olympic officials, athletes, sponsors and the media, open today, and are sure to spark more complaints, including from the city's famous black cabs. Londoners have labelled them Zil lanes after the Soviet limousines given special privileges. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/congrats-to-our-athletes/article_3178d962-d5cf-5506-a119-2dd92afe02f0.html\", \"TITLE\": \" Congrats to our athletes \", \"DATE\": \"Oct 15, 2010 \", \"CONTENT\": \" THE 2010 Commonwealth Games may have begun amid much adverse publicity, but the event defied the doomsayers and turned out to be far better than initially predicted. Describing Thursday's spectacular closing ceremony, Reuters news agency reported: \\\"New Delhi put on a second flawless spectacle of song and dance to close the Commonwealth Games on a high, after at one stage threatening to become a national embarrassment to India.'' Cause had arisen for concern in the lead-up to one of the most expensive sporting events ever, priced at US$6 billion. It seems, however, the antsy and apparently biased Western media, Australian included, were determined to paint the Games, and India, in a negative light. Most of the glitches were corrected and India lived up to its reputation as the \\\"jugaadu'' the Hindi word for \\\"making do'' nation. And Trinidad and Tobago was part of it all. Some T&T athletes covered themselves in glory, raised the flag, and stirred national pride. The six-medal haul had been bettered at the Commonwealth Games by only two previous national teams in 1966 (nine medals) in nearby Jamaica, and in 1970 (seven medals). Shooter Roger Daniel added two medals to his extensive collection, a bronze when paired with compatriot Rhodney Allen, and a silver on his own. Boxer Tariq Abdul Haqq, 20, was runner-up in the super heavyweight division. Veteran track and field athletes Cleopatra Borel-Brown and Aaron Armstrong, along with triple jumper Ayanna Alexander, completed the medal tally. The women earned silver medals, and the sprinter brought home a bronze. Njisane Phillip, a well-rounded cyclist of much promise, and shooter Robert Auerbach Jr, a dead-eyed marksman, continued to promote themselves as future medallists in major international competitions. Those wearing red, white and black also produced some disappointing performances, however. This was especially the case with the women's hockey team and the netballers, even though they qualified. Now, even the Barbados netballers have the beating of the \\\"Calypso Girls.\\\" Meanwhile, the hockey women were trounced in almost every game they played in India. Should the substantial expenditure on those two teams not have been put to better use at home, on junior programmes, to the end of getting national teams up to world-class later Other sporting disciplines fall equally into that category of no-hopers against the international big guns archery comes to mind. Again, through inexcusably sloppy baton handling, the men's 4x100-metre relay team brought about their own downfall. Emphasising the positives, though, T&T should commend all who ascended the medal rostrum in Delhi including Caricom neighbour, St Vincent and the Grenadines and others who came closer to getting their names in the top three. Accept the nation's congratulations and encouragement in games to come. Well done and keep inspiring especially the younger athletes who will follow in your footsteps. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/is-a-sports-injury-limiting-your-game/article_78e953b4-2692-567a-b051-491431680e5a.html\", \"TITLE\": \" Is a sports Injury limiting your game \", \"DATE\": \"Dec 13, 2017 \", \"CONTENT\": \"Dr Alejandro Badia Dr Alejandro Badia Sports injuries can leave professional players out of the game for several seasons, but they can also affect those who practice physical activity regularly. Intense pain and constant discomfort in the focus of the injury can coexist with the patient for long months, until he manages to find the right treatment and professional to treat the case. The most common injury in the athletic population is found in the fingers and includes dislocations, sprains, muscle strains, fractures of bones, inflammation of the tendon and rupture of ligaments. Excessive injuries (chronic) are more likely to occur in athletes who practice sports that require them to repeat a particular movement (for example: baseball, soccer, tennis or golf). An athlete's performance can decrease significantly if chronic injuries are left untreated. Surgery may be necessary if chronic overuse injuries persist and continue over time. Conduct an immediate consultation with your doctor or specialist, if upper limb pain, bruising, or swelling persists after several days. \\\"Arthroscopy of the hand and wrist is a minimally invasive surgical technique that is used to explore a set of pathologies. Small incisions are made to insert a fiber optic instrument that serves as a camera inside a joint and allows not only a diagnosis of the problem, but many times comes to the conclusion of what definitive treatment would be best for the patient,\\\" said Dr. Badia. Dr. Badia is a renowned hand and upper extremity surgeon from Miami, Florida. In 2011 he was named one of the 45 best hand and upper extremity surgeons in the country by the Becker's Orthopedic & Spine Review. He has been honored for two consecutive years by the South Florida Business Journal as one of the 100 most powerful leaders in the health sector. Among its list of treated patients, Dr. Badia has operated athletes at the international level such as Terrell \\u201cT.O\\u201d Owens, former football player in the NFL and Trinidad and Tobago's very own goalkeeper, Adrian Foncette, who recently eliminated the United States from the 2018 World Cup in Russia. Foncette's story is an example of the difference a subspecialist like a hand surgeon can make. The football player had severely injured his elbow in a car accident and doctors told him he would not be able to play soccer again. Dr. Badia took on the case and performed a tendon transfer operation on the young man who went on to continue his career. To make a consultation with Dr. Badia, you do not have to travel to Miami. Now from the comfort of your home or office you can perform a virtual consultation (telemedicine) where you can diagnose your injury through a computer, tablet or cell phone. For more information, call 1 (305) 227-4263 or write to About the author: Dr. Alejandro Badia, MD, FACS, is a hand and upper extremity surgeon based in the United States, with expertise in minimally invasive procedures for sports injuries of the upper limbs. A former president of the International Society of Traumatology for the Hand (ISSPORTH) and founder of Badia Hand to Shoulder Center and OrthoNow in Miami, he performed surgery on Trinidad and Tobago's national football goalkeeper Adrian Foncette,who was part of the team that recently eliminated the US from the 2018 World Cup in Russia. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/ttoc-to-push-female-athletes/article_d48398bc-2542-5bc1-99da-10a134de60b9.html\", \"TITLE\": \" TTOC to push female athletes \", \"DATE\": \"Jan 13, 2017 \", \"CONTENT\": \"The Trinidad and Tobago Olympic Committee is set to launch its \\u201cFuture is Female\\u201d programme, an initiative focused on assisting the country's female athletes to break the Olympic medal drought. It will be a focused element of the #10golds24 Athlete Welfare and Preparation fund. After 70 years of TTOC and TT Olympic history, Trinidad and Tobago is yet to have a female Olympic medallist. \\u201cAnd it isn't because of a lack of talent or strong mind or a burning desire for success on the part of the athletes,\\u201d TTOC president Brian Lewis said. \\u201cThe future is female. #futureisfemale making a difference changing the game,\\u201d The TT Commonwealth Games Association and TT Beach and Sand Games Association president said that in the context of women and Olympic sport, T&T will be left behind if they do not up their game. \\u201cThere are certain aspects related to women that must be incorporated in respect of long-term female athlete development. As part of 10 or more Olympic gold medals by 2024, the TTOC must address the issues and provide solutions and options. That's the objective of the Future is Female initiative,\\u201d Lewis said. \\u201cDoing what needs to be done to give our female athletes the help they need to translate and elevate their talent to the Olympic podium.\\u201d Lewis added there are specific issues and problems that cannot be ignored or denied any longer. \\u201cThe reality is, after 70 years of TTOC and TT Olympic history, Trinidad and Tobago is yet to have a female Olympic medallist... You have to want it so badly that nothing else matters. To represent your country you have to want it even more. You have to have a strong mind. Olympic and elite level sport is about constant improvement otherwise you will be left behind,\\u201d Lewis concluded. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/opinion/editorials/our-athletes-deserve-better/article_10f168ae-bdf8-11e8-9722-a39cc37db268.html\", \"TITLE\": \" Our athletes deserve better \", \"DATE\": \"Sep 21, 2018 \", \"CONTENT\": \"REPRESENTING one\\u2019s country is an honour and a privilege which ought not be taken lightly. Some sportsmen and women may however be having second thoughts about that\\u2014and whether it\\u2019s worth all the time and effort\\u2014due to the trials and tribulations some sporting organisations have had to go through to secure funding for national teams to represent Trinidad and Tobago in competitions abroad. The latest such example is the T&T senior women\\u2019s football team, which had to look on anxiously this week before the Ministry of Sport and Youth Affairs approved money to be disbursed to the Trinidad and Tobago Football Association for the squad to compete at the 2018 CONCACAF Women\\u2019s Championship in the United States, with qualification for the 2019 FIFA Women\\u2019s World Cup at stake. Last month, the T&T Volleyball Federation went down to the wire before funds were secured to ensure that the national women\\u2019s team would be able to take its place at the World Volleyball Championship, in Japan, where Trinidad and Tobago will be the first country from the English-speaking Caribbean to compete at that level. Earlier this year, the T&T Rugby Football Union was not so lucky in getting money to send the national team to play a game in the Cayman Islands and T&T was disqualified from the Rugby Americas North Championships, a decision which the T&TRFU is now appealing at the level of the sport\\u2019s governing body, World Rugby. We should point out here that this is not simply a matter of the sporting bodies going to the ministry cap in hand and expecting to be fully funded to send teams on their way. The various sporting organisations are mandated to play their part by providing timely accounting records of how the money is being spent, but many times that is where the arrangement breaks down, to the detriment of the respective players who see their training and hard work come to nothing. The T&T Football Association is notorious for its lack of proper accounting practices and the latest sad scenario with the women\\u2019s team has been played out over the years, to the grief of male and female footballers who would love nothing more than to don the national colours and represent Trinidad and Tobago. Rather than putting the poor players through unnecessary stress and strain, some system must be put in place to alleviate the intrigue and uncertainty over whether the funds would be forthcoming so that team and country would be able to take their place on sport\\u2019s biggest stages. The recently-launched National Policy on Sport would be a good place to include such a format which would apply to all sporting bodies, so that the Ministry of Sport and Youth Affairs would be able to upkeep all its responsibilities, as stated in the policy document, including \\u201coverseeing and managing relevant funding streams in accordance with the draft funding policy, as well as review of policies for the disbursement of said funds and the use of sporting facilities\\u201d. Those responsible for reviewing the policy periodically \\u201cto ensure continued relevance\\u201d should seek a method to have the funds in place to finance international travel for T&T teams in order to provide some measure of comfort to the athletes, who will not be left until the last minute to know whether they are going or not. IN yet another incident which has had the effect of piling \\u00adembarrassment upon embarrassment for the authorities, a convict walked out of the Golden Grove facility in Arouca on Thursday, and was on the run up to last night. THE West Indies has had a phenomenal number of exceptional cricketers in its history. The captains have been mostly \\u00admiddling. I restricted the playbooks to those of Frank Worrell, Richie Benaud and Mike Brearley simply because they were known as thinking men; able in both the technical and \\u201cman-management\\u201d aspects of the game. International Youth Day is approaching. It is time for the youth of this country to stand up and make their voices heard. It is time to become more \\u00adinvolved in the political process to put an end to the corruption and mismanagement taking place far too often and for too long. Recently, the press \\u00adreported that a mother was in tears after her victim impact statement was read out in court during the trial of the accused for her son\\u2019s murder. She cried out for answers as to the reason the accused, having robbed her son of his \\u00adcellphone, had killed him. While the horizon must seem unrelievedly grim to many citizens, once in a while a few specks of bright light appear to \\u00adrelieve the gloom. And so it was \\u00adrecently when it was announced that the country\\u2019s first drug treatment court was to be established within three months. Regarding the arrest of Minister Marlene McDonald in the ongoing investigation of corruption charges levelled against her, Dr Rowley bought that wholesale. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/marlene-grilled-for-eight-hours/article_f805a324-bb0c-11e9-8663-5fcd22e380e6.html\", \"TITLE\": \" ...Marlene grilled for eight hours \", \"DATE\": \"7 hrs ago \", \"CONTENT\": \"VISITORS: Arima Mayor Lisa Morris-Julian and Laventille East/Morvant MP Adrian Leonce on Thursday night at the St Joseph Police Station, where they visited Minister of Public Administration Marlene McDonald, who was being held for questioning. \\u2014Photo: JERMAINE CRUICKSHANK {{description}} Email notifications are only sent once a day, and only if there are new matching items. VISITORS: Arima Mayor Lisa Morris-Julian and Laventille East/Morvant MP Adrian Leonce on Thursday night at the St Joseph Police Station, where they visited Minister of Public Administration Marlene McDonald, who was being held for questioning. \\u2014Photo: JERMAINE CRUICKSHANK MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. McDonald and her husband were brought to the Professional Standards Bureau office at Henry Street, Port of Spain, at about 8 a.m. yesterday. Shortly after, Pamela Elder SC and attorney Owen Hinds Jr arrived at the PSB office and went inside. Elder, who is representing McDonald and her husband Michael Carew, remained inside the building until about 2.15 p.m. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. TWO videos which show minors engaged in sexual acts with adults are now engaging the attention of police. This was confirmed by Children\\u2019s Authority chairman Hanif Benjamin yesterday. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. A PIPE FITTER who told the court he found and kept five protected turtles, has been arrested\\u2026 Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/jamaica-to-reward-olympic-athletes/article_2f3c4603-7ee6-576e-8ec3-d3d77725f6ae.html\", \"TITLE\": \" Jamaica to reward Olympic athletes \", \"DATE\": \"Sep 20, 2012 \", \"CONTENT\": \"lKINGSTON Jamaica's Prime Minister Portia Simpson Miller says athletes who represented the country in last month's Olympic Games in London will be rewarded for their efforts. The Jamaican Prime Minister made her disclosure in Kingston following reports that the government was considering making cash donations to the athletes. Prime Minister Simpson Miller says a special committee was set up to address this matter and she is currently awaiting its report. \\\"Yes, but that will have to be signed off by cabinet before I can speak to it\\\" Prime Minister Simpson-Miller told TVJ sports. \\\"There is a particular committee dealing with that and they will be giving us a report for cabinet and then we will discuss and see how we can assist\\\". Jamaica achieved their best-ever performance at the Olympics capturing a record 12 medals - four gold, four silver, and four bronze. 50 athletes in four sporting disciplines- track and field, swimming, Taikwando and equestrian represented the country. \\\"I am expecting it (the report) not Monday coming because I will be going to the UN meeting and have some bilaterals on the margins there\\\" said the Jamaican Prime Minister. \\\"Yes we should be hearing something by then. I don't want to tie myself to a particular date. I know the minister will be taking something for me before cabinet\\\". Earlier this month, Sports Minister Natalie Neita-Headley announced plans to stage celebrations in honour of the athletes on the weekend of national heroes' day around the middle of October. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/genes-and-olympic-athletes/article_108941fb-b9dc-5db1-b7bc-2e2ee9fdc152.html\", \"TITLE\": \" Genes and Olympic athletes \", \"DATE\": \"Aug 18, 2012 \", \"CONTENT\": \"CHAIRMAN of the People\\u0092s National Movement: Franklin Khan fastest man: Hasely Crawford, right, crosses the finish line to bring home T&T's first Olympic gold medal at the Montreal Games in 1976. CHAIRMAN of the People\\u0092s National Movement: Franklin Khan fastest man: Hasely Crawford, right, crosses the finish line to bring home T&T's first Olympic gold medal at the Montreal Games in 1976. Yams. Pelting mango. Sea breeze. These are some of the explanations proffered, only half-jokingly, for the success of Caribbean athletes at the Olympic Games. But the real explanation may be even more basic. \\\"There's the philosophy of what makes a champion, nature versus nurture,\\\" says sports medicine specialist Dr Anyl Gopeesingh. He cites research which shows that it takes about 10,000 hours of practice (or about ten years) to master any particular skill, but also notes that genes account for 35 per cent to 45 per cent of the kind of muscles an individual has. \\\"The idea is that there are dormant genes which are activated by practice,\\\" Gopeesingh, 36, explains. \\\"But there are people who may put in the 1,000 hours and nothing happens. Therefore, the genetic component is necessary.\\\" Dr Terence Babwah, 39, who has a Master's degree in Sport and Exercise medicine, agrees. \\\"The major factor appears to be genetic,\\\" he says in respect to Caribbean athletes' success at the Games. But he also believes the rural background of the athletes helps. \\\"Genes are only one aspect. The diet, such as the complex carbohydrates from provisions, is also a factor.\\\" So what are these genetic factors The major gene related to athletic performance is labelled ACTN3. Muscles fibres come in two types, \\\"fast twitch\\\" and \\\"slow twitch\\\". The former is good for speed, the latter is good for endurance. And tests conducted on 200 Jamaican athletes in 2008 by the University of Glasgow and the University of the West Indies identified Actinen A in the fast-twitch muscles of 70 per cent of the athletes from Jamaica, as compared to only 30 per cent in an Australian group. These genes can be traced back to the Caribbean athletes' West African ancestry, and Babwah suggests that Afro-Caribbeans have a physiological advantage over even their ancestors. \\\"It may be that only the fittest individuals survived the journey here,\\\" he says. \\\"Those who went to Jamaica had the longest trip.\\\" American journalist Jon Entine, author of Taboo: Why Black Athletes Dominate Sports, in an article in Forbes magazine published earlier this month, writes: \\\"West Africans and North American, Caribbean and European blacks who trace their ancestry to the Middle Passage...generally have bigger, more developed overall musculature; narrower hips, lighter calves; higher levels of plasma testosterone; faster patellar tendon reflex in the knee; and a higher percentage of fast-twitch muscles and more anaerobic enzymes, which can translate into more explosive energy.\\\" Table 1 shows the gold medal winners in the men's 100-metre sprint in the past ten Olympics. With one exception (Scottish runner Allan Wells, who ran in 1980 when the USA boycotted the Games) all are of African descent. TABLE 1: 100-metre sprint Olympic winners Year Name Country Time 1976 Hasely Crawford T&T 10.06 1980 Allan Wells UK 10.25 1984 Carl Lewis USA 9.99 1988 Carl Lewis USA 9.92 1992 Linford Christie UK 9.96 1996 Donovan Bailey Canada 9.84 2000 Maurice Greene USA 9.87 2004 Justin Gatlin USA 9.85 2008 Usain Bolt Jam 9.69 2012 Usain Bolt Jam 9.63 Table 2 shows the top five medal-winning countries on a per capita basis. That is, although America and China won the most medals, they have large populations and so a larger pool of athletes to draw on. But, if size is taken into account, the United States and China rank quite low in Olympic victories and T&T takes the lion's share of medals. TABLE 2: Top Olympic nations per capita Rank Country Weighted medals 1 Grenada 4 2 Bahamas 4 3 Jamaica 28 4 New Zealand 33 5 Trinidad and Tobago 37 Source: Simon Forsyth, University of Queensland By this criterion, India with its 1.2 billion people is glaringly absent, having taken only six medals in the 2012 Olympic Games. An article in CNBC by Catherine Boyle notes, \\\"India's team came back with one medal per 200 million people in its burgeoning population. By this ranking, they did a thousand times worse than Grenada.\\\" Economist Abhijit Banerjee in his 2011 book Poor Economics (co-authored with Esther Duflo) notes that India \\\"has won an average of 0.92 medals per Olympics, over the course of 22 Olympic Games, putting it just below Trinidad and Tobago at 0.93.\\\" Banerjee attributes this to malnutrition, saying, \\\"Given that child malnutrition is....where South Asia really stands out, it seems plausible that these two facts wasted children and Olympian failure have something to do with each other.\\\" But this makes little sense. About one-third of India's population is categorised as poor, and only about three per cent as wealthy and 12 per cent as middle-class. But that still works out to 180 million people who are not malnourished, which means that there must be some other factor which accounts for India's under-performance in sports. This under-representation is also the case for India's diaspora population, including T&T, where Indians are generally found at top levels only in cricket. If genes account for African success, might genes not also account for Indian failure \\\"It could be,\\\" says Babwah. \\\"I don't want to go so far. It might just be the selection process, and the caste system.\\\" In T&T, he says, \\\"Indian parents don't encourage their children to go into sports, except cricket.\\\" Gopeesingh thinks Indians have athletic potential in sports with a lower power-to-mass ratio, such as cricket and volleyball. In his Forbes article, Entine notes: \\\"Asians, on average, tend to be smaller with shorter extremities and long torsosevolutionary adaptations to harsh climes encountered by Homo sapiens who migrated to Northeast Asia 40,000 years ago. China, for example, excels in many Olympic sports, for a variety of reasons. One of those reasons, according to geneticists, is that they are more flexible on averagea potential advantage in diving, gymnastics (hence the term \\\"Chinese splits\\\") and figure skating. Whites of Eurasian ancestry are mesomorphic: they have larger and relatively more muscular bodies with comparatively short limbs and thick torsos. No prototypical sprinter or marathoner here. These proportions are advantageous in sports in which strength rather than speed is at a premium. Predictably, Eurasians dominate weight-lifting, wrestling and most field events, such as the shot put and hammer. At the London Olympics, with the exception of North Korea, the top lifters come from a band of Eurasian countries: China, Kazakhstan, Iran, Poland, Russia and the Ukraine. Despite the image of the sculpted African body, no African nation won an Olympic lifting medal.\\\" India's six medals were in sports which did not require speed, stamina, or strength, but which emphasised reflexes, flexibility, and hand-eye coordination: shooting, badminton, wrestling, and boxing. Similarly, China's 88 gold medals were won in just five of the 38 Olympic sports: diving, swimming, badminton, weight-lifting, and artistic gymnastics. (It should be noted, too, that India's boxing medal and China's weight-lifting one were won by women.) The United States took home its top haul of 104 medals in 19 events, with 57 per cent of the medals coming from swimming and track and field. Does this mean that T&T should concentrate on sports in which the population has a genetic advantage Gopeesingh doesn't think so. \\\"Then you would never find a Keshorn Walcott,\\\" he points out. He thinks there should be multi-sport development, and cites a Canadian programme which has primary school children training in just running, swimming, and gymnastics. \\\"When they decide on a sport at 14 or 15 years, then they have the basic skills for anything,\\\" he says. Babwah emphasises the need for professional coaching and proper physiological analysis of budding athletes. Because of a lack of coaching, a lot of local athletes get bad habits and never learn the basic skills of their sport. And then there is the lack of proper sport medicine. \\\"There are many promising athletes who have been stopped by recurring injuries,\\\" he explains. \\\"Had they been picked up early, they could have been trained to prevent injuries.\\\" Babwah also points to nutrition as a key barrier. \\\"Many of them eat a doubles or a KFC, even the national teams would not eat good food, they say the meals not tasting good. That is the general attitude.\\\" TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/online_features/family_living/young-athlete-recovery/article_db4e0a8a-0677-5bc2-93d4-0d6c62f7ac6f.html\", \"TITLE\": \" Young Athlete Recovery \", \"DATE\": \"Aug 5, 2019 \", \"CONTENT\": \"(Family Features) Between sports practices, training, games and tournaments, teen athletes endure a lot of stress on their bodies. While some parents know real dairy milk is a nutritious option for growing kids, many don\\u2019t realize that chocolate milk has nutritional benefits, too \\u2013 especially when it comes to exercise recovery. According to a first-of-its-kind study from the University of Texas at Austin, recovering with low-fat chocolate milk as part of a tough training routine could help teen athletes get stronger. The study included more than 100 high school athletes entering grades 9-12 who were enrolled in a five-week training program involving training four days a week. Some students recovered with chocolate milk and others recovered with a sports drink with the same amount of carbohydrates but no protein. Researchers found that students who recovered with chocolate milk had greater strength gains compared to those who recovered with sports drinks. In fact, the chocolate milk group bench-pressed an average of 3.5% more at the end of the program than at the beginning, whereas teens who recovered with sports drinks actually decreased their bench-press weight by close to the same amount, around 3.2%. Additionally, those who recovered with chocolate milk improved in squat strength by nearly twice as much as those who consumed sports drinks for post-workout recovery, lifting an average of 15% more weight (compared to about 8% more weight) by the program\\u2019s end. On top of high-quality protein to help build muscle, each 8-ounce glass of chocolate milk has carbohydrates to help bodies refuel; fluids and electrolytes to help rehydrate; calcium, vitamin D and phosphorus to build and maintain strong bones; vitamin A to support a healthy immune system and B vitamins to help bodies convert food into energy. Top all that off with the taste kids love, and chocolate milk is an easy way for teens to get the nutrition they need to be their best, in athletics and beyond. To learn more about the science supporting the benefits of chocolate milk for recovery, visit BuiltWithChocolateMilk.com. Photo courtesy of Getty Images TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/taking-the-sport-out-of-sports/article_5ff251b6-9acd-58bf-a9f8-c2dd3079be53.html\", \"TITLE\": \" Taking the sport out of sports \", \"DATE\": \"Dec 7, 2008 \", \"CONTENT\": \"Sometimes you just want to go down the road to the Savannah and watch some real sport for a change. It may be nothing more than a few fellas refusing to accept the inevitable consequences of advancing years, huffing and puffing their way through a Sunday morning football sweat. Or some athletic young men, putting aside their preoccupation with babes, bling and gang warfare (not necessarily in that order) and channelling all that pent-up energy and anger on the makeshift basketball court. Whatever it is, these anonymous occasions of loosely organised athletic activity seem to be much closer to the fundamental essence of sport than some of the global mega-events that preoccupy the attention of hundreds of millions of fans around the planet whose list of priorities is topped by the need to ensure that the cable TV bill is paid promptly and that a fraction of the monthly budget is set aside for the must-see pay-per-view events that crop up every now and then. More and more, we're seeing that the competition is not in the event itself, but the duel of television executives and broadcasting companies to reinvent, rebrand and aggressively market variations from the traditional fare, or at least present the old stuff as something different, just to ensure that the target audience, which has so many options to choose from, stays interested. You look at a lot of international football and wonder what all the fuss is about. Mediocrity and boring predictability, even with enhanced crowd sound effects and an excitable commentator, is still mediocrity and boring predictability. Former national player Carlton Franco, back home for the launch of the Veteran Footballers Foundation two Sundays ago, wasn't as harsh as that but essentially said the same thing when comparing the systems and regimented structure of the modern game with the improvisation (critics will say disorganisation) and intuitive thinking that was demanded in the days when he played in front of the Grandstand. Pete Sampras, still the holder of the record for the most Grand Slam singles titles at 14, was last week lamenting the growing one-dimensional nature of men's tennis with the vast majority of players on the professional circuit Roger Federer is the one notable exception preferring to stay on the baseline and exchange booming groundstrokes and passing shots with their opponents, thanks in no small measure to advanced technology that gives the modern exponent more power of shot than even the champions of previous eras ever managed off their racquet strings. In the face of such repetitiveness, somebody with enough influence always comes up with a bright made-for-TV idea, like last year's three-match series between Federer and Sampras or the one-off event that pitted Federer against Rafael Nadal, with one side of the court being carpet and the other clay. And let us not forget that Sir Allen Stanford's \\\"20/20 for Twenty\\\" is just another manifestation of the attempt to cash in on the rising tide of popularity in this newest and shortest form of international cricket to the extent that it threatens the viability, if not the existence, of the traditional variety. Such gimmickry and artificiality fly in the face of what a sporting contest should really be about, but as long as there are enough people prepared to pay enough money for such glorified non-events, they will continue to prosper. Which is why Oscar de la Hoya and Manny Pacquiao met in the ring in Las Vegas on Saturday night for a non-title event that was typical of the stage-managed sideshow that professional boxing has become. This latest so-called \\\"Superfight\\\" ended after the eighth round with the 29-year-old Filipino, generally regarded as the best pound-for-pound fighter today, dominating the American from start to premature finish. De la Hoya, stopped for only the second time in his 16-year professional career, hardly mustered a serious challenge and later conceded that he didn't have what it takes anymore, physically, to be competitive with the very best in the business. Yet his lack of energy would be no surprise to those familiar with the challenges of a heavier fighter losing a considerable amount of weight to make the 147lb welterweight category, a division that de la Hoya hadn't fought at for seven years. Indeed, it was speculated that, in the time between the weigh-in the previous day and the opening bell on Saturday night, de la Hoya would have been back up almost to 160lbs, all of which would have taken a serious toll on his effectiveness when it really mattered in the ring. On the other hand, Pacquiao had to move up two weight classes to compete as a welterweight, a task the medical experts say would not have been as challenging and physically taxing as the weight-loss that de la Hoya had to undergo to meet the requirements of the fight. So why go through all of that for a manufactured contest in which there was no title at stake We all know what the answer is of course: money. Pacquiao earned US$11 million, his biggest purse ever. But hear this. Despite enduring the beating of his life, de la Hoya is expected to collect almost twice that amount by the time the revenue from the pay-per-view audience is assessed. Not even the old saying about the victor taking home the spoils holds true anymore in this upside-down, wheeling-and-dealing world of contemporary professional sport. At least there's always the Savannah. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/sports/local/stop-athlete-abuse/article_61907364-a289-541b-b962-4e53a8ecf66c.html\", \"TITLE\": \" STOP ATHLETE ABUSE \", \"DATE\": \"Nov 6, 2016 \", \"CONTENT\": \"Six-time World Masters Track and Field Championship gold medallist, Marsha Mark-Baird has lashed out against sports officials here in Trinidad and Tobago for what she describes as athlete abuse. \\u201cI'd like to fight for the rights of athletes,\\u201d she told the Express. \\u201cWe've been mistreated and sometimes abused by those in power. There are too many people in sporting associations who are there to gain for themselves. It's about the athlete and always about the athlete. If you're benefiting more than the athlete you're supposed to be serving, you're no longer serving them. You're only serving yourself.\\u201d Mark-Baird said there were examples of the abuse she is referring to at the 2015 and 2016 National Championship meets. \\u201cI was sickened by the way officials spoke to athletes, as if they were stray dogs on the streets. There's no respect for athletes, and it has gotten worse. I thought it was a cultural thing when I was a teenager. Now, I see it's a form of disrespect and abuse. \\u201cEvery single track and field athlete, coach or parent,\\u201d she continued, \\u201cknows exactly what I'm talking about. It's about time we take a stand and do something. Coaches, stand up for your athletes. Athletes, stand up for yourselves.\\u201d US-based Mark-Baird is determined to play her part in the development of track and field in T&T. \\u201cI plan on being an ambassador to help athletes in Trinidad and Tobago. Last year, I gave out cards to all the coaches I knew as a way for them or their athletes to contact me if they needed help with athletic scholarships abroad. I also did that this year.\\u201d Mark-Baird is a two-time Olympian. She represented the country at the Sydney Games in 2000, and again at the 2004 Athens Games. In Athens, the Point Fortin athlete earned 5,962 points in the heptathlon. Twelve years later, that score is still the national record. \\u201cThe heptathlon is not a hard event. We have plenty of talent in Trinidad and Tobago, and I know somewhere out there we will have another Olympian in the heptathlon. Girls, ladies, dream big and stick to your game plan.\\u201d Jereem \\u201cthe Dream\\u201d Richards, in the Men\\u2019s 200m dash, and the Men\\u2019s 4x100m relay team both grabbed silver last evening, helping Team TTO to its biggest medal haul at a Pan American Games with two more days to go. Team TTO rower Felice Aisha Chow continues defying her age, creating history by becoming the first rower from this country to win a Pan American Games medal in the sport when she earned silver in the Women\\u2019s Singles Sculls 2000m event yesterday at the Lima 2019 Games. The 2019 season has been a tough one for Jereem \\u201cThe Dream\\u201d Richards. Adversity, though, mak\\u2026 Team TTO top swimmer Dylan Carter rebounded from disappointment with a bronze medal response in the Men\\u2019s 100m backstroke Thursday night. After failing to deliver all series, the West Indies \\u201cA\\u201d batsmen finally came good to deny India \\u201cA\\u201d a series sweep as they held on to draw the final match of the three-game series at the Brian Lara Cricket Academy in Tarouba, yesterday. Joy turned to sorrow for Tyra Gittens in the 2019 Pan American Games women\\u2019s heptathlon here in Lima, Peru. Poised for the podium following the first four disciplines, on Wednesday, disaster struck for the Trinidad and Tobago athlete early on Thursday. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/athletes-return-for-govt-honours/article_04b8e467-9db2-53ee-aee4-0aa1051cfe86.html\", \"TITLE\": \" Athletes return for Govt honours \", \"DATE\": \"Sep 10, 2012 \", \"CONTENT\": \"Most of Trinidad & Tobago's foreign-based Olympic athletes have returned home and will join their locally-based teammates for a series of activities designed to honour them for their accomplishments at the 2012 Olympic Games. The primary event, for which the athletes have returned, is a reception celebrating their achievements, and will be hosted by Prime Minister Kamla Persad-Bissessar at the Diplomatic Centre tomorrow. T&T won four medals at the 2012 Olympics in London. Nineteen year-old Javelin thrower Keshorn Walcott won this country's second-ever gold medal, and the first since Hasely Crawford won 100m gold in Montreal, Canada, 36 years ago. Winning bronze were 400 metre runner Lalonde Gordon; the 4 x 400m men's team of Lalonde Gordon, Jarrin Solomon, Ade Alleyne -Forte and Deon Lendore; and also the 4 x 100m men's relay team consisting of Keston Bledman, Marc Burns, Emmanuel Callender and Richard Thompson. Cyclist Njsane Phillip reached the semi-finals of the match sprint, while swimmer George Bovell reached the final of the 50m freestyle. Jehue Gordon, Richard Thompson and Kelly Ann Baptiste also reached the finals of their event. In addition to tomorrow's ceremony, the Sport Company of T&T (SPORTT) and the Ministry of Sport have planned two activities: a media conference from 2 p.m. today at the Jade Room, Hyatt Regency Hotel, and a school symposium to be held from 10 a.m. tomorrow at the Little Carib Theatre, Woodbrook. Secondary schools who are part of the International Inspiration programme, as well as other Secondary and Primary schools in the Port of Spain area and from Tobago, will be in attendance. The focus of the symposium is to allow for interaction between students and athletes with students posing questions on a range of topics that may include the Olympic experience, the life of an elite athlete, the importance of education in pursuit of sporting goals, the role of sport science in performance and brand/marketing management for athletes. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/government-cops-respond-to-marlene-mcdonald-s-arrest/article_b8221798-b9e4-11e9-8bc6-afafcc864fa6.html\", \"TITLE\": \" Government, cops respond to Marlene McDonald's arrest \", \"DATE\": \"21 hrs ago \", \"CONTENT\": \"Port of Spain South MP Marlene McDonald FLASHBACK: Newly appointed Minister of Public Utilities Marlene McDonald is congratulated by, from left, close friend Michael Carew, Jean Elder, chairman of the Port of Spain South Constituency, Port of Spain \\u201ccommunity leader\\u201d Cedric (Burkie) Burke, Kenroy Dopwell and Sharon Felix at President's House, St Ann's, after she was sworn in. \\u2013Photo: CURTIS CHASE Minister of Public Administration, Marlene McDonald MP Marelene McDonald's constituency office. {{description}} Email notifications are only sent once a day, and only if there are new matching items. Port of Spain South MP Marlene McDonald Government this afternoon acknowledged for the first time the police investigation involving Public Administration Minister Marlene McDonald. In a brief statement issued at 2:39p.m. newly appointed Communications Minister Donna Cox said: \\\"The Government of the Republic of Trinidad and Tobago (GoRTT) wishes to confirm that a search warrant was executed at the home of Minister of Public Administration the Honourable Marlene McDonald this morning (8 August 2019). However, this is an ongoing police investigation and further information will be provided as it is made available by the Trinidad and Tobago Police Service.\\\" Shortly after the Government's statement, the TTPS issued an statement of its own. The TTPS stated: \\\"Police officers investigating alleged corruption offences have arrested and taken into custody, Government Minister Marlene McDonald and her husband for questioning. They were detained earlier today, Thursday 8th August 2019. Enquiries are ongoing at this time and more information will be provided when it becomes available.\\\" At around dawn today, McDonald and her husband were detained. McDonald, the Member of Parliament for Port of Spain South was taken into police custody. The arrests were made at the couple's home at around 4a.m. by police executing a search warrant. The detention came after police went to the Director of Public Prosecutions Roger Gaspard with an investigation file on Tuesday. McDonald, a Cabinet minister, is being investigated on the allegation of misappropriation of public funds. MP Marelene McDonald's constituency office. The Express was told that McDonald, complained of feeling unwell and was treated at hospital. On June 1, 2017, Prime Minister Dr Keith Rowley advised then President Anthony Carmona to revoke the appointment of McDonald who was then Minister in the Ministry of Public Utilities. Minister of Public Administration, Marlene McDonald McDonald had only recently been sworn in as Minister in the Ministry of Public Utilities after a sixteen month period of absence from the Cabinet. Why was MacDonald fired then? McDonald met with Prime Minister Dr Keith Rowley the morning of her firing, as a result of the controversy caused by her choice of guests attending her swearing-in ceremony at the President's House in St Ann's days before. The commotion surrounds the presence of reputed \\\"community leader\\\" Cedric \\\"Burkie\\\" Burke, who accompanied contractor Kenroy Dopwell to the event. Senior elements of the national security community had expressed alarm at the presence of Burke, who has been engaging their attention. FLASHBACK: Newly appointed Minister of Public Utilities Marlene McDonald is congratulated by, from left, close friend Michael Carew, Jean Elder, chairman of the Port of Spain South Constituency, Port of Spain \\u201ccommunity leader\\u201d Cedric (Burkie) Burke, Kenroy Dopwell and Sharon Felix at President's House, St Ann's, after she was sworn in. \\u2013Photo: CURTIS CHASE Not only was he present, but Burke was introduced by her to the President and posed for pictures with Carmona Carmona. On August 2, Rowley reappointed McDonald, to the post of Minister of Public Administration. Burke was detained on Monday by police who seized his electronic devices including cell phones and laptops. He was questioned and released on Wednesday morning. Reporting by Alexander Bruzual Police need help in locating 16-year-old Shakira Moore. A woman and her lesbian lover were allegedly beaten by the woman\\u2019s husband after she confess\\u2026 FOURTEEN-year-old Nicholai Hodge died as a result of two stab wounds to the chest, an autops\\u2026 PRIME Minister Dr Keith Rowley, who spoke yesterdat to CNC3 News following the detention of \\u2026 Minister in the Ministry of Public Administration and Communications, Marlene Mc Donald spen\\u2026 Government Minister Marlene McDonald was dealt a third strike to her political career yesterday with her arrest by police on corruption allegations. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/sports/local/the-southern-games-is-back-on-sports-ministry-steps-in/article_992d877a-22e9-11e8-b799-4309bb91ece7.html\", \"TITLE\": \" The Southern Games is back on: Sports Ministry steps in with $$ \", \"DATE\": \"Mar 8, 2018 \", \"CONTENT\": \"Sports Minister Darryl Smith, left, presents a cheque for $150,000 to Southern Games event coordinator Carol Grandison, centre, at the St Clair\\u2019s Head Office of the Ministry of Sports on Wednesday. Sports Ambassador Hasely Crawford is at right. {{description}} Email notifications are only sent once a day, and only if there are new matching items. Sports Minister Darryl Smith, left, presents a cheque for $150,000 to Southern Games event coordinator Carol Grandison, centre, at the St Clair\\u2019s Head Office of the Ministry of Sports on Wednesday. Sports Ambassador Hasely Crawford is at right. This year\\u2019s edition of the annual Southern Games sport meet carded for March 18 is officially on as scheduled. A release from the Ministry of Sports and Youth Affairs (MSYA) on Wednesday has indicated that the Games\\u2019 54th edition, which was called off on February 20 due to a lack of funding, will go ahead as planned following an infusion of funds from the ministry and other corporate sponsors. Last week, chairman of the Southern Games Organising Committee, Jim Clarke told Express that the decision to cancel the event stemmed from marquee sponsor Petrotrin not being in a position to pledge their usual support, and the inability to get other corporate sponsors to fill the void left by Petrotrin. Clarke however, said he was grateful for the intervention of Trinidad and Tobago\\u2019s first Olympic gold medallist Hasely Crawford, who he said was able to rally some businesses to partner with the Ministry of Sports to make the event happen. \\u201cHasely played an integral role by calling the Minister of Sports as well as sponsors we never had on board before. With that happening, we called some of our regular sponsors like TECU Credit Union and PLIPDECO and was able to confirm their customary support.\\u201d Clarke said the one-day meet will place the highlight on local sporting personnel. \\u201cWe are really focusing on the development of our young athletes and cyclists, however, next year we would want a return of international competitors.\\u201d On Wednesday Sports Minister Darryl Smith presented a cheque in the sum of $150,000 to Carol Grandison, Event Coordinator of the Southern Games, to assist in the staging of the event. Crawford, who was present at the ceremony, said: \\u201cI am a product of the Southern Games and these Games are the warm-up for the CARIFTA Games, taking place at the end of March.\\u201d A former champion at multiple editions of the Games, Crawford recounted a host of internationally and locally renowned athletes who would have participating at the Games over the years, citing the names of international athletes Bob Hayes and Bruce Jenner, as well as local heroes Roger Gibbon, Edwin Roberts and Hilton Mitchell, among others. Crawford, one of T&T\\u2019s Sports Ambassador, expressed his gratitude to the MSYA and said he looks forward to continuing to work with the ministry towards sport development in the country and the promotion of T&T in sport regionally and internationally. Smith meanwhile, in expressing that his ministry was grateful for the opportunity to work closely with Crawford and the Southern Games Committee, said the Games is a national, iconic event, and the ministry could not allow for it to be cancelled this year. He pledged his continuous support and looks forward to many more editions of the Southern Games. Entrance fees to the Games are as follows: Stands A and B - $40; Stands C and E - $30; and $20 for the Grounds. Jereem \\u201cthe Dream\\u201d Richards, in the Men\\u2019s 200m dash, and the Men\\u2019s 4x100m relay team both grabbed silver last evening, helping Team TTO to its biggest medal haul at a Pan American Games with two more days to go. Team TTO rower Felice Aisha Chow continues defying her age, creating history by becoming the first rower from this country to win a Pan American Games medal in the sport when she earned silver in the Women\\u2019s Singles Sculls 2000m event yesterday at the Lima 2019 Games. The 2019 season has been a tough one for Jereem \\u201cThe Dream\\u201d Richards. Adversity, though, mak\\u2026 Team TTO top swimmer Dylan Carter rebounded from disappointment with a bronze medal response in the Men\\u2019s 100m backstroke Thursday night. After failing to deliver all series, the West Indies \\u201cA\\u201d batsmen finally came good to deny India \\u201cA\\u201d a series sweep as they held on to draw the final match of the three-game series at the Brian Lara Cricket Academy in Tarouba, yesterday. Joy turned to sorrow for Tyra Gittens in the 2019 Pan American Games women\\u2019s heptathlon here in Lima, Peru. Poised for the podium following the first four disciplines, on Wednesday, disaster struck for the Trinidad and Tobago athlete early on Thursday. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/athletics-rising/article_c1c316c6-813d-5076-b2ee-956322ca1e9a.html\", \"TITLE\": \" Athletics rising \", \"DATE\": \"Jul 9, 2014 \", \"CONTENT\": \"Trinidad and Tobago enjoyed a four-medal Olympic haul for the first time in the country's history at the 2012 London Games. T&T's previous best was the three-medal haul at the 1964 Games in Tokyo, Japan. It took almost a half-century to see improvement, and National Association of Athletics Administrations (NAAA) president Ephraim Serrette is keen to ensure there will not be another protracted waiting period for the citizens of T&T. In fact, he is expecting a six-medal haul at the very next Olympics\\u2014the 2016 Games in Rio de Janeiro, Brazil. \\\"Based on some of the measurement tools we are working with, we are looking at an increase of about two medals on our London performance. This is something we share with the athletes\\u2026what are our expectations.\\\" Keshorn Walcott's surprise gold in the men's javelin, together with three bronze medals on the track\\u2014Lalonde Gordon in the men's 400 metres, and the men's 4x100m and 4x400m teams\\u2014made London 2012 an Olympic Games to remember Jehue Gordon then kept T&T in the track and field spotlight, becoming the country's second-ever senior global athletics gold medallist with victory in the men's 400m hurdles at the 2013 IAAF World Championships in Moscow, Russia. Global titles in back-to-back years\\u2014an indicator that athletics is on the rise here in T&T. In an interview with a group of international journalists, Serrette zoned in on the factors he believes are responsible for the upward swing. \\\"The new vision of this executive and the communication lines that have been opened up. The technology is now allowing us to communicate much better with athletes so we know exactly what's happening with them. We try to have enough information, a relationship with their coaches and their entire team, so we have a better planning process. \\\"In a given year like the year of the Olympics, we try to liaise with the schools (American universities). Having competed in that arena, I know the coaches are looking to score points. We have developed relationships with some of the coaches, who will try to work with us so that they don't run the athletes ragged in a year when we have those types of competitions.\\\" Serrette says Walcott's Olympic success and Jehue's World Championship triumph have heightened the interest here at home in their respective events. \\\"We are seeing many more javelin throwers. We have young Shakeil Waithe who at our Carifta trials this year had a distance of 72.15 metres. We have another athlete in Aaron Enill, a newcomer. He's a goalkeeper from football coming into the sport, and he has been performing pretty well.\\\" Waithe has been enjoying a very successful season. The Tobago thrower earned Carifta Games and Central American and Caribbean (CAC) Junior Championship boys' under-20 gold. He captured the NGC/Sagicor National Open Track & Field Championship title as well, topping the field with a personal best 72.75m hurl. Nineteen-year-old Waithe is eighth on the 2014 global under-20 performance list, and will be a genuine medal contender at the July 22-27 IAAF World Junior Championships in Eugene, Oregon, USA. An even younger Tobago thrower has also been showing world class potential. \\\"We have young Tyriq Horsford who is coming out of our Age-group Championship team. As a 14-year-old he's on the Carifta team, and he has had some good distances as well.\\\" In April, at the Falcon Games here in T&T, Horsford threw the 700-gramme javelin an impressive 62.21m. And one week later, competing against 16 and 17-year-olds at the Carifta Games in Martinique, he finished fourth in the boys' under-18 javelin. Serrette says the national throws and jumps programme has been very successful. \\\"The area we're still struggling with is to develop a national track programme. That's a difficult one because coaches hold their athletes dear to them and would not release them into a national programme. I don't think we have matured to that stage as yet.\\\" The NAAA president is keen to restructure the administrative framework of his organisation. \\\"Sport now is big business. We are hoping in the near future we will be able to attract sponsors so that we could be self sufficient and in a much more sustainable position to manage a structure that would take the sport to the next level. \\\"I say that with respect to probably having the types of skill sets needed to run a business organisation\\u2014marketing, CEO, people who can bring funding to the association.\\\" Whatever methods are employed, the litmus test of success is global precious metal. The 2015 IAAF World Championships and 2016 Olympic Games will determine whether athletics in T&T is indeed on the rise. kwame.laurence@trinidadexpress.com EDITOR'S NOTE: Trinidad Express writer Kwame Laurence is among a select group of sports journalists chosen to be part of the latest IAAF Day in the Life series, a project featuring some of the Caribbean's best athletes as well as other major players in the sport of track and field. This week's article is the last of 15 instalments. Thanks for reading. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/pm-no-one-is-above-the-law/article_7b548146-bb0d-11e9-bd37-6b3070eef214.html\", \"TITLE\": \" PM: No one is above the law \", \"DATE\": \"10 hrs ago \", \"CONTENT\": \"AWAITING OUTCOME: Keith Rowley {{description}} Email notifications are only sent once a day, and only if there are new matching items. AWAITING OUTCOME: Keith Rowley THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. The Prime Minister admitted he was saddened by what had happened to McDonald, but reiterated that no one was above the law. And Government Minister Fitzgerald Hinds said he and other colleagues were surprised when they heard the news of McDonald\\u2019s arrest on Thursday. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. TWO videos which show minors engaged in sexual acts with adults are now engaging the attention of police. This was confirmed by Children\\u2019s Authority chairman Hanif Benjamin yesterday. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. A PIPE FITTER who told the court he found and kept five protected turtles, has been arrested\\u2026 Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/carifta-athletes-honoured/article_4a575a4c-40f3-55d8-9df0-50f0c25fd156.html\", \"TITLE\": \" Carifta athletes honoured \", \"DATE\": \"Apr 14, 2010 \", \"CONTENT\": \" Jehue Gordon was among five Trinidad and Tobago athletes honoured last Saturday for their performances at the 2010 Carifta Games, held in the Cayman Islands on Easter weekend. Gordon received a trophy for being the most outstanding under-20 male T&T athlete at the Games. On Easter Monday, he was presented with the Austin Sealy trophy for being the top performer at Carifta 2010. The 18-year-old athlete retained his boys' under-20 110 metres hurdles and 400m hurdles titles. In each event, he established a new championship record, clocking 13.41 seconds in the 110 hurdles and 49.76 in the one-lap hurdles. Gordon was also part of the T&T quartet that bagged bronze in the boys' under-20 4x400m relay. The other T&T athletes who were honoured at Saturday's functionheld at Spalkers in St Ann'sfor their outstanding performances at Carifta 2010 were Michelle-Lee Ahye, Mark London and Kernesha Spann. Ahye triumphed in the girls' under-20 100m and 4x100m events. London earned boys' under17 1,500m and 3,000m gold. And Spann won the girls' under-17 300m hurdles and anchored T&T to silver in the 4x400m relay. A special award was presented to 13-year-old Kenejah Williams. Team manager Alan Baboolal noted that Williams was \\\"the youngest competitor in Carifta 2010\\\". The Tobago athlete bagged bronze in the boys'under-17 discus. Gabriela Cumberbatch was also impressive at the Games, returning from the Cayman Islands with a complete set of medalsgold in the girls'under20 sprint relay, silver in the mile relay and bronze in the 400m hurdles. Speaking on behalf of the athletes at Saturday's function, Cumberbatch thanked the team management and technical staff, sponsors Guardian Holdings Limited (GHL) and National Gas Company (NGC), the Ministry of Sport and Youth Affairs, and the Sport Company of Trinidad and Tobago (SPORTT). T&T earned 12 gold medals, 16 silver and 12 bronze in the Cayman Islands, for a grand total of 40the country's best ever Carifta Games haul. \\\"Next year,\\\" said Cumberbatch, \\\"I'll like to ask that we have more supporters in the stands. With that we could do even better than this year.\\\" The young athlete also made an appeal to SPORTT's Chief Operating Officer. \\\"Lastly, I'd just like to thank Miss Margaret Birch-Sampson, in advance, for a new track at Hasely Crawford Stadium.\\\" The request from Cumberbatch was fully endorsed by her Carifta 2010 teammates, the loud roar making it absolutely clear that a new Mondo surface at the country's main athletics facility is high up on the wish lists of T&T's top junior athletes. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/it-s-part-of-a-diabolical-plan/article_a8d6c10c-bb0c-11e9-b669-5bce36994535.html\", \"TITLE\": \" It\\u2019s part of a diabolical plan \", \"DATE\": \"4 hrs ago \", \"CONTENT\": \"\\u2018PM get like a mouse\\u2019: Dr Roodal Moonilal {{description}} Email notifications are only sent once a day, and only if there are new matching items. \\u2018PM get like a mouse\\u2019: Dr Roodal Moonilal Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. There may be a more diabolical plan afoot, of which today is one small piece, and they may be up to no good and up to a \\u00addiabolical plan that may or may not involve us,\\u201d said Moonilal. He was speaking at the United \\u00adNational Congress (UNC) \\u201cpavement meeting\\u201d in the Barataria/San Juan constituency on Thursday\\u2014\\u00adthe same day McDonald and her husband were detained by police for questioning on corruption-related matters. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. TWO videos which show minors engaged in sexual acts with adults are now engaging the attention of police. This was confirmed by Children\\u2019s Authority chairman Hanif Benjamin yesterday. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. A PIPE FITTER who told the court he found and kept five protected turtles, has been arrested\\u2026 Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/athletics-rising/article_058ccfda-888a-56ab-9aa8-7c4b1813be30.html\", \"TITLE\": \" ATHLETICS RISING \", \"DATE\": \"Jul 10, 2014 \", \"CONTENT\": \"RISING STAR: Shakeil Waithe competes in the NGC/Sagicor National Open Track & Field Championship men's javelin event, at the Hasely Crawford Stadium in Port of Spain, on June 22. The 19-year-old Tobago thrower struck gold with a personal best 72.75 metres effort. Photo: ANISTO ALVES TRACK & FIELD BOSS: Ephraim Serrette GLOBAL SUCCESS: World champion hurdler Jehue Gordon trains at the Hasely Crawford Stadium in Port of Spain. Photo: JEAN-PIERRE DURAND for the IAAF RISING STAR: Shakeil Waithe competes in the NGC/Sagicor National Open Track & Field Championship men's javelin event, at the Hasely Crawford Stadium in Port of Spain, on June 22. The 19-year-old Tobago thrower struck gold with a personal best 72.75 metres effort. Photo: ANISTO ALVES TRACK & FIELD BOSS: Ephraim Serrette GLOBAL SUCCESS: World champion hurdler Jehue Gordon trains at the Hasely Crawford Stadium in Port of Spain. Photo: JEAN-PIERRE DURAND for the IAAF Trinidad and Tobago enjoyed a four-medal Olympic haul for the first time in the country's history at the 2012 London Games. T&T's previous best was the three-medal haul at the 1964 Games in Tokyo, Japan. It took almost a half-century to see improvement, and National Association of Athletics Administrations (NAAA) president Ephraim Serrette is keen to ensure there will not be another protracted waiting period for the citizens of T&T. In fact, he is expecting a six-medal haul at the very next Olympics\\u2014the 2016 Games in Rio de Janeiro, Brazil. \\\"Based on some of the measurement tools we are working with, we are looking at an increase of about two medals on our London performance. This is something we share with the athletes\\u2026what are our expectations.\\\" Keshorn Walcott's surprise gold in the men's javelin, together with three bronze medals on the track--Lalonde Gordon in the men's 400 metres, and the men's 4x100m and 4x400m teams\\u2014made London 2012 an Olympic Games to remember. Jehue Gordon then kept T&T in the track and field spotlight, becoming the country's second-ever senior global athletics gold medallist with victory in the men's 400m hurdles at the 2013 IAAF World Championships in Moscow, Russia. Global titles in back-to-back years--an indicator that athletics is on the rise here in T&T. In an interview with a group of international journalists, Serrette zoned in on the factors he believes are responsible for the upward swing. \\\"The new vision of this executive and the communication lines that have been opened up. The technology is now allowing us to communicate much better with athletes so we know exactly what's happening with them. We try to have enough information, a relationship with their coaches and their entire team, so we have a better planning process. \\\"In a given year like the year of the Olympics, we try to liaise with the schools (American universities). Having competed in that arena, I know the coaches are looking to score points. We have developed relationships with some of the coaches, who will try to work with us so that they don't run the athletes ragged in a year when we have those types of competitions.\\\" Serrette says Walcott's Olympic success and Jehue's World Championship triumph have heightened the interest here at home in their respective events. \\\"We are seeing many more javelin throwers. We have young Shakeil Waithe who at our Carifta trials this year had a distance of 72.15 metres. We have another athlete in Aaron Enill, a newcomer. He's a goalkeeper from football coming into the sport, and he has been performing pretty well.\\\" Waithe has been enjoying a very successful season. The Tobago thrower earned Carifta Games and Central American and Caribbean (CAC) Junior Championship boys' under-20 gold. He captured the NGC/Sagicor National Open Track & Field Championship title as well, topping the field with a personal best 72.75m hurl. Nineteen-year-old Waithe is eighth on the 2014 global under-20 performance list, and will be a genuine medal contender at the July 22-27 IAAF World Junior Championships in Eugene, Oregon, USA. An even younger Tobago thrower has also been showing world class potential. \\\"We have young Tyriq Horsford who is coming out of our Age-group Championship team. As a 14-year-old he's on the Carifta team, and he has had some good distances as well.\\\" In April, at the Falcon Games here in T&T, Horsford threw the 700-gramme javelin an impressive 62.21m. And one week later, competing against 16 and 17-year-olds at the Carifta Games in Martinique, he finished fourth in the boys' under-18 javelin. Serrette says the national throws and jumps programme has been very successful. \\\"The area we're still struggling with is to develop a national track programme. That's a difficult one because coaches hold their athletes dear to them and would not release them into a national programme. I don't think we have matured to that stage as yet.\\\" The NAAA president is keen to restructure the administrative framework of his organisation. \\\"Sport now is big business. We are hoping in the near future we will be able to attract sponsors so that we could be self sufficient and in a much more sustainable position to manage a structure that would take the sport to the next level. \\\"I say that with respect to probably having the types of skill sets needed to run a business organisation--marketing, CEO, people who can bring funding to the association.\\\" Whatever methods are employed, the litmus test of success is global precious metal. The 2015 IAAF World Championships and 2016 Olympic Games will determine whether athletics in T&T is indeed on the rise. kwame.laurence@trinidadexpress.com EDITOR'S NOTE: Trinidad Express writer Kwame Laurence is among a select group of sports journalists chosen to be part of the latest IAAF Day in the Life series, a project featuring some of the Caribbean's best athletes as well as other major players in the sport of track and field. This week's article is the last of 15 instalments. Thanks for reading. TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/news/local/games-an-inspiration-to-war-wounded-athletes/article_450542b2-0ef1-5132-ba89-8ecab07b3c8c.html\", \"TITLE\": \" Games an inspiration to war-wounded athletes \", \"DATE\": \"Sep 3, 2012 \", \"CONTENT\": \"blinded in blast: Brad Snyder blinded in blast: Brad Snyder l LONDON The explosion that took away Brad Snyder's sight couldn't touch the Navy lieutenant's fighting spirit. A year after Snyder stepped on an improvised explosive device laid by Taliban that he was trying to detect while on duty in Kandahar, the American is swimming at the London Paralympicsand adding sporting medals to his military ones. \\\"It was pretty much immediate that I (decided I) was going to try and minimise my blindness as much as possible, and get out and pursue success,\\\" Snyder told The Associated Press. \\\"Thankfully my support network was pretty savvy and said, 'You should check out this Paralympic swimming thing.'\\\" Snyder is glad he listened, having quickly excelled with the same determination he applied to clearing IEDs in one of the most dangerous Afghanistan assignments. Before Friday's anniversary of the blast, Snyder has already been on the London podium twice: winning gold in the 100-metre freestyle and silver in the 50. \\\"This is something every kid dreams of when they are eight,\\\" he said. \\\"I remember Tom Dolan winning the 400 IM in Atlanta (at the Olympics). \\\"Through blindness I've been able to experience a level of competition I never would have otherwise. So in a way I am very thankful for that.\\\" Snyder is one of many servicemen in London using sport to aid their recovery after being horrifically injured on the front lines of the Afghanistan and Iraq wars launched after the September 11, 2001 attacks on the US. \\\"I hope that my generation,\\\" Snyder says, \\\"the warriors coming back from Afghanistan and Iraq who are lying in bed missing a limb or whatever and they don't know what's next, can see my story and say: 'Hey, that's for me. If he can do it, I can too.'\\\" Snyder's remarkably fast journey from the battlefield to elite sporting competition began soon after he discovered he would never see again. He is one of the lucky ones, as shown by the tattoo commemorating a fallen comrade that adorns his chest. \\\"In my line of work, I had seen quite a few injuries due to blasts, and none of them were very good,\\\" Snyder said. \\\"I was able to see out of my left eye for a brief moment after I was blown up. \\\"I looked down and saw I had both my legs and both my arms, and immediately felt relatively optimistic about the outcome. I felt very thankful that maybe this isn't going to be so bad.\\\" There are 20 wounded servicemen on the US. Paralympic team, with six veterans of the Afghanistan or Iraq conflicts. \\\"To put a different uniform on, to put a track uniform on instead of my country's combat uniformit's a big honour,\\\" said Chris Clemens, who will compete in the 100 and 200 sprints and long jump. Clemens sustained brain injuries while serving as a Navy Seal in 2004 when a rocket-propelled grenade exploded at an Afghan camp. He now competes in the classification group for athletes with cerebral palsy. \\\"It allows me to escape my injury,\\\" Clemens said. \\\"It truly allows me to feel free. I see the disability gone.\\\" That was the sentiment sought by pioneer Ludwig Guttmann when he organised an archery competition for 16 patients at Stoke Mandeville Hospital in Britain for servicemen injured in World War II at the time of the 1948 London Olympics. The event evolved from 1960 into the Paralympics. British victims of the Afghan and Iraq conflicts are also competing, with eight former servicemen among the home team. The British programme, Help For Heroes, which assists the war wounded to use sport in their rehabilitation was inspired by Derek Derenalagi, who lost both legs in Afghanistan five years ago. The Fijian-born soldier was pronounced dead before a pulse was found just as he was being put into a body bag. His remarkable recovery was completed when he competed in the discus last week in front of 80,000 people at Olympic Stadium. \\\"I never, never imagined that I would get through to the Paralympic Games having suffered multiple injuries, losing both of my legs,\\\" he said. \\\"I watched the Paralympics in Beijing when I was still in hospital, and I made up my mind to make it into the Paralympic Games 2012. So I made it.\\\" As did Nick Beighton, who rowed for Britain less than three years after both legs were blown off in Helmand Province while he returned from a foot patrol. He spent 13 days in a medically induced coma. \\\"Sometimes the biggest battle is healing your mind, getting over what has happened and rationalising who you are now from who you were and what you thought you were going to be in life,\\\" Beighton said. \\\"You have a very fixed idea of who you are and what you want to achieve in...that is what the military teaches you. You set yourself a target and you push on beyond it.\\\" Finding a way of living when the focus has previously just been on surviving is often what it comes down to. \\\"There's no point being in the corner and letting yourself down after being injured,\\\" said British sitting volleyball player Netra Rana, a Gurkhas rifleman who lost his left knee in an explosion in Afghanistan. \\\"This is life. You have to find your way and find a way to enjoy yourself.\\\" TWO videos which show minors engaged in sexual acts with adults are now engaging the attenti\\u2026 The prisoner who escaped from the Maximum Security Prison on Thursday, has been found. THE arrest of Government Minister Marlene McDonald shows that no one is above the law, Prime Minister Dr Keith Rowley has said. Rowley made it clear yesterday that he was not afraid to take action against McDonald if that became necessary. MINISTER of Public Administration and MP for Port of Spain South Marlene McDonald was questioned for more than eight hours yesterday by Police Service investigators. Oropouche East MP Dr Roodal Moonilal has said the arrest of Government Minister \\u00adMarlene \\u00adMcDonald may be part of a \\u201c\\u00addiabolical plan\\u201d. \\u201cThis may well be a small piece in a bigger puzzle. FOUR months after 16-year-old St Anthony\\u2019s College pupil Akil Phillips was shot dead in front his grandmother\\u2019s Laventille home, no one has been held for his murder. As the months tick by, his mother, father and grandmother continue to mourn him. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram Please disable your ad blocker, whitelist our site, or purchase a subscription \"}",
    "{\"SOURCE\": \"https://www.trinidadexpress.com/sports/local/justice-for-all-athletes/article_acc97bb4-bb40-11e8-ab6a-f3122850a111.html\", \"TITLE\": \" Justice for all athletes \", \"DATE\": \"Sep 18, 2018 \", \"CONTENT\": \"FOUNDER: Dr Emir Crowne {{description}} Email notifications are only sent once a day, and only if there are new matching items. FOUNDER: Dr Emir Crowne Athletes here in Trinidad and Tobago and throughout the Caribbean now have access to legal representation when they choose to fight for their rights. The Sports Law Clinic was launched recently, and will provide pro bono services for regional and Canadian athletes. Prominent sports lawyer Dr Emir Crowne is the founder. The clinic is also staffed by Matthew Gayle, who works out of New City Chambers in Port of Spain, and Toronto-based sports lawyer Amanda Fowler. Crowne told the Express that the establishment of the Sports Law Clinic levels the playing field. \\u201cThe clinic is the first of its kind in the region. It provides pro bono representation to athletes across a variety of sporting tribunals. For far too long, athletes have been unable to access justice. They were simply at the mercy of their national sporting organisations, anti-doping bodies and others. \\u201cThe clinic seeks to address that imbalance,\\u201d the sports lawyer explained. \\u201cAthletes now have access to experienced representation when defending their rights, be it doping allegations, team selection disputes, disciplinary matters or otherwise.\\\" Crowne, Gayle and attorney Sheriza Khan are representing Dexter St Louis and Rheann Chung in their ongoing high court battle with the T&T Table Tennis Association (TTTTA) over the non-selection of the France-based pros for the 2018 Commonwealth Games in Gold Coast, Australia. St Louis and Chung did represent the Red, White and Black at Gold Coast 2018 following the intervention of the T&T Olympic Committee (TTOC). Crowne, who is on the Sport Resolutions (UK) International Panel of Arbitrators & Mediators and is an Editorial Board Member at LawInSport, has also represented T&T gymnast Thema Williams. Jereem \\u201cthe Dream\\u201d Richards, in the Men\\u2019s 200m dash, and the Men\\u2019s 4x100m relay team both grabbed silver last evening, helping Team TTO to its biggest medal haul at a Pan American Games with two more days to go. Team TTO rower Felice Aisha Chow continues defying her age, creating history by becoming the first rower from this country to win a Pan American Games medal in the sport when she earned silver in the Women\\u2019s Singles Sculls 2000m event yesterday at the Lima 2019 Games. The 2019 season has been a tough one for Jereem \\u201cThe Dream\\u201d Richards. Adversity, though, mak\\u2026 Team TTO top swimmer Dylan Carter rebounded from disappointment with a bronze medal response in the Men\\u2019s 100m backstroke Thursday night. After failing to deliver all series, the West Indies \\u201cA\\u201d batsmen finally came good to deny India \\u201cA\\u201d a series sweep as they held on to draw the final match of the three-game series at the Brian Lara Cricket Academy in Tarouba, yesterday. Joy turned to sorrow for Tyra Gittens in the 2019 Pan American Games women\\u2019s heptathlon here in Lima, Peru. Poised for the podium following the first four disciplines, on Wednesday, disaster struck for the Trinidad and Tobago athlete early on Thursday. Want to share good news story, or do you have information that should see the light of day? Then we want to hear from you. Instagram \"}"
]